[
  {
    "2024": "PD was so nice, he seemed genuinely interetsed in the applicants <not fame-worthy lol <--MORE THAN FAME WORTHY",
    "nrmpProgramCode": "2265140C0"
  },
  {
    "2023": "Sent rejection email then rescinded it. \"Whoops\" << i mean that sucks but doesn't really speak to the program, just a human error that anyone couldve done",
    "nrmpProgramCode": "2346140C0"
  },
  {
    "2023": "Spoke poorly of lower income family",
    "nrmpProgramCode": "1014140C0"
  },
  {
    "2023": "I did my clinical years here. The program is a total mess, which is why i didn't even apply to this program. PD is all over the place and the coordinator is very difficult to work with.",
    "nrmpProgramCode": "2277140C0"
  },
  {
    "2024": "sent the interview swag even to IMG intervieews",
    "nrmpProgramCode": "2214140C0"
  },
  {
    "2024": "PC Katrina Sy for working tirelessly to move applicants to their preferred interview dates and always being super timely with responses to emails. Absolute gem of a PC +5",
    "nrmpProgramCode": "1030140C0"
  },
  {
    "2023": "Apparently Harbor is on probation due to recent allegations of sexual harrassment from an ortho surgeon",
    "nrmpProgramCode": "1067140C0"
  },
  {
    "2024": "?",
    "nrmpProgramCode": "2150140C1"
  },
  {
    "2023": "PCs just DO NOT reply to emails (even emails with program related questions)",
    "nrmpProgramCode": "2138140C0"
  },
  {
    "2023": "provided interview invite 2 weeks after away rotation... in December, only 1 week before only available interview date",
    "nrmpProgramCode": "1043140C0"
  },
  {
    "2023": "Prob the most awkward group of residents I encountered this season +1",
    "2024": "Program Director seems to really care about residents: \"mentorship begins at Match Day\" + really good camaraderie among residency leadership as well as among residents +1",
    "nrmpProgramCode": "1033140C0"
  },
  {
    "2023": "requires in person interviews",
    "nrmpProgramCode": "2306140C0"
  },
  {
    "2023": "Residents seemed unhappy in the social +2",
    "nrmpProgramCode": "1076140C0"
  },
  {
    "2024": "PC was really nice and answered my question juat a few hours later",
    "nrmpProgramCode": "1093140C0"
  },
  {
    "2024": "Getting rid of 24s (hopefully) due to resident feedback! << They're gone now per PD",
    "nrmpProgramCode": "1089140C0"
  },
  {
    "2024": "Extremely friendly residents, although small categorical program having Med/Peds and IM/EM programs make it lively! Friendly administrative staff as well.",
    "nrmpProgramCode": "1099140C0"
  },
  {
    "2023": "they do not tell you interviewer beforehand/just one 20 minute interview",
    "nrmpProgramCode": "2193140C0"
  },
  {
    "2023": "PD takes only from certain universities in India/Pakistan. couldn't get an interview even with a strong connection in the program << it's probably your application then << well my application got me interviews in pretty decent places. and they rejected a bunch of people from my region with good applications as well. << sounds like they didnt want you, how is this a shame?? cry more.",
    "2024": "PD goes out of her way to help with fellowships << Honestly one of the strongest IMG programs",
    "nrmpProgramCode": "1800140C0"
  },
  {
    "2023": "No opportunity to meet the interns",
    "nrmpProgramCode": "1102140C2"
  },
  {
    "2023": "Sent out interview invites without having openings, didn't respond to emails about interview schedule",
    "nrmpProgramCode": "1102140C1"
  },
  {
    "2023": "Toxic, program admin will never be your advocate but opposite >>WDYM? <<explain pls<< more info?",
    "nrmpProgramCode": "1892140C0"
  },
  {
    "2024": "Friendly and supportive culture",
    "nrmpProgramCode": "1826140C2"
  },
  {
    "2023": "They hide residents during interview.",
    "nrmpProgramCode": "1826140C0"
  },
  {
    "2023": "Super rude PD, interview was in-person and I flew halfway across the country only to be interrogated about all the negatives on my application. Majority males in the program.",
    "nrmpProgramCode": "1771140C0"
  },
  {
    "2023": "Only met one resident during the entire interview // Yikes; that was not my experience but I'm sorry it was yours",
    "nrmpProgramCode": "1772140C0"
  },
  {
    "2023": "Didn't get to meet the interns, something to hide? Residents were kind of rude to interviewees<< likely a scheduling issue I was able to meet residents during mine",
    "nrmpProgramCode": "1981140C0"
  },
  {
    "2024": "Great PD!! +2",
    "nrmpProgramCode": "2107140C0"
  },
  {
    "2024": "Attendings are super cool",
    "nrmpProgramCode": "2323140C0"
  },
  {
    "2023": "Cancelled my interview 1 week before with no dates to reschedule.",
    "2024": "In person interview with 2 residents across the hospital and explaining the program. Good camraderie between residents and seems like a chill program with a good work-life balance.",
    "nrmpProgramCode": "2121140C0"
  },
  {
    "2023": "PCs not replying to emails or phone calls/HCA program",
    "2024": "Sent out a lot of program information",
    "nrmpProgramCode": "1587140C2"
  },
  {
    "2023": "No diversity, just US grads // bruh that's like 90% of programs +1",
    "nrmpProgramCode": "1109140C0"
  },
  {
    "2023": "former hca program",
    "nrmpProgramCode": "1867140C0"
  },
  {
    "2023": "incredibly malignant work hours and attendings, should've listened to residents who said so",
    "nrmpProgramCode": "1113140C0"
  },
  {
    "2023": "Not a lot of incentives to actually keep residents in the area post graduation, despite being the main mission.",
    "nrmpProgramCode": "2292140C0"
  },
  {
    "2024": "switched from traditional to 4+2 based on resident feedback, PD asks you what your career goals are and elaborates on how the program can help you succeed during group session rather than just listing out facts or reading off a PPT",
    "nrmpProgramCode": "3350140C0"
  },
  {
    "2023": "Its still HCA... 50% ABIM Pass rate... limited specialist rotations, almost all inpatient.",
    "2024": "PD is a reason to go to this program. Strong cards training.",
    "nrmpProgramCode": "2140140C0"
  },
  {
    "2024": "clean bathrooms",
    "nrmpProgramCode": "1226140C0"
  },
  {
    "2023": "Interviewer boasted that he was the one that selected me for interview and then proceded to talk over me during entire interview",
    "nrmpProgramCode": "3053140C0"
  },
  {
    "2023": "Interviewer did not have her camera on due to technical difficulties which made it awkward and hard to connect. Continued to ask a lot of tell me about a time questions and interrogated me about how many weeks of Sub-I, ICU and sub-specialties I'm doing as an MS4 which was very odd and something I have not been asked on my other 12+ interviews so far. Felt like the vibes were off and it sucks that there was only one faculty interview too :/.",
    "nrmpProgramCode": "1170140C0"
  },
  {
    "2024": "Fantastic leadership, immaculate vibes. Whenever we came back from breakout rooms the faculty were always laughing and joking around so the camraderie is >> +3",
    "nrmpProgramCode": "1150140C1"
  },
  {
    "2024": "Dr. Hur is the best PD I've met on the interview trail",
    "nrmpProgramCode": "1187140C0"
  },
  {
    "2023": "Always on name and shame in the past. Toxic environment. Funding is getting cut each year with less resources being provided. Most people match if they have a connection in the dept.",
    "nrmpProgramCode": "1232140C0"
  },
  {
    "2023": "disinterested interviewer",
    "nrmpProgramCode": "1225140C0"
  },
  {
    "2023": "PD was clearly reading from computer giving weird vibes.+3<<<all of her presentation sounded super scripted and awkward. They made the 5min meeting with the PD sound like a casual meet and greet but it actually felt like a rapid fire interview with her shooting questions at me.",
    "2024": "Med student here. Great teaching, residents seem to have work hard/play hard mentality, with lots of opportunities to see interesting cases, and New Orleans is great. +1",
    "nrmpProgramCode": "3073140C0"
  },
  {
    "2023": "Everyone in this program is quite fake including APDs, and residents. Although they claim to be nicer than JHH, I think they are just as toxic if not more. Regularly go over 80 hours/week. Residents were overworked, and unhappy and discouraged me from applying here.   ^ FYI current resident here, and I have literally never worked more than 80 hr/week even on our hardest rotations.<<I wish I could believe ya but had a rough first hand experience.>>> How did you have first-hand experience if you weren't a resident there? What was your exp with Bayview?",
    "nrmpProgramCode": "1237140C0"
  },
  {
    "2023": "All Pakistani/Muslim residents (similar to PD) << if you match, you're gonna need to work with a LOT of Pakistani and Muslim folks in your career, so I would strongly suggest getting over this particular grievance >>> how is this a shame?? At other institutions you work dominantly for mostly caucasions and no one notes that as a shame, this comment was not needed. <<<agree lol. by these standards every midwest program should be shamed for \"PD is white/christian and all the residents are white/christian 🤯\"",
    "nrmpProgramCode": "2316140C0"
  },
  {
    "2022": "are we sure this is a good hospital. I mean its Massachusetts General Hospital, you probably dont get to see any of the cases that go to Massachusetts Specific Hospital +3",
    "nrmpProgramCode": "1261140C0"
  },
  {
    "2023": "Residents seemed very unhappy and overworked",
    "nrmpProgramCode": "1269140C0"
  },
  {
    "2023": "Resident joked during a presentation about women in medicine that \"They are still trying to be as cool as us.\" it was especially cringe bc hes a PGY2 and his class is only 25% women << WOW. On Subi attending would routinly ask \"are you stupid\" to interns,,, otherwise residents given wild 'autonomy' with attendings nowhere to be found",
    "nrmpProgramCode": "1266140C0"
  },
  {
    "2023": "The IM inpatient side is rough. Morning report is from 7:30-8:30am and rounds start at 8:30am pretty consistently regarless of attending. Sign out is a 7 am but we are told to come in \"as early as you need to chart review and see all of your patients before 7:30\" which for most of the residents looked like 6:15-6:30am. The drip system also made it hard to get out on time, residents were frequently staying late. Sign out is at 6pm but with the \"drip\" admission system the team can get new admissions until 5pm. If you get a new admission at 4:45-59pm there's no way you'll get out on time, and this seems to happen multiple times per week. I saw residents frequently working 6:30am-7 or 8pm",
    "nrmpProgramCode": "3050140C0"
  },
  {
    "2023": "Uses their own hospital-specific EMR, which I've heard is terrible. However, was just aquired by Henry Ford, so maybe this will change",
    "nrmpProgramCode": "1308140C0"
  },
  {
    "2023": "58% board pass rate.",
    "nrmpProgramCode": "1930140C0"
  },
  {
    "2023": "Terrible match rate. PD and APD unsupportive, will sabotage their own for the sake of pettiness. Losing faculty with no replacements.",
    "nrmpProgramCode": "1303140C0"
  },
  {
    "2023": "No diversity...",
    "nrmpProgramCode": "1978140C1"
  },
  {
    "2023": "Comments appear to have been deleted by current program residents. However from the edits: : \"All the residents are in a terrible condition. They just want to move out as soon as possible. The APD and PC left and their own med students don't even apply there. They let go of a PGY-1 due to some paper work issue and their peds program fired one PGY-2 as well. They have kept a PGY-3 after graduation as well. Terrible program as of now with terrible place to live in. --Reply: PGY-1 who was let go lied on their ERAS app and it was discovered after several issues with the resident not completing work/lying. They fucked up multiple times and lied about completing work they didn't, even copying forward attending notes from weeks prior (this is the tip of the iceberg of problems). Dude was strongly hated by most if not all residents. PGY-3 who was held back didn't meet ITE standards to pass boards (happens at lots of programs). Not really a terrible program, idk what you're talking about dude. APD become program director at another program, a reasonable move.\">>>> I am not sure why most of the residents were not aware of the real reason that led the resident to get fired but still no resident said any good things about this program.",
    "nrmpProgramCode": "1320140C0"
  },
  {
    "2023": "DMC is run by Tenet, all residents looks burnt out but friendly",
    "nrmpProgramCode": "1361140C0"
  },
  {
    "2023": "40% board pass rate",
    "nrmpProgramCode": "2106140C0"
  },
  {
    "2023": "Residents spent the entire interview telling me how terrible the program was. Per resident feedback:   There is no teaching service, attendings are seeing up to 40 pts, often missing rounds, very self-led learning, hours hard but then have to try to learn on your own. Considering getting rid of 4+1. 1/5 residents matched in fellowship this year. In-house fellowships have never accepted their residents. Many residents feel underprepared for complex pts because it is learning by sheer numbers. Also often not evidence based.     I had a similar experience with my interview here. Resident spent the whole time trashing the program, say residents throw each other under the bus, feels like they don't get support, didactics are almost entirely resident run, poor education, \"low pass rate\" per him (in the low 80s), the hospital is understaffed, the ICU nurses are mean, things haven't improved, the hospital brings out the worst in people, said they're not paying for Uworld anymore, program subscribed to NEJM to \"improve board pass rates\" although he thinks that's sorta useless. Said lifestyle medicine is just modules that get in the way with other stuff, doesn't help with boards.",
    "nrmpProgramCode": "1866140C1"
  },
  {
    "2023": "Attending Interviewer was very rude, didn't want to be there. minimal   racial diversity with favoritism towards indians in general.  residents are very nice though and helpful for what its worth.",
    "nrmpProgramCode": "1866140C3"
  },
  {
    "2022": "Pretty sure this was supposed to be   for St. Joseph Mercy Oakland aka   Trinity Oakland in Pontiac. Not racist but that is a known fact there. I   believe even have had ssues with   discrimination towards favoring only   indian residents. Look at the   webpage and photo, almost   exclusively indian and has been   that way for many years",
    "2023": "Indian PD + all indian interns... hmmmmmmmmmmm <<<who tf keeps posting these racist comments.",
    "nrmpProgramCode": "1418140C0"
  },
  {
    "2023": "you have to pay for parking. Free parking technically available but not feesible at all. Tbf though their salary is high",
    "2024": "Michigan really knows how to make a Zoom social as minimally awkward as possible! The trivia was really fun. +9. Union seems cool",
    "nrmpProgramCode": "1293140C0"
  },
  {
    "2023": "Current PGY-2 and I just want to add some hot takes that wil undoubtedly seem unpopular. First off, I want to objective and say that the program is not at all malignant, but at the same time is not as \"flat hierarchy,\" as people make it seem.    First off, re collegiality. I want to rephrase this as everyone is \"nice.\" And at the same time, everyone expects you to be nice. Now, I don't want anyone to conflate this with polite, because everyone should be expected to be polite. But Mayo expects everyone to be Minnesota nice and often times, people are taken aback and offended by relatively benign things, such as answering a question, but not looking directly at them because you're busy putting in orders in a chart. This is small potatoes, but ultimately very emotionally draining. (+1 Not OP but someone who went here)    Rochester -- often the location is thought to be a deterrant, but people often say that affordability makes up for some of it. I call BS. By no means is it as expensive as big cities like LA, SF, or NYC, but there is a significant amount of price gouging for rent and restaurants because Mayo dominates the area, and so there is an expectation that people can afford higher prices. The small number of good restaurants is a small escape from the stress of residency, but the ridiculous prices make them a sparing indulgence.     In terms of education, I will agree that for education in almost any IM subspeciatly, Mayo is second to none. I acutally want to pursue a specialty myself. But I want into IM also because I wanted to be a good generalist, and this is quite lacking. I sincerely believe the hosptialists at my mid-tier medical school were much more well-versed internists because they weren't able to so easily rely on sub-specialty consults like at Mayo. I remember wanting to start one of my primary care patients on Insulin and they attending shook their head and said, just send them to endocrine. That is one example of bread and butter medicine that you miss out on by doing your training at Mayo. It is true also that Resident clinic sees a relatively underserved population, but this is all relative and there is no denying that Rochester is affluent compared to the rest of the country. This would not be a good place for people looking to work with the underserved.     Carrie Thompson, our program director. I want to say that she is somewhat benign. However, there have been some concerns about her ability to run the program well since she starte a few years ago. There have been complaints that the quality of fellowship matches has decreased since she took over, and reports of her not advocating for her residents as past program directors have. I know this is somewhat annoying to complain about, but THE MAYO CLINIC, should not have trouble matching their applicants to good programs. I can't speak to much more directly about fellowship matches since I myself haven't even applied, but I wills say some of the complaints appear well founded. Dr. Thompson really does give off an air of \"she will go to bat for you if she likes you.\" However, if she doesn't like you or is even neutral about you but you're a good doctor otherwise, doing well in the program, no professional complaints, she won't support you in your endeavors as she should as program director. This is upsetting because your career prospects should hinge on your performance as a doctor and not on the whims of a program director. Again, I know small potatoes in the grand scheme of how toxic residency can be, but Mayo Clinic will try to advertise itself as a perfect environment otherwise to overcome the poor appeal of Rochester, and I just want to say, that is not true at all.",
    "2024": "Promote the 4+4 schedule becuase they emphasize outpatient medicine just as important as inpatient medicine - for many subspecialties even, outpatient medicine is where you practice 95% of the time (allergy, rheumatology, oncology, primary care, etc.)",
    "nrmpProgramCode": "1328140C0"
  },
  {
    "2023": "??",
    "2024": "?",
    "nrmpProgramCode": "1365140C0"
  },
  {
    "2024": "Definitely has one of the best schedules in a top program. 4+2+2 with roughly half golden weekends off.",
    "nrmpProgramCode": "1353140C0"
  },
  {
    "2024": "Yeti Tumbler w/UNMC emblem on it for IV swag +1. In a year where programs seemed to be cutting down on sending IV swag, this was a much appreicated and thoughtful gift",
    "nrmpProgramCode": "1376140C0"
  },
  {
    "2023": "PD doesn't care about rotating medical students, it doesn't make me feel welcome or wanted - decreased on my rank list",
    "nrmpProgramCode": "1408140C0"
  },
  {
    "2023": "Residents here - even 3rd years - seem stressed and overworked",
    "nrmpProgramCode": "1387140C0"
  },
  {
    "2023": "Town is a hellhole, attendings are IMGs mostly >>> whats wrong w img attendings??? lol >>> worse medical schools <<< would hate to be a resident with you if you are that elitist <<< It's a fact, and why do you think US grads match better>>> why is the town a hellhole? <<< Grew up in this area and can say Vineland is VERY suburban. WIll be considered a \"shithole\" if you are single and don't have a support system already.",
    "nrmpProgramCode": "2086140C0"
  },
  {
    "2023": "eventually going to lose a hospital site as virtua started their own residency program, seem to be changing a lot of things soon and I don't know about being in a class where things are constantly changing",
    "nrmpProgramCode": "2120140C0"
  },
  {
    "2023": "a resident got stabbed by a patient recently?",
    "nrmpProgramCode": "1397140C0"
  },
  {
    "2023": "Rude PD +3. Unprofessional, arrogant",
    "nrmpProgramCode": "2375140C0"
  },
  {
    "2023": "Current resident here. Was excited to match here in the beginning. Over 2 years I wish I was somewhere else. Program has taken my spirit from me.  - The program is losing faculty at an accelerated rate  - The faculty that remain including APDs dont care anymore. One APD became VP and now only cares to make hospital money and advance own career  - Lectures are geared towards billing and making hospital money instead of medicine  - No neurologist, rheumatologist, endocrinologist on staff  - Horrible fellowship match rate. PD/APDs did not care to submit LORs on time despite being told month in advance  - Hospitalist service is mostly LOCUMs who dont care or teach. If they do teach, often is incorrect information  - When on wards often work 13 days in a row. On weekends no patient cap (have had 20 plus patients on my own list)  - Are going to lose prelim help due to discontinued contract with outside program, will result in more work with less help  All programs have their pros and cons. This program has many more cons than worth it. Please avoid.",
    "nrmpProgramCode": "2391140C0"
  },
  {
    "2023": "NOBODY SHOWED UP FOR THE RESIDENT SOCIAL. PROGRAM/RESDIENTS MUST HAVE COMPLETELY FORGOT <There was a social, started late though. <this is still a shame. having a social start super late when people have other interviews or things to do the next day is a shame",
    "2024": "Dr. Combs is the nicest PD I've met so far on the trail. It's no coincidence she was on the Best PD Awards tab during last year's cycle +1",
    "nrmpProgramCode": "1962140C0"
  },
  {
    "2023": "???",
    "2024": "?",
    "nrmpProgramCode": "1422140C0"
  },
  {
    "2023": "GME office very hard to get a response from",
    "nrmpProgramCode": "1492140C0"
  },
  {
    "2023": "PD clearly had not read over my application or PS until the start of my interview. Did not take step 2 as a DO applicant with average comlex score, but was told that program directors are not obligated to understand anything other than USMLE scores. PD considered this, as well as a course remediation as an immediate red flag. Overall very rude and not very understanding (or willing to be). Resident interview was lackluster. Of note, there are no in-house fellowships at this place, and resident stated this meant attendings were not at all willing to work with or help mentor them for future fellowship pursuits. Lastly and most important!!! The resident noted that the entirety of PGY1 year is spent \"following\". This highlighted a complete lack of resident autonomy during intern year.",
    "nrmpProgramCode": "1445140C0"
  },
  {
    "2024": "Seem chill",
    "nrmpProgramCode": "2230140C0"
  },
  {
    "2023": "PD sent email \"all 3 tracks just to get noticed or because you would be happy to be here under any circumstances, this will backfire. It just makes you look desperate\" < is this narcissism? <yesss +1 <to be fair one of the tracks was Jewish only, but had other applicants",
    "2024": "II to the Prince. Future applicants take note: to properly signal you must actively tweet with the PD and drop your AAMC ID. <<Damn, the Prince got an invite!!",
    "nrmpProgramCode": "3172140C0"
  },
  {
    "2023": "3 resident suicides: https://www.nydailynews.com/2021/07/17/nyc-doctor-suicides-raise-concerns-about-treatment-of-resident-physicians-at-bronx-hospital/",
    "nrmpProgramCode": "1484140C0"
  },
  {
    "2023": "Sent email to PC last week about other dates available, and she has not responded. Sent a follow-up email again on Monday, and still no response. Very weird. <- current resident here. our PC is getting massive emails, she just got an assistant so hopefully they will reach back to you! <- Is this weird? I emailed a lot of programs without getting a reply. PD said \"you dont need mental health resources here, the best thing for your mental health is to work for us and you will be fine\".... >> she also said if youre an IMG or DO dont expect to match cards fellowship at place like Mount Sinai.",
    "2024": "Very chill, PD is very engaged and invested, improving, close ties to sinai. Great salary, benefits, good schedule!    +1 for PD, super nice!",
    "nrmpProgramCode": "1491140C0"
  },
  {
    "2023": "Sent interview invite but no dates available +2",
    "nrmpProgramCode": "2070140C0"
  },
  {
    "2024": "PC Mildred Fernandez was absolutely lovely, and seemed extremely on top of her shit",
    "nrmpProgramCode": "3067140C0"
  },
  {
    "2023": "Sent interview invite with only one availabe interview date that already passed... emailed coordinator, and no response.",
    "nrmpProgramCode": "1429140C0"
  },
  {
    "2023": "Very DO unfriendly. Program does not match DOs",
    "2024": "PD Dr. Friedman was extremely kind and receptive to couples matching! Partner emailed and she responded very warmly and gave an interview within 24 hours+1",
    "nrmpProgramCode": "1700140C0"
  },
  {
    "2023": "NYU has fostered a culture of silence and retaliation beyond probably any other program. They've actively encouraged residents to snitch on each other about social media posts. Besides Zaki Masoud, several residents across departments have been threatened and told to stop posting about Palestine. Regardless of your personal politics it's clearly a malignant institution if this is the environment they're fostering among co-residents. <- Any current residents can comment? I didnt get this vibe <<Without specifics on what was being posted and how the residents are being threatened, this is a relatively meaningless accusation. Politics are controversial at baseline, middle eastern politics are of the most heated nature, and it is perfectly reasonable for a program to encourage residents to avoid posting anything that can be regarded as inflammatory and offensive. If this is really of a serious nature, please give some specifics of the content and/or threats +100 << he got reinstated anwyays <<< maybe the resident should have avoided being a dumbass online      stepping away from politics, I'm disappointed with the silence surrounding their brooklyn program, their recruitment tactics, and their fellowship matches. NYU-BK may as well be an entirely different program/hospital in ERAS but instead it is listed as a \"track\" within the main hospital, which was incredibly misleading. NYU-BK interview day was the only way I could see any fellowship matches from their their residents, but they were extremely shady and mixed those fellowshipt matches among those from the main NYU IM program. Other than that, they seem to hide this information elsewhere online. I'm amazed someone was able to post under the fellowship match tab where the NYU fellowship matches were from, it seems liek this info was somehow leaked by smeone in the program which I really appreciate because it's very hard to find online.",
    "2024": "Current resident: I won't address the political comments in the shame comment or the brooklyn program issue. I'll be focusing more on the NYU main program in Manhattan (Tisch and Bellevue tracks). Of the major manhattan programs, NYU is perhpas the *best* when it comes to ancillary tasks. Tisch hospital is incredible in regards to lab draws getting done, imaging happening quickly, etc. I don't know why exactly the nursing at Tisch / Kimmel hospital do so much (I guess they're not unionized?) but they do. I truly feel like some days I don't need to leave my desk unless it's to assess a sick patient; it's probably one of the few places where an IM resident can practice at the top of their license. There's not even a concept of calling to make an appointment or performing your own draws, it's not even a question here. On some services in Tisch, they even have PAs do discharges for you. Truly an incredibly well-oiled machine. Bellevue is of course a different story, but in \"faming\" the program I would like to point out that the program leadership escalated nursing issues with hospital leadership, and now there are q4 phlebotomy rounds. This means that in day-to-day work, very rarely will you need to draw your own routine lab. You will still have to ultrasound hard-sticks, and you will be responsible in rapids & codes on the floors, but it is not nearly as bad as some other programs are in Manhattan. One thing to note is that though there is immense diversity in the major NYU hospital systems, they're also all within 9 blocks of each other. Commuting is not at all a concept at the main program, which helps with work-life balance. Finally, program leadership at the main program is very responsive and open to feedback. There have been several major and minor changes that have been addressed while I've been here, mostly resident-suggested. While the Brookyln program issue is unfortunate and honestly awkward, the main program deserves some praise. <<what \"brooklyn program issue\" are you referring to, speficically?",
    "nrmpProgramCode": "2978140C0"
  },
  {
    "2023": "??",
    "2024": "?",
    "nrmpProgramCode": "1509140C0"
  },
  {
    "2023": "Program Coordinator was super rude. APD was rude. ..>>Presentation at the beginning of the IV was a super weird pre-recorded video; only had 1 IV (15 mins), which was with the APD who was super awkward; later during the resident Q&A we finally got to the see the PD... he never actually met us though because you could see he literally was in the resident room getting a slice of cake in the background of the zoom call!!",
    "nrmpProgramCode": "1897140C0"
  },
  {
    "2023": "Told me they prefer US MD applicants over IMG or DO, but said most MDs \"prefer to go elsewhere\". This program seems like a dumpster fire >> this is a strong assertion lmao. I can guarentee no one in program leadership said that. This comes off as very sour",
    "nrmpProgramCode": "1516140C0"
  },
  {
    "2023": "Resident union contact negotions going nowhere for over a year, Pimped on medical knowledge",
    "nrmpProgramCode": "3099140C0"
  },
  {
    "2023": "I'd say it's half shame. I was constantly asked about my clinical experiences and my medical school curriculum (IMG). While it is fair to verify the competency of your trainees, I didn't understand the need for interviewing me if all they'd do is doubt my credentials. >>> yeah it was weird. If it makes you feel better, USMD and I was asked the same questions lol. And they've accepted students from my school before. >>> Why?? I mean, thanks haha but why do they ask those questions? >>> Who knows, your guess is as good as mine. Maybe PD has some algorhythm and interprets it or maybe it matters more your thinking about training / education? Either way, best of luck! Nothing we can do about it now haha.",
    "nrmpProgramCode": "2157140C0"
  },
  {
    "2023": "alleged resident sex parties per previous spreadsheet and reddit post. Could be \"fame\"-worthy if thats what you're into i guess. APD maybe part of it too << I mean if no one was coerced into joining these parties what's the problem here?? <<thats a fair point but i think its notable enough to go somewhere and i dont think it belongs under \"fame\", I imagine most of us aren't looking for that kind of vibe in a program. Also even if it's between consenting adults, APD (allegedly) shagging residents is poor boundaries/unprofessional << fair I overlooked the APD part, that's a power dynamic that shouldn't be fucked with, both figuratively and literally<<how can this be true? Seems impossible??!! True??? <<I can't specifically comment on the sex parties but it is worth noting that Woodhull is one of the most malignant programs in the country. Just search \"Woodhull malignant\" on google and it isn't hard to find info on it. They had a resident suicide 3 years ago too who specifically mentioned toxic workplace as his reason for ending his life <<program described as a \"shithole warzone\"",
    "nrmpProgramCode": "3116140C1"
  },
  {
    "2024": "PD is incredible and super kind!",
    "nrmpProgramCode": "1529140C0"
  },
  {
    "2023": "This residency program is HCA in all but name. Residents seem below average in knowledge base. Didactics are low quality. Mission hospital is absolutely terrible (HCA's #1 most profitable hosptial in the US). Not as many elective opportunities bc HCA is hesitant to send residents places where they arent generating money. Residents dont have access to the physicians lounge. Poor chances of matching into a fellowship. Many of the ICU attendings in particular are private practice and not used to working with residents. Midlevels were prioritized over residents for procedures in the ICU",
    "nrmpProgramCode": "3023140C0"
  },
  {
    "2024": "PD sent a personalized email the day before the IV introducing herself and talking about how she was looking forward to hearing more about specific parts of my application, which was so cool!",
    "nrmpProgramCode": "1900140C0"
  },
  {
    "2023": "Do they only take people that auditioned (ie almost all their interns auditioned)",
    "nrmpProgramCode": "1576140C1"
  },
  {
    "2024": "really good vibes from APD and PD!",
    "nrmpProgramCode": "2203140C0"
  },
  {
    "2023": "APD very rude",
    "nrmpProgramCode": "1566140C0"
  },
  {
    "2023": "Summa Health was purchased by VC General Catalyst and is going to become a for-profit hospital: https://www.statnews.com/2024/01/17/general-catalyst-buy-summa-health/",
    "nrmpProgramCode": "1541140C0"
  },
  {
    "2024": "Amazing PC - rescheduled me to another date when issues came up the interview day. Was super nice!",
    "nrmpProgramCode": "1579140C0"
  },
  {
    "2024": "PD is very personable",
    "nrmpProgramCode": "2162140C0"
  },
  {
    "2023": "fuck the consultants who work here",
    "nrmpProgramCode": "1594140C0"
  },
  {
    "2023": "ED Doc Esther Choo covered up sexual assault and actively promoted the perp on social media. She's still full-time faculty I think. Information about it available on google and her wikipedia page << obviously terrible, but isn't that EM related and not IM? << It's institutionally related (+2, covering up SA is not something that just has to do with one doc, there should be an entire process for things like this that isn't different from program to program. It's an HR problem) . Their cards program disbanded years ago for something similar and most left OHSU and went to Kaiser or Providence. <also worth mentioning they just have a weirdly large # of sexual assault cases. I'm seeing 4 in the last 5 years just from my googling",
    "nrmpProgramCode": "1599140C0"
  },
  {
    "2023": "Chief et. al laughing at applicants when they thought they had cameras off, could see her pointing and laughing with other residents. Meet & Greet seemed gunner-y.",
    "nrmpProgramCode": "1827140C0"
  },
  {
    "2024": "Great residents and PDs x2 hidden gem",
    "nrmpProgramCode": "1600140C0"
  },
  {
    "2023": "Hospital got a D rating for patient safety in october. Just shut down General Surgery program and EM is on the chopping block... beware",
    "nrmpProgramCode": "3185140C0"
  },
  {
    "2023": "No IM grand rounds <-- I rotated there and this is not true, there's noon lecture each day",
    "nrmpProgramCode": "1601140C0"
  },
  {
    "2023": "really? 28 hr call in the year 2024?",
    "nrmpProgramCode": "1632140C0"
  },
  {
    "2023": "60k salary with meal stipend included in the salary... lowest salary in the area.",
    "nrmpProgramCode": "1636140C0"
  },
  {
    "2024": "?",
    "nrmpProgramCode": "2139140C0"
  },
  {
    "2023": "Resident facilities aren't particularly nice, Temple doesn't match resident/fellow 401k contributions. Workhorse program with unhappy residents. A resident said they are unhappy with how the program is run and that they don't have good opportunities.",
    "nrmpProgramCode": "1646140C0"
  },
  {
    "2023": "New PD this year. 4 unmatched seniors last year.",
    "nrmpProgramCode": "1628140C0"
  },
  {
    "2024": "Such a welcoming PD, but only 3 spots :(",
    "nrmpProgramCode": "2173140C0"
  },
  {
    "2024": "Most warm-hearted and easy-going PC ever met",
    "nrmpProgramCode": "1649140C0"
  },
  {
    "2023": "interview and PD intereaction went good but when I spoke with a couple residents on the side lines-they are short on faculty, program has no structure, and residents have no support from anyone including the GME or the faculty. One resident said that the attendings retaliate and no one really cares about teaching. Stipend is not great and multiple locations t travel to..",
    "nrmpProgramCode": "1028140C0"
  },
  {
    "2023": "1",
    "nrmpProgramCode": "1702140C0"
  },
  {
    "2023": "PD replies to no email (email with program related questions as well) - just forwards everything to PC. Personal opinion but I found one of their PCs as the most condascending person I've met this season!",
    "nrmpProgramCode": "2259140C0"
  },
  {
    "2024": "in 2023, the residents came to leadership to request a raise AND extra week of vacation time. they got BOTH!! << union? << no",
    "nrmpProgramCode": "1706140C0"
  },
  {
    "2022": "It wasn't even the PD, it was a fake account on LInkedIn << Suggestion: put that clarifying info/correction in the cell one to the left of this one :-) literally just a bystander and interpreted this as being the actual PD because no one contested it.",
    "nrmpProgramCode": "2244140C0"
  },
  {
    "2023": "This program is closing and not participating in match",
    "nrmpProgramCode": "2244140C0"
  },
  {
    "2023": "resident workroom looks like the elephant graveyard from Lion King but its getting renovated soon",
    "2024": "Residents have really good vibes",
    "nrmpProgramCode": "1707140C0"
  },
  {
    "2022": "Email sent as of 12-31",
    "2023": "Coordinator sent an email with no attachments requiring us in BOLD to sign the forms. When replying to email I got an automatic reply requiring us to reach out through rezRATE with no other way to reach program. Spent significant amount of time trying to find my rezRate login/trying to register for an account. Had to call rezRate myself to find out that applicants actually don't have rezRate accounts and this was false information. Therefore, there is no way to contact program at all. The mistake itself isn't a big deal but it's the lack of ability to contact the program and the lack of communication. I know the coordinator knew about this issue at least two weeks ago because the agent at rezRate told me that he spoke with the coordinator the day before and the coordinator is aware of the issue. Yet two weeks since and not a single email to inform the applicants of this issue. No follow up email with forms to sign either. Still no emails about interview day information/link/schedule either. I understand it is holiday season though but it is only a few days out from interview day.",
    "nrmpProgramCode": "1167140C1"
  },
  {
    "2024": "Lots of research if you want it, great variety of pathology at the Mexico border, residents have good vibes",
    "nrmpProgramCode": "1710140C0"
  },
  {
    "2023": "A word of caution. As per the ACGME site their accreditation says \"initial accreditation with warning\" also resident during interview asked me why the research study I worked on during med school was published in a journal with a low impact factor- like that was a red flag. Sounded like they were trying to come off as an attending. But otherwise faculty were so much more professional. << they're a new program, may be working out the kinks. Only program in which residents have spoken badly of it",
    "nrmpProgramCode": "1710140C2"
  },
  {
    "2023": "In person IV",
    "nrmpProgramCode": "2169140M0"
  },
  {
    "2023": "IV day w/minimal breaks + resident social later that day was tiring   +1, day before social was needlessly lengthy +1",
    "2024": "PD really cares about the residents and their well being. Great benefits. Resident have really good vibes.",
    "nrmpProgramCode": "1793140C0"
  },
  {
    "2024": "Program Director really cares about resident education and wellness and always improving; very good vibes all around.   PD really couples match friendly!  My interviewer knew my application super well. We talked mostly about things outside of medicine. Feels like you get a nice mix of graduated responsibility.",
    "nrmpProgramCode": "2923140C0"
  },
  {
    "2022": "<< wtf that's so weird esp when they say DEI is important.  -- Home student here: I think the PD genuinely does care about DEI but the overall institution certainly does not. I have to fight for basic things (and it's now worse with the political pressure from the governor). <<I'm part of the residency committee trying to increase DEI and the meetings basically revolve around getting rid of DEI efforts altogether so we are really trying to fight this as well",
    "2023": "Pimping on clinical content during interviews and overall stressful vibe per multiple Discord users. Did a rotation here and honored, and still didn't get an interview  Interviewer kept saying my name wrong despite politely correcting twice. Eventually interviewer gave up and said \"your nickname is X and we will go with that\" --> WTH, that is so strange and not inclusive!    Someone posted on reddit (now deleted) about how IM career advisors at the school asked students if they were ranking UTSW #1 to contact them so they could advocate to the residency program. Not 100% directly related to program but still kind of weird >> home student here but is this just some rumor? < home student here who did in fact receive this email <<resident here and can confirm that UTSW routinely tries to get students to market them behind the scenes. They also pay the residents to speak highly about the program, so people lie through their teeth sometimes",
    "nrmpProgramCode": "2835140C0"
  },
  {
    "2023": "Low pay and crappy benefits (although COL is relatively low in Richmond so maybe it works out)",
    "2024": "Great PD, seemed very kind and interested in all applicants. Sent a small care package with handwritten postcard post IV.",
    "nrmpProgramCode": "1743140C0"
  },
  {
    "2023": "https://www.reddit.com/r/IMGreddit/comments/1be9p63/beware_of_such_programs/",
    "nrmpProgramCode": "2216140C0"
  },
  {
    "2024": "I rotated there, it's a hidden gem",
    "nrmpProgramCode": "1837140C2"
  },
  {
    "2023": "Can anyone speak to the validity of this thread? https://www.reddit.com/r/Residency/comments/16ee9wj/the_parking_crisis_at_university_of_wisconsin/ <<yikes seems real << Only bad for this year due to construction. PD said that the 3 residents who didn't get parking were arranged by the program to get free parking in the patient ramp for a year (they go out of the way to get you what you need).",
    "2024": "Incredibly kind PD, residents, and interviewers. All seemed genuinely interested in candidates, and knew my application front to back in interviews. Plus amazing 4+2+2 schedule",
    "nrmpProgramCode": "1779140C0"
  }
]