[
  {
    "nrmpProgramCode": "1903140C0",
    "gift": "$35 grubhub"
  },
  {
    "nrmpProgramCode": "2265140C0",
    "positives": "faculty seems nice. residents seem happy. in the process of hiring more faculty. first class to graduate this year. have all IM subspecialties. POCUS",
    "negatives": "traditional schedule. very little vacation. 17 days including holidays compared to other programs.",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "2345140C0",
    "positives": "PD seems supportive. residents seem happy. $1000 moving reimbursement. free food and parking.+1 location.",
    "negatives": "new program has first intern class currently. started an FM program at the same time. 4+1 schedule but have not implemented yet. Needs a endocrinology preceptor.+1"
  },
  {
    "nrmpProgramCode": "2239140C0",
    "positives": "PD seems supportive. residents seem happy. $1000 moving reimbursement. free food and parking.+1 location.",
    "negatives": "Patient load is low.",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "2132140C0",
    "positives": "100% board pass, all specialties offered, all who pursue fellowship got it. PD is very and supportive of all th applicants. university affiated but community based. no fellows there so you will learn the specialites. the cirruculum is more focuded on your goals then set.",
    "negatives": "in dothan , AL. community hospial that covers 2 states, you will have to work hard for research."
  },
  {
    "nrmpProgramCode": "2271140C0",
    "negatives": "traditional. one twenty minute panel interview. traditional.",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "1007140C0",
    "positives": "Clinical training is top tier, abundant research opportunities, solid fellowship match, everything at one site, very inclusive, free parking. Cross-cover means not wasting unneccesary time in the hospital. Probably the nicest residents and faculty anywhere I've interacted with. Seems like the residents are very cohesive group.",
    "negatives": "Bit of a workhorse program. Only 3.5 weeks off per year, overall compensation is on the lower end; have to wear business casual on most ward rotations. 8 + 4 schedule. 8 months of wards intern year. The 3 weeks of vacation includes holiday time off so its really only 2 weeks of vacation a year. No epic :( .",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "drink koozie",
    "timeGiftReceived": "pre-interview"
  },
  {
    "nrmpProgramCode": "1009140C0",
    "positives": "very decent program with a lot of clinical exposure, affordable place everyone is very honest and polite, largest hospital in the region with affilations to UAB birmingham, one 45 min IV with faculty and one 45min IV with PD",
    "negatives": "Not many research oppurtunities, I personally felt like they are not intrested in my candidacy.",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "1852140C0",
    "positives": "Everyone SUPER nice. extremely comorbid patient population, large catchment area. main ambulatory site is in the parking lot of the main hospital.",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "2002140C0",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "2154140C0",
    "positives": "Admin and faculty are very nice and welcoming. They value wellness and diversity and, supportive culture of whatever career path you take. Very transparent about all information.",
    "negatives": "Only 3 in-house fellowships (but plan to expand more). Need to adjust to 2 hospital systems since they are part of an alliance/consortium",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "2346140C0",
    "positives": "Admin and faculty are very nice and welcoming. They value wellness and diversity and, supportive culture of whatever career path you take. Very transparent about all information.  The resident Q&A had a PPT that answers most of your questions which I appreciated  PD seems really dedicated to building the program and setting the residents up for success.  Seemed like a lot of elective opportunities and the schedule seems very doable. Day starts at 7 on wards with morning report (pre-round after) and you can leave before 4 with your pager if everything is done  No jeopardy system (PD said attendings can handle their pts without residents)  Golden weekends on electives",
    "negatives": "Not X+Y  New program so current interns will be your seniors  Can't use educational stipend for Step 3",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1929140C0",
    "positives": "Healthy culture that actually seem genuine. Promotes wellness and means it. Low key program with a 94% board pass rate. Some in house fellowships. Seltzer water and protein shakes. Scottsdale, Phoenix.",
    "negatives": "The patient population in North Scottsdale will be very challenging. Not because they are sick and without access, but because they're bougie, have the ability to choose where to travel for their healthcare and will question every step of the process with \"high\" expectations. As a resident, you are expected to be on your A game daily. Sounds like there will be a lot of hand holding, clinic appointments range 30-60 min. Also, plus or minus depending on you, but a roster of 6 per year, you should expect to be frequently socializing and if you're a \"lone wolf\" you won't like it.",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "3200140C0",
    "positives": "Friendly interviewers who are clearly familiar with your app, strong culture of mentorship/teaching, abundance of institutional support for research and scholarly activities, much better location than Rochester (main campus). Also have smaller resident classes (15 each class) than most other programs and have tracks to become junior faculty at Mayo as a PGY-3. Leadership is super responsive to resident feedback and always looking to improve the program.    Residents can do away rotations at other Mayo campuses, seemingly with many expenses paid. A lot of new emphasis on health equity and DEI (new track, new rotation sites, etc)",
    "negatives": "Had one interviewer who asked a pimp question. Nothing too difficult, but getting pimped at all left a sour taste in my mouth. Otherwise, no big glaring negatives. Pretty weak fellowship match lists for a program that allows you to do so much research, found that to be really confusing. << I think that's also the case for a couple of midwestern big names (eg. KUMC, UN, UMKC, SLU). Head-scratching huh? < their fellowship match seems to reflect where residents are coming from, so maybe residents are ranking programs close to home? < Matched a ton to Mayo AZ and MN this year — and?",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "$30 grubhub, cactus",
    "timeGiftReceived": "only used during evenign of interview",
    "comments": "Any info on vacation schedule / holidays? 4 weeks, can be taken as half days or up to 1-2 weeks depending on length of rotation, + healthcare maintenance half days"
  },
  {
    "nrmpProgramCode": "2335140C2",
    "positives": "PD was friendly, and seemed interested in your application",
    "negatives": "Still a new program",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "1011140C0",
    "positives": "Hospitals provide diversity of training; Banner is more complex pathology while VA is more bread and butter medicine  4+4 (with weekends off on the +4, possible to get 5 golden weekends in a row)  Golden weekends on electives but some have longer hours (like cards)  4 weeks vacation + 1 extra week at the end of intern year  Residents said the atmosphere is relaxed, collaborative",
    "negatives": "Wanted to love this place but interview was only* behavioral questions which made it super awkward +5<< probably one of the single most awkward interviews i had  If you're at the VA you have to drive to the other hospital for academic half day  Because of the 4+4 system it's possble (but reportedly rare) to get a 3 month stretch of wards",
    "howInterviewDayAffectsRank": "MUCH_LOWER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1015140C0",
    "positives": "Weather is amazing <53 consecutive days of 100+ degree weather does not sound amazing to me <<its dry heat you wont even notice it",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "2269140C0",
    "gift": "tshirt/cup/arkansas rice and beans/local coffee beans",
    "timeGiftReceived": "pre-interview"
  },
  {
    "nrmpProgramCode": "2277140C0",
    "positives": "Very friendly interviewers. Interviewers didn't try to throw you off your feet, just a genuine conversation. PD was very chill. <I love feet",
    "negatives": "Lots of emphasis on primary care. Residents in Q&A stated that getting fellowship can be challenging.",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "2250140C0",
    "positives": "Love the PD"
  },
  {
    "nrmpProgramCode": "2214140C0",
    "positives": "Great resident camraderie ; program has a good emphasis on resident wellness; good emphasis on research; PD very supportive",
    "negatives": "schedule seems messed up ; smaller city/not much to do ; very low PGY1 salaries (but I think the cost of living is also low)",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "$25 DoorDash for dinner social",
    "timeGiftReceived": "Post-interview"
  },
  {
    "nrmpProgramCode": "1871140C0",
    "positives": "Faculty was amazing, very focused on teaching their residents well. 4 20-minute interviews. Good procedural training, unopposed program. I also had a good experience, all interviews were conversational and was actually relaxed.",
    "negatives": "New program",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1040140C0",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1041140C0",
    "positives": "Residents seemed really tight-knit and were joking around/getting along really well. The faculty seemed really awesome and a lot of them were Highland grads that stuck around. Big emphasis on underserved and DEI",
    "negatives": "County so limited resources (could be a pro or con), living in Oakland/Bay Area is expensive",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1047140C0",
    "positives": "Idk what to take at face value with this program, seems like how they present themselves during the IV vs. reality is quite different. They were eager to address all the \"reddit misinformation\" regarding rumors of it being a malignant program.",
    "negatives": "the PD gave himself a 5/5 star google review, and gave major cluster B vibes during IV",
    "comments": "look up threads on reddit"
  },
  {
    "nrmpProgramCode": "1061140C0",
    "positives": "PD seems very nice, PD, APDs, and chiefs seemed like they genuinely enjoyed interview day. Good diversity represented among faculty and residents. Seems to have good work-life balance",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "1030140C0",
    "positives": "Culture sems nice; PD/APD were super chill, good location, they actually encouraged cameras off for most of it which I appreciated.    Recently added a researrch track in the past year. Residents seem really happy and mentioned they feel they get enough time off with their 4+1 schedule re. golden weekends.",
    "negatives": "No fertility benefits per residents << APD and residents mentioned their committee is fighting to add this though.    Felt as if residents weren't super supportive of one another during the learning curve. Also got the vibes that attendings and consult services don't want to put much time into teaching or supporting patients. +1    Got the impression there was less resident autonomy compared to other programs  Impression of the program was great, but the interview day was way too long considering there's only one 30-min interview session and a 10-min session with the PD/APD.    Resident said that one of the continuity clinic sites (the medical group) is basically just shadowing?<<CSMG continuity clinic might be getting phased out in favor of more residents going to the other continuity clinic sites",
    "howInterviewDayAffectsRank": "LOWER",
    "comments": "Can anyone share details on holiday schedule / vacation < website says 28 days per year, required to take at least 20 (can carry over whatever is unused), 5 days sick leave, family leave by request"
  },
  {
    "nrmpProgramCode": "2114140C0",
    "positives": "Good experience overall. Most of the interviewers were very polite and PD was friendly. It is an academic program.",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "2018140C0",
    "positives": "residents seem tight knit, Ventura is gorgeous",
    "negatives": "thought the interview was pretty intense for a small community program, three panel interviews back to back to back with them firing abstract questions at you was not it lol",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "1485140C0",
    "positives": "Residents seemed very close to each other.",
    "negatives": "One interviewer kept deriding during my answers. He even criticized my 'best accomplishment'.",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1877140C0",
    "positives": "really big hospital, residents and PD seem great, lots of perk and research; really nice GME building and resident workspace, private resident gym",
    "negatives": "HCA is taking over and UCR is leaving - so all those are huge downsides that program wasn't too open about; Really? That seems weird, considering recent news that HCA made some donations to UCR. <<<< IV with chief resident seemed hostile for no reason, doesnt even say hello how are you etc, just goes right to a long list of rapid fire questions.",
    "howInterviewDayAffectsRank": "MUCH_LOWER",
    "gift": "Nothing",
    "comments": "Can someone say more about the HCA/UCR thing said under negatives? I thought it was already an HCA hospital. It is an HCA but affiliated with UCR."
  },
  {
    "nrmpProgramCode": "1067140C0",
    "positives": "Very nice program leadership and chief residents. Strong clinical training with lots of autonomy but also support from faculty who are heavily invested in teaching. Excellent culture/camraderie among the residents. Very supportive of those interested in fellowship, will go out of their way to connect residents to mentors and send them to conferences.    Did they say on the +4 block you have golden weekends?",
    "negatives": "County hospital, seems that resources/faculty support may be limited; UCLA connection unclear >> much more separated compared to Olive View; residents don't rotate at westwood hospitals (RR and VA) like OV residents do, UCLA medical students rotate there, some Cedars-Sinai IM residents rotate there    No formal tracks/pathways (med ed, global health, etc). Also seems like research might be less readily available here than at other programs",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "nothing",
    "comments": "Apparently Harbor is on probation due to recent allegations of sexual harrassment from an ortho surgeon. LA times article < looks like the probation is unrelated to the department of medicine (ortho issues). Wouldn't worry too much, Harbor is a well-established program and quite literally essential to the county of Los Angeles, am sure they'll address whatever ACGME concerns and be back to normal soon << Is this probation for the entire hospital though? So if for whatever reason they don't meet ACGME requirements, the entire hospital will shut down? << that is my undestanding. They have 2 years to get their act together <I mean, if any other program doesn't meet ACGME requirements, they will also get shut down. Harbor will be fine. < its also not just about accredidation, but also work environment < update: director of GME stepped down"
  },
  {
    "nrmpProgramCode": "1044140C0",
    "positives": "Small, tight-knit group of residents and faculty. Attendings seem to care a lot about the residents (i.e. all the residents have their personal cell numbers and can text them even when they're off).   Community hospital setting and apparently the staff are all nice. PD is new but did her residency there  Seems like a lot of autonomy but within reason, lots of opportunities for procedures but not necessarily required  Personalized call room",
    "negatives": "Not X+Y. Was told by both faculty interviewers that the ambulatory experience is lacking, emphasized that this is more of an inpatient-focused program even on consults/electives  Didn't seem like you get weekends off on all electives (i.e. cards/GI are intense), also need to do late admitting shift about once a week on electives  q8 overnight call on wards for interns, seniors have 24 hr calls. Need to stay until after rounds?",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "$5 starbucks",
    "timeGiftReceived": "Night before"
  },
  {
    "nrmpProgramCode": "2037140C0",
    "positives": "Happy residents, work life balance, PD who cares about resident wellbeing",
    "negatives": "3-4 facilities to rotate through, a bit of a drive depending on where you live",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "2055140C0",
    "positives": "PD loves to feed the residents. Residents genuinely enjoy hanging out with each other outside of hospital.  Opportunities for community engagement and serving the underserved communities. Housing stipend is 10k/year, more than other kaiser programs.",
    "negatives": "Research opportunities subpar.   No formal POCUS curriculum.  Not X+Y    Got the vibe it wouldn't be the best for an introvert  that wants to just go to work and go home  (seems like a lot of social stuff)",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "1042140C0",
    "positives": "Big emphasis on anti-racism in mission statement, seem very invested in community and history of Oakland, PD has huge emphasis on combining the best of both worlds with education of an academic center (being the flagship Kaiser location and referral center) with many community-based practice opportunities and focus on healthy equity in the city",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "1959140C0",
    "positives": "work life balance \"I never got close to the working hour limit\" from a resident, separate admitting and rounding teams, residents and attendings across services all know each other and super nice given size of program, will be transitioning to 4+4 for PGY-2/3 years as well as night float system for ICU",
    "negatives": "Residents made some comments during social that makes it seem that they are not well supported by attendings +2 << Similarly got vibes that residents weren't happy and seemed more negative than other places I've interviewed at that always talks about community/support/family; in addition, some residents said separating admitting and rounding is bad for learning, the morning report that i attended felt weirdly egotistical and conflicting at times << +1 (morning report made me felt that the training there is subpar when a PGY2 couldn't read an EKG)",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "2135140C0",
    "positives": "the residents seemed really happy and like they were friends and really sold the program; interviwers were very nice and approachable! << nice PD and APDs, CHOICE track with a LOT of outpatient elective time",
    "negatives": "Personally didn't like the interview as much. It wasn't conversational and a lot more about behavioral questions without really getting to know my values. Left a sour taste with the interview < out of the two interviews one of them definitely felt like this for me too, however, the other interview was much more relaxed and conversational",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "2950140C0",
    "positives": "Loved the program. If serving the underserved community is your passion, this is the right program for you. From the PD to the chief residents, everyone was super nice and talked in such a calming and positive voice. My interviews sold it for me because I found myself smiling and laughing the entire time. Great benefits and salaries, opportunities to rotate at UCLA. Everyone seemed happy and supportive of one another. +3",
    "negatives": "No formal medical spanish training despite having a predominant hispanic patient population. Potentially the 28 hour calls even though residents said they have voted consistently over years to keep the 28 hour calls? Depending on where you live (the valley, sylmar v. closer to westwood), some commutes to various site can be long. Smaller hospital compared to the other LA programs, hopsital does not have all the services so they have to transfer patients out semi-frequently.",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "1063140C0",
    "positives": "Large county hospital, ICU training. Access to university library. Outdoors.",
    "negatives": "COL:salary. To live on your own min 1/2 income after tax",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1340140C0",
    "positives": "Residents seem cool and friendly with each other, free lunch every day, free clinic, great didactics, great location",
    "negatives": "Have heard PD is not well liked by residents. She seemed fine enough interview day. Heard she has doxed previous residents from getting fellowship poistions. They also do not have any current PGY3s even applying for chief which I find weird. (friend of a friend is a current resident) <<< can you elaborate on what \"doxed residents from fellowships\" mean? <<So, in conclusion you this isn't from the actual IV. Move to m4/resident impression <<< Why are you being so rude?< actually one already announced they will be chief next year, everyone else just wants to get a job and make attending money",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1048140C0",
    "positives": "Interviewers knew my app really well and were incredibly kind, probably the nicest I've met so far throughout the interview trail. Seems like they get outstanding clinical training. Safety net hospital, level I trauma with tertiary ICU, near the US border and has busiest ED in the county, so big international population and very sick/underserved patients. No in house fellows, which means residents get all procedures in the ICU (all the taps, central lines, etc that you want) and interventional cards (can be first assist on PFO closures, TAVRs, PCIs, etc). Opportunities to do away rotations for fellowship, seems like many pick up aways at Scripps Green. All research costs (travel costs, conference, publications, etc) completely reimbursed by Scripps, if I understood correctly. Solid benefits ($5k housing stipend, MKSAP or UWorld paid for by program, food at noon conference and meal card, free parking, etc). POCUS curriculum recognized by American College of Cardiology as one of the best in country. National record for consecutive years of 100% ABIM pass rate (16 I think; only 1 failure in the last 23 years). Residents seem super friendly and get along well with each other. Hard to beat living in San Diego! Many of their grads get hired on into the Scripps system, so chances to stay in SD if you want to!",
    "negatives": "Fellowship match is really the only major negative. Residents were (thankfully) up front about the fact that if you want a competitive fellowship (cards, GI, pulm/cc), you really have to work hard for it from day 1 to make connections and do research. While there is a ton of funding for research, it seems like there isn't a lot of dedicated mentorship and that you have to reach out on your own.",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "2138140C0",
    "positives": "chill program, the leadership team really cares about their residents. The residents seem happy, not too gunnery. <<< +1, absolutely fantastic interview experience. Everyone I spoke to was lovely. New PD making lots of nice changes like hopefully admitting DOs this year and super receptive to feedback",
    "negatives": "limited fellowship opportunity+1  interviewer was not fully engaged in the conversation. When I told the interviewer that residents say that program is open to feedback, what was the best change you made recently? They promptly responded that no we do not consider all their feedback, just some.",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "2161140C0",
    "positives": "Newer program, but they do listen to their residents. They are opening new in-house fellowship such as critical care and cardiology.",
    "negatives": "Really did not enjoy the interview as none of the physicians nor the PD seemed interested in getting to know the applicant. Every interview consisted solely of \"what questions do you have for me?\"   PD was also busy on her phone chatting with a nurse during the interview and even asked me to repeat my response. Was clearly not paying attention to what I had to say. ^^Agree with the above, interviewers seemed busy and PD was short with responses to questions.",
    "howInterviewDayAffectsRank": "LOWER",
    "comments": "I agree with the other poster, seemed like the PD wanted to get my interview over with so she could do other stuff, some of the other faculty would reference activities from my application that were probably from another students' app, so kind of awkward. Seemed like they weren't really listening/engaged."
  },
  {
    "nrmpProgramCode": "1025140C0",
    "positives": "interview day was organized",
    "negatives": "on ACGME probation, residents seemed hesitant to talk about program cultures/workload, we managed to get them to say that resident supervision was increased as a direct result of acgme violations",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1057140C0",
    "positives": "Super friendly PD, APD, faculty, culture seems great, faculty are are full-time UCSF. Students who rotated there seemed that they liked it.",
    "negatives": "small hospital",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1820140C0",
    "positives": "x+y starting 2024, 4+2 intern year and 4+4 after that, lots of benefits you get to live in the bay area, unionized. PD is awesome. New Union contract with the best benefits in the country.",
    "negatives": "Living in Palo Alto +3. Admin punishing residents for having a union: taking away benefits. did they do this tho? I didnt hear them do this at all  why is the IV day so long :,) >- re \"taking away benefits\"- definitely fake news, union is on the verge of signing a 3-year contract, with significantly increased benefits from prior.   didn't seem to have strong or even average clinical training, they seem to emphasize more the opportunities for involvement/collaboration with other fields like tech",
    "howInterviewDayAffectsRank": "SLIGHTLY_LOWER",
    "gift": "$40 uber eats giftcard",
    "timeGiftReceived": "sent on day of social event"
  },
  {
    "nrmpProgramCode": "1135140C0",
    "positives": "Newer program but residents are happy here.",
    "negatives": "Limited fellowship opportunity."
  },
  {
    "nrmpProgramCode": "1046140C0",
    "positives": "extremely friendly PD, faculty. residents seem happy because of very nice schedule (4+1, and then 4+4! for pgy2+3 years, rural medicine options",
    "negatives": "Sacramento",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "1043140C0",
    "positives": "Super friendly PD and other leadership was incredibly nice. Residents seemed super nice and friendly and vibed together well. <<<+1 resident culture seemed really good and they really genuinely hung out with each other often",
    "negatives": "Clinical sites seem a bit far from each other, especially with OC traffic; also research opportunities seem limited +1; along with limited mentorship. My interviewer wasn't even rally part of the residency program and make it clear they didnt even look at my app because they kept asking my name so they could look it up. Residents kind of seemed like gamers << lol got the same vibes << do you mean gunners? and what did you see/hear that made you feel that way <<no, i mean gamers. As in people who play video games, could definitely be a positive if that's what you're looking for in a residency program. I could only tell beause game recognizes game. I myself am unfortunately a gamer",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1956140C0",
    "positives": "Like, for realz, truly extraordinary benefits (90k intern salary, 3k food allowance on top of free food at noon conference, relocation stipend, fertility benefits, \"fatigue\" Uber). Residents seemed, like, sooo happy and the environment seems, like, totally supportive. Nice mix of, you know, prestige, research opportunities, fellowship match, diversity, supportive non-heirarchical culture. +1 <<< residents, like, suffer from stockholm syndrome if $90,000 in Los Angeles is seen as, like, extraordinary - first year law associates earn $250,000 < this a dumb comment when you consider the entire package for benefits - CoL is high and you, like, ain't gonna be living in luxury, but UCLA provides a lot for residents.",
    "negatives": "Driving in LA +5 especially in all the sites that can be 45 min apart << omg, expensive parking at Reagan >> faculty known for being kinda hard on residents and 4+1 not leaving a ton of time to connect with patients, high COL << Yasss, 4+1 is not, like, great compared to 4+2 or 4+4. Residents mentioned this as a downside. / Having to, like, casually call your workplace \"Reagan\" is cringe (delete as many times as you want but it is. For me, it is a relevant decision factor.)<< snowflake lmao << Did you not look this up before applying lmao? What a silly reason to be a negative. Still, 28-hour call at Olive View, and inbox management during rotations is not covered.",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "Nothing",
    "timeGiftReceived": "Post-interview",
    "comments": "Anyone heard anything about their rep of breaking duty hours frequently—whether thats true or not? Trying to gauge work life balance here << Just finished an away sub-I on general wards, most hours my interns worked was <65 on our heaviest week with two BAD long call days. n=1, but not a single intern complained about the hours while I was there, all of them seemed really happy with the QoL and work/life balance"
  },
  {
    "nrmpProgramCode": "1049140C0",
    "positives": "Extremely energetic PD, happy residents, interdisciplinary research, really diverse training sites, San Diego, unionized wiith housing stipend, meal money, fertility benefits +2",
    "negatives": "Mainly home match << not true at all. check residency explorer-maybe referring to fellowship match // felt like the residents were more excited about the city of San Diego than the actual program when it came to positives >> Most defiinitely, most of the residents said they chose the program because of \"\"vibes\"\" or location, rather than having concrete positives from the program <-- bro if I was at Harvard in San Diego, I'd also be like I love San Diego more than saying I love Harvard    I interviewed here early in the season and I liked the resident vibes but now I feel like they're overworked compared to other programs I interviewed at. Vibes seemed to be nice among the residents because they suffer together lol did seem inpatient heavy +1    Traditional schedule (could be good or bad) and doesn't seem to be switching to X+Y any time soon",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "Nothing",
    "comments": "Does anyone know if they are switching to X+y?? < Not that I know of     Anyone know how worked the residents are?/if they are overworked and what the patient load looks like?"
  },
  {
    "nrmpProgramCode": "1062140C0",
    "positives": "Strong clinical training, for a \"top\" program really is focused on training internists vs. peers who are really focused on sub-specialty training. Rotate at VA, SFGH, Moffitt -> wide range of clinical exposure. One of the most inclusive programs, strong focus on justice. Great resident benefits (PGY1 salary of ~87k, fertility benefits, relocation stipend). Residents treated as peers, non-heirarchical structure and on a first name basis with attendings. Obviously the name will carry you far and they have a strong fellowship match list.",
    "negatives": "Transportation around the city to rotation sites (VA, Moffitt, SFGH), parking expensive and public transport sucks. though they do have a shuttle system. Used to have a lot of duty hour violations and be known as a workhorse program, though a lot has channged with the structure of scheduling over the last ~3-5 years. Procedural training is weak. Basically impossible to settle down long term in SF unless you have family connections there or a really well-off partner << PD told me they are introducing a new procedural track (?)/option in pgy2/3 for people who are interested in procedure-heavy subspecialties<<that is correct!",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1022140C0",
    "positives": "such a cool vibe between the residents all seemed super close, faculty was AMAZING, good research and in house fellowship prospects, good perks (food in hospital, stipends), fresno used to be a bad place to live but its gotten a lot better recently, lots of diverse pathologies because its the magnet for the region",
    "negatives": "50% non english speakers <<if you think thats a negative you wont fit in in california",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1522140C1",
    "comments": "Does anyone know anything about this program? +2"
  },
  {
    "nrmpProgramCode": "1033140C0",
    "positives": "centered at LA county so huge underserved pt volume, super cool PD, Weekends off on consults, intern cap at 8, NP on team for care coordination.",
    "negatives": "PD was a little on the evasive side with answering questions about changes/feedback but the residents made up for this; Class size is on the bigger size, which can be a negative for some as you may not get the close-knit feeling of other programs (a resident also mentioned difficulty holding co-residents accountable due to this). Still a workhorse program, emphasis on discharging patients over teaching and completing workup/treatment. Will cap at 10 patients/intern as teams fill. Non-call days end past 6pm. LAC & Keck rumored to be negociating split in few years, changes already made among attendings between the two hospitals to reflect this. Unclear how contract negotiations between LA General and Keck will affect residents. < source? havent heard anyone talk about this and residents specifically said USC faculty at both county and keck < I heard this from a current USC resident and a USC med student. Program confirmed negotiations are ongoing durning interview day    I felt like the residents were more boring than any other program oops    Least conversational interview I've had, and no one seemed enthusiastic about the program at all>counterpoint: most conversational interview I had    So from what I understand everybody signs out at 5:30 every day on wards? No chance of leaving earlier? > +1 also wondering what the answer is to this???? >> no chance of leaving earlier unless your senior is an angel who signs out patients for you and tells you to go home instead",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing",
    "comments": "is there a social?? no social!"
  },
  {
    "nrmpProgramCode": "1997140C0",
    "negatives": "HCA, interns regularly at cap/10 pts, APD slammed academic programs; the whole interview was me asking questions yet I didn't feel like I learned much about the program or they learned anything about me"
  },
  {
    "nrmpProgramCode": "1074140C0",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1076140C0",
    "positives": "Residents seem happy and supportive of one another. Lots of ways to personalize your clinical experience with the 4+4 and pathways they offer. POCUS curriculum in place. No 24 hour calls. If leadership and academia is your thing, it seems like this program is a good fit for you.",
    "negatives": "Though there are opportunities to care for underserved communities at the denver health medical center and the patient population around the area can be diverse, it seems like it is not very integrated within the curriculum. However, I think they are changing this. <-- home student here, Denver Health is actually balanced fairly well with opportunities at the main U. You have some autonomy in deciding how much time you want at DH vs U as well (some folks have all their rotations at DH). Depends on what you're looking for! <- Agreed on it being well integrated. Former resident here, had my continuity clinic at DH and did a ton of rotations there. Lots of opportunities to care for underserved patients",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1079140C0",
    "positives": "PD and hospital admin very friendly, fellowship match suprisingly good, has pulm/cc, gi, cards in house, part of yale health system which makes working with actual yale attendings/getting on projects easier, rotations in new haven, chiefs friendly, program seems to listen to resident requests",
    "negatives": "chiefs mentioned \"only going over duty hours occasioanlly\" so take that as you will hte context wasnt really there to tell if it was going outside of 80 hours one week but meeting the average or not, several residents mentioned that the area is not the best although some walk/bike/take public transit to work, 24 hr call occasionally",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing",
    "comments": "Current resident here. You rarely go above 80 hours in 1st year...maybe 1-2 weeks only. Average around 50-60 hours per week. Lots of elective time in 2nd and 3rd year. Great fellowship match rates that too in quality university programs."
  },
  {
    "nrmpProgramCode": "1081140C0",
    "positives": "PD was nice - I think he will be retiring but the incoming PD also seems to be really nice an dedicated. Has in-house cardio fellowship. High salary",
    "negatives": "Lots of IMGs; Anyone get weird vibes from their morning report? I feel bad for their residents getting grilled af >> during my iv day morning report was just fine, no one was grilled, maybe something personal to resident…",
    "howInterviewDayAffectsRank": "HIGHER",
    "comments": "Attending was harsh to the PGY 2 on the morning report , gave malignant vibes"
  },
  {
    "nrmpProgramCode": "1082140C0",
    "positives": "Small program (7 residents/class). PD was very nice and reads app. Housing available within walking distance of hospital (rent deducted from paycheck). Only internal medicine residency program in the hospital. Senior resident mentioned they work very few weekends out of the year. Interns have guaranteed 2 golden weekends per month .",
    "negatives": "Interview \"day\" doesn't really come with any formal presentation. It's just two 20 minute interviews. Most of the information you get from the program will be from questions you ask the interviewers and the residents during the meet and great day. Not a lot of info from the website, or from the meet greet. Got a negative vibe from their \"Chief\" resident. +1 Terribly long calls. The hospital appears to have a traditional hierarchical work culture with interns getting pretty much shafted. << Definitely didn't think the hours were anything out of the ordinary. It's a q3 call until 9PM. On non-call days, you sign out at 3PM. Seemed like all the residents were pretty happy and pretty much every resident mentioned how much free time they have lol. I would admit though that having to cover on clinic weeks is kinda a bummer, but I mean it seemed like a pretty good program in terms of wellness +1 << Their day ends at 3 and call ends at 9 pm, meaning 6 hours of call (longer than average) and they don't have an admission team on call, meaning if you are on call you'd be covering floors and also do admissions, imho sounds pretty brutal.",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1093140C0",
    "positives": "Really nice PD, PC, APDs, and faculty interviewers! The residents seem to genuinely like each other and hang out a lot outside of the hospital. PC was very nice and responds to follow-up questions via email after the interview.",
    "negatives": "High COL, only in-house fellowships are PCCM and GI.",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1080140C0",
    "positives": "PD is nice and is obviously very passionate about the program and the residents but is a little intense, APDs were nice enough, PCs were nice, organized mentorship system, moving to be more academic since the program was absorbed by one of the local med schools, residents were very friendly, lots of wellness events (program is culturally diverse so they do days with foods from different cultures which sounded nice), PD said they are starting a few more residency programs so GME should continue to improve, diverse and underserved patient population",
    "negatives": "Day was disorganized (didn't know when we were interviewing), doesn't really seem that academic, one APD seemed disinterested, each interviewer repeated questions (had one of the same questions in each of my 3 interviews and one was repeated twice, and these weren't tell me about yourself or why IM but kinda specific behavoiral questions), not very coinversational, program pushes research but the products aren't that impressive, bridgeport kinda sketchy per residents, sim lab not on site? +1 exact same experience",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "comments": "Very IMG friendly for categoricals"
  },
  {
    "nrmpProgramCode": "1096140C0",
    "positives": "Nice PD, chief resident and very friendly environment. very impressed by the organization of the interivews. i wish i got to speak to the PD or APD though. but they knew all about me and i appreciated that they put the time into knowing stuff about the applicant <<< wonderful interview! they knew my application so well but i didnt get to speak to the APD or PD and was very disappointed about that.",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1094140C0",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1089140C0",
    "positives": "The residents seemed ridiculously chill at the social, PD seems warm/approachable and like the residents really like him, seem obsessed with resident feedback on the program (could potentially be to an annoying level lol), great salary/COL ratio, easy access to other northeast cities, easy access to rest of the Yale community for meeting other professionals, patient/clinical diversity and efforts to integrate with the New Haven community which seem semi-genuine, good food scene, good proportion of IMGs which probably makes for a fun/interesting group of people to work with +1 // PD seems to be a genuinely kind person who is also transparent. << No more 28hr call +1",
    "negatives": "All the known limitations of New Haven, not the most impressive looking hospital in terms of facilities  When asked what they would change about the program, residents agreed that it can be difficult/require more initiative to get experience with procedures",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1089140M0",
    "positives": "access to pathways/tracks at yale and global health programs",
    "negatives": "- only a few residents were available on zoom for social/ during the day +1 --> one social night they had more residents than applicants (lol), so think they've improved!  - residents looked very tired on social night, vibes were kind off  -vibes were off, seemed over worked, not a lot of ancillary support at clinics, may be a plus or minus to some but they really emphasized going super above and beyond and acting like mini social workers, also want you to attend community meetings on weekends (sometimes)     seems like the inpatient experience would be kinda mid (wards on one 24 bed unit at the less acute hopsital, unclear about opprotunities to go to thr york st campus)",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "2260140C0",
    "positives": "PD and faculty were very nice, residents seemed happy, PC seemed very on top of things. Rapidly expanding fellowship options. Gorgeous new hospital and outpatient clinics",
    "negatives": "Pretty new program (first class graduates in 2024); Dover is a small town and kind of in the middle of nowhere",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "nothing ($20 doordash for social)",
    "comments": "Dover is a charming town"
  },
  {
    "nrmpProgramCode": "1099140C0",
    "positives": "Residents were clearly happy, excellent fellowship match for most specialties, pay and benefits are superb",
    "negatives": "Apparently not a good place if you want to do GI, also...Delaware",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "1802140C0",
    "positives": "so many perks- great kush schedule and lots of opportunities to learn about lifestyle medicine, health policy etc. 4+1 schedule, housestaff among the most diverse I would say, 100% tuition reimbursement for additional degrees at GW (discounts for family members too). PD seems very nice. // Was very impressed with the PD. Getting to rotate at the NIH even if not interested in ID/Allergy/Rheum is really awesome because that's where advancements in medicine happen",
    "negatives": "Very high COL (what is COL?)<<cost of living, and that's very true, Foggy Bottom is DC's most expensive neighborhood lol << no it's not Georgetown is def more expensive, now for profit owned hospital. For profit hospital system seems counterintuitive to the programs social justice mission. Will have to use 3 different EMRs during residency. Seems light on didactics. Small hospital, mixed ICU (taking care of SICU patients too). No formal Med Ed track, but they are working on forming one. <<< This is America, no one cares about social justice <+10 it's all a big CV padding scam... The program seems very interested in social justice. If you are not, that's fine, just don't go there... Nothing really stood out to me about the program. PD was nice but there's not anything about this program that makes me want to rank it highly >>>>>> No windows in the workrooms>>> interview was just behavioral questions, didn't feel like they were really interested in my application really",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "2193140C0",
    "positives": "residents were open to answering any questions during meet and greet/PD addressed the challenges they've been facing/good fellowship match rate (100%) and board pass rate (89%)/residents kept mentioning how much of a 'chill' program it is",
    "negatives": "traditional schedule (though may move onto X+Y in near future)/different EMRs for VA and Howard/no out patient in Howard (clinics are in VA)/very low salaries for DC; just one 20 min interview (could fall into positives/negatives)/no website or source of information",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "1801140C0",
    "positives": "4+2+2  Holiday schedule + 4 weeks vacation + additional week at end of intern year  Culture seemed great amongst faculty and residents, strong med ed tracks and research opportunities",
    "negatives": "PD and faculty hard to connect with, seems like they are not close with residents, very subspecialty focused, expensive housing >> wonder what your day was like because PD and faculty were very easy to connect with and showed they knew the residents and what each was interested in    Weird IV experience, neither faculty introduced themselves but they knew my app well.     Multiple EMRs (Cerner, Epic, CPRS)  No real cafeteria at main hospital even though a new wing was added. Sounds like they go across to the undergrad campus or grab & go stations for food. Super expensive cost of living + DC traffic (have to travel between multiple hospitals so there's not one good central location to live that's near all of them)",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "1800140C0",
    "positives": "Strong clincal program, great training in cards and PCCM, q6 wards call, hours seem good. Fellowship matches have been really strong despite primarliy being IMGS. PD seems fantastic, residents/chiefs seem chill. DC is an awesome city>>I agree the PD seems very polite and nice. 5 weeks of vacation",
    "negatives": "Not X+Y, DC COL seems to be higher than other places. Seems to be fellowship heavy",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "Nothing",
    "comments": "helicopter, helicopter"
  },
  {
    "nrmpProgramCode": "1102140C2",
    "positives": "Large 625 bed tertiary hospital with 3 ICU/CCUs. Research institute and cardiac research center on site. PD seems nice and supportive. Conversational interview. New cardio, pulm/CC (+ ?hem/onc) fellowship starting 2026",
    "negatives": "new program (2023)    No opportunites to interact with the residents",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "Giftbox including water bottle, journal, etc (shipped)",
    "timeGiftReceived": "Post interview"
  },
  {
    "nrmpProgramCode": "1102140C0",
    "gift": "$20 grubhub",
    "timeGiftReceived": "day before iv"
  },
  {
    "nrmpProgramCode": "1102140C1",
    "positives": "PD was very passionate and was a \"pioneering hospitalist\" and eager to meet applicants. City is located within reach of Tampa Orlando. All training is done at AdventHealth Sebring hospital. Not much else memorable. PD experience with establishing new programs. Mental well being seems important.",
    "negatives": "Unable to coordinate playing audio from videos within presentation, a simple thing that should be figured out beforehand but nonetheless not a big deal. Faculty interviewer stated not much to do in town besides hang out with other residents/faculty. Stated that people would definitely not find any romantic partners in the city and stated that he frequently spends off time away from Sebring.",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "1892140C0",
    "comments": "Help please! is the program malignant?"
  },
  {
    "nrmpProgramCode": "1586140C0",
    "positives": "Very heavily focused on resident well being. Faculty and residents are super nice. Has some good in house fellowship opportunities. Located near Miami and has a good schedule. Great beaches nearby",
    "negatives": "Boca Raton is an expensive place to live in and the program doesn't offer a competitive salary <<< onlyfans is an option if you need $$$ and your residency pays shit",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "2317140M0",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1826140C2",
    "positives": "Super supportive and kind environment. Although it is a new program the residents seem very heavy on research and fellowship pursuits. They have a lot of resident benefits (free food, all exams and materials paid for, free parking, funding for conferences, reloacation stipend). The residents all seem very close as well. Overall seems to be a positive environment while still very academic/passionate about teaching and research.",
    "negatives": "New program has not had a graduating class yet, no fellowships attached.",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1826140C1",
    "gift": "25$ uber eats",
    "timeGiftReceived": "post meet & greet"
  },
  {
    "nrmpProgramCode": "1826140C0",
    "positives": "4+1 schedule, PD is super sweet, and she is very clear they are a community program and are not very heavy on reasearch (which I really appreciate the honesty).I really liked the vibes, didnt feel malignant at all. Smaller program, so the faculty can focus more on each resident.",
    "negatives": "No fellowships in house (it can be positive or negative for you, depending on your goals). Lack of opportunities for abortion care",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "2232140C1",
    "positives": "Good patient demographics with a broad variety of pathology, there was a heavy emphasis on residents going to research conferences and a mandatory minimum 1 case report per year. Residents seemed happy and praised the wellness initiatives and camaraderie in the program. Brand new outpatient clinic.",
    "negatives": "BY FAR the most torturing interview day so far, program overview presentation followed by randomly rotating interviewers. Three 20 min interviews but you spend the other several hours in the main room waiting with other residents with no breaks continuously asking questions to wits end. By the end residents even stopped asking us for questions saying who are we kidding you guys def dont have anymore questions and felt bad for us.",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "Nothing",
    "comments": "https://en.wikipedia.org/wiki/HCA_Healthcare"
  },
  {
    "nrmpProgramCode": "1384140C0",
    "negatives": "They are losing their affiliation with UMiami starting this year. Mixed reaction to this by residents. Some are positive (increased stipend by HCA takeover) some are unsure. Nevertheless the new interns won't be associated with the Uni and everyone else will be phased out. ---> I thought it's for those graduate after 2027? ---> Current interns and interns starting 2024 will be HCA employees, but still graduate with University of Miami on diploma because the official pull out isn't until 2027."
  },
  {
    "nrmpProgramCode": "2232140C2",
    "positives": "Level 1 trauma center, decent cardio for a community program. Suburban program of Miami. They claim that their strength is the people of the hospital and culture there is friendly and close",
    "negatives": "No heme/onc elective present there (interested in heme/onc). PGY2 and above do procedures because (allegedly) high infection rate from IM residents, that they call up EM residents to do certain procedure like central lines. No residents present at the 10/10 interview, PD claimed they were doing a mandatory activity, but still a bit sus to not have at least one resident there that could attest to resident life/experience    PD admits, 70% residents go into hospital medicine, 20% go into fellowships, so definitely program for those who want to do hospital medicine/internists    PD made comment that i guess a few rotations where residents can wear scrubs, otherwise its professional clothing. EMR is ECW in outpatient clinic and something else inpatient (Meditec)    HCA program <<< SAYS IT ALL",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "Nothing",
    "comments": "https://en.wikipedia.org/wiki/HCA_Healthcare"
  },
  {
    "nrmpProgramCode": "2137140C0",
    "negatives": "This place pays $55,217, what a fucking joke.<< same with the HCA UCF ones its like 59k. beyond under the average << HCA is fucking stingy, the COL is sky high"
  },
  {
    "nrmpProgramCode": "1899140C0",
    "positives": "-PD, attendings, and residents are supportive and care a lot about the program. Discussed details of application during the interview. Everyone was easy to talk. -Resident Q&A was an hour of the IV process, All the inteviews rooms were nice and accomodating. IV was with PD and 2 APD, both graduates of the IM program.",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1772140C0",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "2195140C0",
    "positives": "everyone is nice, pd is funny has dry jokes, cardio fellowship in house, rural program so housing is cheap i do like iverness",
    "negatives": "HCA stigma",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "1981140C0",
    "negatives": "https://www.statnews.com/2023/12/14/hca-mission-health-lawsuit/"
  },
  {
    "nrmpProgramCode": "2235140C0",
    "negatives": "required in-person interview"
  },
  {
    "nrmpProgramCode": "2107140C0",
    "positives": "Everyone very personable. Unopposed. Lots of procedural opportunities. Good pass rates. Happy residents. You live in St. Pete. +1",
    "negatives": "High cost of living.",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "1662140C0",
    "positives": "Nice diversity.",
    "negatives": "PDs look like micro managing. No outside electives allowed. Residents are overworked. They have to stay in hospital for days if hurricane hit. The emr sucks.",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "2323140C0",
    "positives": "Residents and leadership were extremely friendly. Lots of resources, procedures, prep for fellowships, cardio/pulm critical care to start soon. Overall sounds like a great program. Location was also a huge plus. Half US Grads/Half US IMGs.",
    "negatives": "At first, I thought not having seniors was a con, but after hearing it from and residents and meeting the attendings, it sounds like working with the attendings is a big plus.",
    "howInterviewDayAffectsRank": "HIGHER",
    "comments": "Signed up for second look"
  },
  {
    "nrmpProgramCode": "1481140C0",
    "negatives": "$45,000 salary",
    "comments": "https://www.reddit.com/r/Residency/comments/yytp4d/whos_got_the_lowest_resident_salary/"
  },
  {
    "nrmpProgramCode": "2238140C0",
    "positives": "None",
    "negatives": "It felt like they are trying to just show ERAS that they are sending interviews, they knew who they are taking before in hand, my interview was the weirdest, literally 3 questions, when are you taking your step 3 (literally even before what's your name), then 2 medical questions, if you have a patient with ITP and platelets 9, what do you worry about?!!!! and the second question was, patient with 9 hemoglobin, what do you do? even when I asked about demographics of the patient, the attending said not specfic!! literally the worst interview i have ever had",
    "howInterviewDayAffectsRank": "MUCH_LOWER"
  },
  {
    "nrmpProgramCode": "2109140C0",
    "positives": "Friendly Faculty and Happy residents. Always trying to improve their program, and listen to residents' feedback. Know your CV well.",
    "negatives": "One attending was in his car driving during the IV, one attending got up and left his desk while I was answering his question, one resident asked me how I would do in residency and on boards given my history as a collegiate student athlete and how athletes are generally viewed as not the smartest.",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1032140C0",
    "positives": "Super friendly faculty and residents. Heavy emphasis on wellness and research/innovation.Tons of elective time. PGY3s can become junior faculty. Small class size.",
    "negatives": "There is not enough patient load to feel comfortable as an intern so when second year comes residents feel unprepared. Don't know much about Jacksonville < Jax is a great place to live with a very high quality of life and the Mayo campus is beautiful. Let me know if you have any questions and I'd be happy to answer! (grew up in the area with family still living in a small beach town close by) There is not enough patient load, second year residents feel completely unprepared to be in senior position. Not many procedures opportunities.",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "$30 GrubHub"
  },
  {
    "nrmpProgramCode": "1107140C0",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1587140C2",
    "positives": "PD is very much interested in teaching, research, presenting at conferences/doing a lot for the program ; residents seemed cordial with one another during social",
    "negatives": "Personal opinion: I felt that PD maybe not as approachable/conversative/open in taking feedback, did not really answer many of my questions directly, does not have as enthusiastic teaching faculty <<<OP of the teaching faculty line - this was told to me by the PD after I asked him some challenges/negatives about the program; HCA system; low on fellowships; social event had a medical quiz - don't know how common it is but tbh its the first time in my experience so far and it irked me out a lot since all attendees started overlapping each other to answer. <<+3 could clearly see everyone playing the one upmanship game!",
    "howInterviewDayAffectsRank": "MUCH_LOWER"
  },
  {
    "nrmpProgramCode": "1587140C0",
    "positives": "Heavy emphasis on medical education and teaching. PD was super passionate and recalled things from my application during interview with great detail. The program offers a lot of benefits for the residents too (meal stipend is pretty generous/free parking).<<< is this the lake monroe program? << Lake monroe is a different, brand new program. This one is Kissimmee.",
    "negatives": "New program so interns won't have senior residents << lake monroe is the new program. This is Kissimmee",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1587140C1",
    "negatives": "small city"
  },
  {
    "nrmpProgramCode": "1587140C3",
    "positives": "Is this hca west florida ?",
    "negatives": "Not interested in applicants.",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1824140P0",
    "positives": "Sick patient population, residents are happy here, super relaxed and conversational IV day            Traditional schedule offers: 3 interns per team during the first 3 months of residency, additional day of subspecialty clinic during years 2 and 3, chances to accomodate days off to family events and such (which they said was something residents wanted. Both faculty an chiefs are excited about the switch. Couldn't identify how residents felt about that during the social). Besides that: residents are very chill, interviews are very much about fit (they do a composite score - my interviewer told me they put a score on your interviews, mostly to evaluate fit), plenty of food available, they hang out together a lot and have perks with their Gator Pass. Their cards fellowship placement was the best for fellowship I guess.    For parents: day care next to the hospital at good prices.  People into Heme/Onc and ID: bone marrow transplant center",
    "negatives": "College town, very quiet during holidays. 3 vacation weeks total but one week has half day clinic and other responsibilities so more like a forced staycation    Can't really get behind them switching back to traditional when other programs of their caliber are X Y, negative for me +1.      This is a negative for me: switching back to traditional.     They are switching after resident feedback<--is it resident feedback? they didnt mention this. PCCM fellowship placement was okay. Paid parking (you can live within walking distance)",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "1101140C0",
    "gift": "$30 grubhub credit day of social",
    "timeGiftReceived": "pre-interview"
  },
  {
    "nrmpProgramCode": "1104140C0",
    "positives": "3 hospitals all within close proximity. It's MIAMI. Great lifestyle. Good schedule. // Great wellness, support of residents, career development opprotunities. Lots of actual diversity in residents + diversity in patients, pathology, clincial sites. Wellness rotation. PD and chair seem amazing and residents seem like they actually have fun outside the hospital, both with co-residents and without. The fuckingggg 305 life bruh",
    "negatives": "Seems like a non-ideal place for people who aren't fluent in Spanish (sounds like those residents hope they have a co-intern who can take all the Spanish speaking patients), but you can be placed at VA for clinic which is mostly English speaking. incredibly big program, which seems like it could be easy to get lost.",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Personalized thank you note, insulated lunch bag, sunglasses, scented hand sanitizer, pen, an unkown wooden tool branded with Jackson's slogan. +1     None+1",
    "timeGiftReceived": "post-interview"
  },
  {
    "nrmpProgramCode": "1821140C0",
    "gift": "none"
  },
  {
    "nrmpProgramCode": "1109140C0",
    "positives": "The flexibility of resident scheduling in regards to what areas/specialities you would like to have. The PD is very hands on according to residents with respect to guidance and mentoring for fellowships so its very nice to have that support. Tied to Moffitt Cancer Center so very strong Hem/Onc program that has good fellowship matches. Strong cardiology program as well. Residents were very open with their experiences and there is certainly a great emphasis on wellness at USF +1 was pleasantly surprised. Third year chiefs can be associated with one of 3 major hospitals (Tampa General, VA, Moffit Cancer center)",
    "negatives": "Very few negatives, if any, I noted during interview day. They said 3 different EMRs is a positive lol. — is this really a low or low mid tier program? Their match is always pretty strong",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "$20 GrubHub Delivery Credit - lol i only got $15 +1 - $$ correllated with how much they want you",
    "timeGiftReceived": "Pre-interview"
  },
  {
    "nrmpProgramCode": "2218140C0",
    "positives": "PD was very caring and friendly. +1 Second this. Top PD, please make her happy if you end with her."
  },
  {
    "nrmpProgramCode": "1744140C0",
    "positives": "Everyone seemed very personable. All the interviews were very conversational. Small program in a college town. They seem to care a lot about their residents and take feedback. 100% ABIM pass rate this last year. Everyone who applied fellowships got them. Unopposed program. They Use EPIC for EMR",
    "negatives": "Not as research heavy as some other programs."
  },
  {
    "nrmpProgramCode": "1867140C0",
    "positives": "Lots of opportunities to do procedures like blood draws",
    "negatives": "No in-house fellowships. Fellowship match is absymal. All attendings work for private equity TH and have less than 3 years of experience. Residents seemed overworked and unhappy. The majoirty of residents are SOAPs and don't want to be there, up until recently was a former HCA program",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "$20 GrubHub Delivery Credit.      Post IV gift package with card, yoyo, pop socket, light up message board, poncho",
    "timeGiftReceived": "week of resident social      3 days post-interview"
  },
  {
    "nrmpProgramCode": "1113140C0",
    "positives": "Program leadership is very clearly invested in resident well-being and receptive to feedback (e.g. 28hr call has been eliminated from nearly every service, program structure changed to X+Y, etc). Grady seems to be an exceptional training site where residents regularly have the opportunity to manage highly complex and unusual pts, especially from the ID perspective. Very strong ID and cards exposure thru the SIS and Hurst services respectively. Program has several distinctions to further explore interests like med ed, pocus, global health, etc which start in PGY2. Research mentorship and funding available to support resident presentations at conferences. Collegial culture. Many among leadership and residents invested in advocacy +1 << Interview definitely felt liike more of a vibe check and conversation than them grilling you. Residents have good chemistry. Free parking at all sites. Really good vibes at social hour as well. << +2 honestly !",
    "negatives": "Restored: lack of elective time. Sounds like consultants may run the show at Emory University Hospital but this isn't uncommon at academic medical centers and residents have more autonomy at Grady, which is where about 40% of training is spent (most time out of any site). << Residents weren't shy about saying it still was a bit of a workhorse program, free food roughly 2-3 days per week at noon conference. Barely any elective time. +1",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "none",
    "comments": "POCUS and Global Health distinction tracks require application, but opportunities for both even if you don't get it. Chiefs said that they were approached for the position; didn't sound like an application/elected position."
  },
  {
    "nrmpProgramCode": "2222140C0",
    "positives": "Super friendly people. Interviewed with residents + faculty, interviewers all seemed to genuinely want to get to know you.",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1971140C0",
    "positives": "Free parking, free food/drink in res lounge, resident/student workout space in hospital, PD seems great, supportive program, great access to procedures, Savannah is dope, residents happy",
    "negatives": "No in-house fellowships, need to have car",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1985140C0",
    "positives": "transitioning to epic in 2024",
    "negatives": "Major question mark is the new alliance with Wellstar. PD and other faculty openly said they don't know how it's going to affect residency. they were assured spots won't go down and that wellstar is committed to MCG GME but could sense some uncertainty. Also Dr. Oliver (PD) said the phrase \"we are in debt\" as an institution at least 3 times in her talk which i get it, not every program is on a super sound financial footing but if she says it that many times it makes you wonder about the stability/resources/benefits available to residents",
    "gift": "keychain, MCG koozie, cocktail making instructions, some light reading material",
    "timeGiftReceived": "a couple days before interview"
  },
  {
    "nrmpProgramCode": "2099140C0",
    "positives": "4 days of vacation for one winter holiday in addition to 3 weeks vacation. snack room available in both hospitals.  Residents are very friendly and seem happy.",
    "negatives": "Free parking at one facility and paid at the other. $7 meal card at the VA and cafeteria discount at grady. Free food 2-3 times a week. Compete for procedures. traffic. Interns work 24 hour shifts at the VA>.   Only 72% board pass rate (for me it says A LOT)",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "2166140C0",
    "negatives": "PD was just forced out at the begging of this year; interum PD was not at the interview until the last 10 min; Has had low board pass rates",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1796140C0",
    "positives": "3+1.",
    "negatives": "no in-house fellowships.",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1972140C0",
    "positives": "meal stipend. free parking. supportive faculty. low cost of living. all IM electives. residents seemed happy.",
    "howInterviewDayAffectsRank": "LOWER",
    "comments": "Residents seemed very friendly/suportive; may have only been my experience, but got a bad vibe from the PD when he told me I have competition"
  },
  {
    "nrmpProgramCode": "2326140C0",
    "gift": "T-shirt",
    "timeGiftReceived": "Mail"
  },
  {
    "nrmpProgramCode": "1814140C0",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1814140C2",
    "positives": "Apparently, not as affluent patient demographic translating into “near to none” defensive medicine. Per the PGY2, don't have patients who can sue you. Not sure if that's a P/N",
    "negatives": "Witnessed one of the most awkward moments during the Meet&Greet where a PGY2 (senior-most resident) literally tried to shut down any more Qs related to procedures.",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1727140C0",
    "positives": "Kaiser benefits, attendings and PD nice on IV day, 5k moving stipend to relocate to Hawaii, most residents stay within Kaiser system after graduation, emphasis on primary care if that is what you are interested in",
    "negatives": "traditional schedule, very small program, vacation scheduled for you in blocks during Dec and June and not flexible, residents don't seem to hang out much outside the hospital, limited research so not good for those interested in fellowships, high COL , standardized questions had the interviewer reading off a script",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1431140C0",
    "gift": "Nothing",
    "comments": "happy happy funtimes"
  },
  {
    "nrmpProgramCode": "3350140C0",
    "positives": "switched from transitional to 4+2 this year, good fellowship match, largest/main teaching hospital in Hawaii, many residents live in the same apartment complex, attendings all nice, PD group session personalized based on applicants fellowship goals, Hawaii weather year round,",
    "negatives": "high COL, Q4 24 hour call at Kuakini community hospital as upper, residents stated research in some areas (specifically nephro) can be scarce but are able to obtain projects from mainland, be prepared for why Hawaii/connections to Hawaii qs during interview day, lots of extended breaks during interview day. Patient populatio fouses on Asian/Pacific less opporutunties to see cases like sickle cell",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "3350140M0",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "2140140C0",
    "positives": "This is the only HCA I would consider. PD is great and is a cards. Amazing location. Residents happy. Strong cards training!!!",
    "negatives": "ITS HCA!!!!! Meditech. Strong Cards training? More like the only elective they have available, and their competing hospital ended up buying thr group. No elective opportunities",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1172140C0",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "2117140C2",
    "positives": "Their fellowship match looks solid for PCCM. MedEd track available, seems like they do many cards procedure in the hospital? One of the program leadership folks is hybrid inpatient+outpatient so nice to have that exposure I guess",
    "negatives": "Entire interview was generic behavioral questions. Didn't feel like they even looked at my application. No X+Y system >>>> APD did not seem interested in me at all when asking me questions. PD seemed nice but still did not feel they even looked at my app, just all behavioral questions that were entirely impersonal",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "2117140P0",
    "positives": "Housing is cheap (1200 2BR) and in front of the hospital. The PD is very nice. You can become double-boarded IM + lifestyle medicine if that is your jam, sounds cool for someone interested in primary care or endo",
    "negatives": "Only 1 resident at a time in the lobby + no social. Seems like the teams are not very big (1 resident + 1 senior on floors?) >>> No research opportunities, if you're interested in fellowships- don't go here >>>>> Resident unprofessional- called me out for my ques (you're there to answer ques- why be pricy)>>>>>> be prepared for tons of behavioural ques- depends on which APD is interviewing you",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "1168140C0",
    "negatives": "seems like the PD and APD aren't particularly interested in the residents, just looking for a cheap workforce. > it seemed like they don't really care much about the interviews and they just rank according to step scores"
  },
  {
    "nrmpProgramCode": "1405140C0",
    "positives": "Residents were friendly. PD was very professional and good with the interview. Good vibes. Location is crazy good.Free parking. >>>Location, provides H1b >> an opportunity to participate in morning report is amazing, felt great emphasis on residents' teaching and work/education balance seems great, good work-life balance. Seems like leadership is receptive to residents' feedback",
    "negatives": "Patient load is low. They do have 3 months a year at a sister hospital that's super busy, but unsure if thats enough. Weak fellowship matchrates, but fwiw it's mostly IMGs on H1B visas so theyre all looking for GC first before fellowship. Traditional schedule. >>>> seems like workhorse prog, low scholarly support, most EC only possible if resident initiated, low complexity of cases. PD mentioned its a small community program with very few resources. Very low patient count so less opportunity to learn.",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "1226140C0",
    "negatives": "Only cardiology fellowship for now, expanding to GI and heme/onc"
  },
  {
    "nrmpProgramCode": "3053140C1",
    "positives": "everyone seemed nice, good fellowship match rates, highlighted how they dont need residents for their hospital to function, lmao they just want residents, im lazy so it was a plus for me",
    "negatives": "They said they were looking for primary care physicians",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "1127140C0",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1170140C0",
    "positives": "Strong culture (residents actively hang out outside of program events), supportive residency leadership, great clinical training opportunities. Dr Simpson seems really well liked. << Big emphasis on education (like teaching students, attendings love to teach, etc.)    Biggest transplant center in IL (heart, lung, kidney, bone marrow, etc), lots of ICU time, match a lot to cards and pulm/cc",
    "negatives": "Lack of benefits compared to simlar programs (no consistent meal stipend aside from night shifts [$14 per night], parking isn't free, etc.)., less emphasis on research. 6am sign out    Doesn't seem to be an emphasis on procedures. They're available if you want them, but their focus isn't necessarily to train proceduralists    Cannot moonlight until PGY-3, but this seems to be a state policy and not a Loyola policy    They seem a little too proud of how hard their residents work. +7    During social residents kept mentioning how hard they work. Seems like program leadership does not really make changes based on their feedback. Mentioned that Loyola is having financial issues and serious staffing issues    Felt like the program was bulk interviewing applicants. 60+ applicants per interview day. Only had 1 interviewer for 30min +3    Wellness seemed to consist of a $40/month gym membership and wellness sessions rather than free food and time off... Near Chicago but transportation from hospital to the city sucks, will have to drive and own a car....     ICU heavy rotations, resident mentioned he feels more comfortable managing ICU patients than the \"bread and butter\" floor patients which was concerning...+1",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "Nothing",
    "comments": "Big emphasis on QI, can be positive or negative depending on what you're interested in +2"
  },
  {
    "nrmpProgramCode": "1121140C0",
    "positives": "PD seems really flexible, i've never seen someone with at that age with so much mobility in their ankles and hamstrings",
    "negatives": "So many behavioural ques. < the PD basically grilled me and seemed to be reading off of a list of questions. +1",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "2163140C0",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "2247140C0",
    "positives": "Location- nicest part of Chicago, major referral center in Chicago/Illinois, rotating at the VA. Strong cardiology department (several past AHA presidents in the department currently). Very nice facilities. Culture of \"nice, hard-working, smart\" pervades program, people seemed down to earth, almost every resident I encountered said they have been very happy, strong fellowship match particularly in cardiology, a lot of people stay at NW. PD + APDs seemed really invested in the program and residents. about to switch to 4+1 for intern year to alleviate long stretches of inpatient rotations in response to resident feedback",
    "negatives": "Expensive/difficult to live in Streeterville (pushing back, you don't have to live right by the hospital in Chicago, public transport through lakefront neighborhoods is very accessible). \"Purple palace\" reputation, though still provides care to a diverse population + rotating at the VA, DEI seems to be a greater focus than it has in years past, though this is definitely a recent change. Schedule change for interns now X + Y, details murky, also will have some leadership change in the near future. //     There was an incident where either a resident or attending joined the call for interviews and in the background you could hear someone say \"another Black man just killed another White woman\" with a weird connotation. PD apologized at the end but still leaves a weird taste in my mouth that you have either residents/attendings (I think it was an attending) that have that mindset <- I think the quote was actually \"and why did that Black man attack that White woman.\" Anyways, I thought the PD addressed it really well, and the follow-up email explained that it was apparently a radio show in the background. <<thats fucking hilarious xd    seems like the program is in a big transition phase with the union coming up (this is positive), schedule changes, lots of ongoing discussions on wellness. felt like we would be the big guinea pig class though the new 4+1 seems like a big upgrade than what they had before (resident said she had 3 months straight of inpatient with no golden weekends, staying till 10pm most nights). still seems very workhouse-y, ambulatory education didn't seem like a big focus    Didn't let us to turn our cameras off during presentations and the PD has an ASMR voice. Deadly combo.     Anyone else have a weird interview day experience? Loved the program but had very strange interviews, didn't feel like they read my app or were listening at all",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "Nothing",
    "comments": "Confirmed that PD Dr. Didwania is leaving soon to another position within Northwestern GME, national search for new PD will commence soon. Also switching to X+Y for intern year (4+1+1), though still keeping traditional schedule for PGY-2 and PGY-3 -> exact details of this switch are still being worked out."
  },
  {
    "nrmpProgramCode": "2177140C0",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1147140C0",
    "positives": "APD IV was very good. Personable, but one of the only notable positives from the IV day. Some of the best inpatient hours I've seent. Happy residents and collegial environment from what I could see. Strong emphasis on wellness. Great benefits (free parking, retirement matching, etc.) <<average benefits in my opinion?",
    "negatives": "Residents on social didn't let a single person in our group get a word in, just too busy talking amongst themselves. +2 Interviewer was also late on interview day. Nothing super jarring or bad, but left a bad taste in my mouth for sure    No bone marrow or lung transplant program, you can get some exposure through electives, but just something to put out here    Very limited procedural exposure compared to other programs. Info from PGY3 going GI +1    Don't appear to have much comittment to DEI also limited cards match this year (I second this)    PD didnt make an appearance",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "2922140C0",
    "positives": "Internally match competitive fellowships. Easier to couples match."
  },
  {
    "nrmpProgramCode": "1160140C0",
    "positives": "resident community seems very warm and positive, great benefits and work/life balance, PD is super approachable, great support for year-to-year transitions and specialty-specific research, everyone is passionate about their patient pop. Very strong pulm/crit (ICU), GI (IBD), and heme/onc department. H/O -> numerous leadership positions in ASCO (current chair of medicine was president of ASCO last year). Strong focus, at least within the residency program, on serving underserved, primarily African American populations on the South Side. Residents come out outstanding and have lots of autonomy, more of a workhorse program (could be a pro/con depending on what you want). Strong procedural training (most are signed off on procedures end of intern year).",
    "negatives": "only one site (could also be a pro), essentially have to decide living in hyde park vs. buying a car even though rest of chicago has decent transit, less transplant exposure compared to northwestern and UIC.//Even the Hyde Park folks seem to have a car just to maintain a social life since most of the program lives in South Loop.//Nobody will give a straight answer on what the meal stipend is     I got negative vibes from the residents. 4 residents during the interview day said the program is \"alright\" and beat around the bush when asked on what can be improved. Seems like they are overworked. Everything else seems solid tho   Agree with above, residents honestly seemed so exhaused during the social, seems like they are defintiely overworked in ICU and go over 80 hours ; interviewer wasn't super friendly and didn't seem to really care what I had to say +3//The residents I interacted with at social and IV day seemed genuinely happy. Acknowledged that intern year is intense w/ the ICU time but felt supported and gave good vibes. YMMV I guess, I can see residents who are fine with ICU thriving on other aspects of the program versus the ones who dislike it suffering overall because it seems to be such a central piece of the program.",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "$20 Grubhub gift card",
    "comments": "day of interview"
  },
  {
    "nrmpProgramCode": "1150140C1",
    "positives": "residents seem close. strong committment to DEI and advocacy work that didn't feel like lipservice. Interviews were conversational despite some standardized questions! ///// residents are unionized and have received tons of perks from this. incredible chill and flexible schedule - one chief mentioned being able to travel to 6 weddings in pgy3 year without having to take a single vacation day for them ///    Both the PD and deputy PD were transparent about the issues around transitioning to X+Y during intern year (staffing + scheduling). They have plenty of tracks. You can do a Masters free of charge and residents said it is doable especially during PGY2 PGY3 with the X+Y. Everybody (residents and faculty) interacted very naturally and there were friendly vibes around. I tried really hard to fing any malignancy or things that were previously mentioned in the name and shame reddit but I only had positive things to say after interviewing.    Went into this IV day w/ low expectations but honestly was super impressed, moreso than some of the \"higher tier\" programs. Lots of different tracks and opportunities, strong emphasis on underserved populations. IV had lots of standardized questions but the IVers themselves wanted to get through them so they could talk with us, which was nice. Could naturally sense very good camaraderie among residents. Strong fellowship match this year. Apparently only have clinic 2x a month during traditional intern year on wards so its not bad at all. Have union representation with awesome perks. Apparently 70k as an intern starting next year",
    "negatives": "Traditional schedule intern year. PD says he's \"trying to implement a 10 +2\" so you know intern life is roughh. Interview day was long.                     Limitations: program is more inpatient oriented and they said they are working on their outpatient curriculum. I wouldn't say its negative per se, but intern cap is 10 since day one.",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1175140C0",
    "positives": "free food",
    "negatives": "PD tries to be snarky. It is in the middle of effing no where. Fellowship match rate not that great.",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1187140C0",
    "positives": "Emphasis on diversity and anti-racism. Good fellowship match, ample research opportunities. PD was super nice. faculty knew my app well. chief resident gave honest answers in my session. vibes were great b/w residents as well. free parking.    Huge hospital system and really impressive set of hospitals to rotate at. Volume is insane and each hospital has it's own niche so no real concern about turf wars/territory. Impressive fellowship match this year. Methodist is a cardiology leader.",
    "negatives": "standardized interviews, lots of behavioral questions, not a lot of time at end of interviews to ask questions. Residents gave vague and not completely honest answers during social (for example, when asked about a weakness of the program resident said they could not think of anything) Social was poorly organized and repetitive, not a lot of time to ask questions. The residents did not seem to know each other. +1 social was a dissapointment    Traditional schedule. 24 hr call (VA q4)",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing , got a post card 5 weeks after IV",
    "timeGiftReceived": "5 weeks"
  },
  {
    "nrmpProgramCode": "1187140C1",
    "positives": "extremely invested PD and senior APD who founded the program. +1",
    "negatives": "fellowship match particularly in competitive subspecialties is an uphill battle. split time between two locations about an hour or so apart BUT one is in EST and the other in the CST time zone. can make for some super early mornings or weird commutes.",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing",
    "comments": "."
  },
  {
    "nrmpProgramCode": "2306140C0",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1346140C0",
    "positives": "Residents really enjoy the program and seem very happy. Generous food stipend. Free, covered parking. Successful fellowship matching despite being more of a community program.",
    "negatives": "Interview started at 7am. Watched a video on zoom. Half of the students then didn't have interviews until 9 or 10am - so spent 2+ hours just waiting around on Zoom. PD was very formal but friendly.",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1203140C0",
    "positives": "PD seems like the sweetest man on the planet. Residents all seem very happy. Overall seems to be a very supportive program that will help you accomplish what you want to. X+Y schedule seems nice for QoL and identifying subspecialty mentors",
    "negatives": "Seems like parking isn't ideal  Small airport    4+1 so schedule is not the easiest    Chiefs mentioned that during intern year you have a combined day+night VA rotation where you will essentially step foot in the hospital every single day for a month. It is a 6 day cycle with one overnight every 6 days. You work 4 day shifts and get out by noon on the 4th day of the cycle. You return on the 5th day at 4pm (weekday) or 6pm (weekend) and complete an overnight shift and leave the hospital on the 6th day before noon.The cycle starts over the next day when you revert back to day shifts. To note, between the 4th and 5th day of the cycle you have 28-30 hours off.",
    "howInterviewDayAffectsRank": "MUCH_HIGHER",
    "gift": "Mug + Hand written note",
    "timeGiftReceived": "post-interview"
  },
  {
    "nrmpProgramCode": "1208140C0",
    "positives": "All years of residents there, seemed to really be enjoying their time at KU. 3+1 schedule      Very large hospital. They like to keep their own for fellowship (6 this year out of 13). My interviewers read my application and it was one of the few programs where I felt like they were actively trying to get to know me instead of just checking boxes. QOL is good, the city has good things to offer. They have a strong POCUS curriculum.",
    "negatives": "Interviewer didn't know my application at all and was reading it. kept asking me similar questions that I had already answered",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1848140C0",
    "positives": "nicest PD I have ever met <<< people are incredibly nice and friendly here.",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1217140C0",
    "positives": "Longitudinal outpatient clinics in the fellowship you want to go into. Faculty is very nice. Residents seem incredible tight-knit",
    "negatives": "Decent amount of 24 hour call",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "$30 grubhub gift card",
    "timeGiftReceived": "pre-interview"
  },
  {
    "nrmpProgramCode": "1139140C0",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1224140C0",
    "positives": "have rotations in all the subspecialities and have in-house fellowships in all subspecialities. research heavy focus. very interested in residents pursuing fellowship/hospitalist. 4 training hospitals. Residents seemed very friendly and emphasized that they had good work/life balance.",
    "negatives": "no reimbursement for step 3/level 3. primary care track is brand new. PD interview was half the time of the other interviews (8 minutes). Interns work traditional and upper levels work 4+1.  they actually do pay for step 3",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "1232140C0",
    "negatives": "its in fucking shreveport"
  },
  {
    "nrmpProgramCode": "1225140C0",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "1966140C0",
    "positives": "umic",
    "negatives": "automatic room changes that would cut  you off mid sentence +1"
  },
  {
    "nrmpProgramCode": "2352140C0",
    "positives": "chill",
    "negatives": "A small more rural oriented city",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "3073140C0",
    "positives": "Interviews were very conversational and by far the best vibe. Have gotten rid of all 28 hour call and seem to be VERY receptive to resident feedback >> agree interview vibes were amazing, 5 mins with PD was conversational, interviews were very casual and conversational everyones seems very happy good vibes.",
    "negatives": "PD gave off weird vibes (was clearly reading from computer)",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "spices, hot sauce, beads, koozie, recipe cards",
    "timeGiftReceived": "pre-interview"
  },
  {
    "nrmpProgramCode": "2313140C0",
    "positives": "PD super nice, knew about my application, residents all very friendly",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1236140C0",
    "positives": "Little to no IMGs , PD is great and very proud of the program particularly the RIMM track, interested in people who love the outdors and want to remain in Maine , resdients were all very friendly with each other and seemed enthusiastic about the program",
    "negatives": "Maine winters",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "1942140C0",
    "positives": "Shiny new hospital; close affiliation with larger academic programs at GW and Maryland; faculty seemed enthusiastic and interested in resident education",
    "negatives": "Residents were rather awkward and it was hard to get a read on whether they're happy or not; fairly new program, fellowship list not terribly impressive so far. Pretty expensive cost of living for a small town (~2000 rent)",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1237140C0",
    "positives": "Very nice people and positive interviewer interactions. Medium sized program in a medium sized hospital. Fellowship match is good. Opportunities to rotate at main campus for electives and research. Apparently good food on site.",
    "negatives": "Minimal diversity in clinical sites. Interview day incredibly long , 12 residents as medium. weird vibes from co-applicants?\\",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "2219140C0",
    "positives": "Program will set up schedule dependent on the residents interests, lower COL",
    "negatives": "Interview was not conversational at all, asked mainly behavioral questions - some of which were used multiple times in the four interviews. Newer program, fellowship match is yet to be seen if it is actually legit or not. Overall, felt rigid not too enjoyable.",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1251140C0",
    "positives": "PD and residents were all friendly. Seem to have a lot of research connections in the area (but not within its own program). Lots of exposure to wide range of cases",
    "negatives": "Very big program that seemed a bit disconnected, work in multiple hospitals so have to commute. Some of the interviewers were very rigid/formal and were reading off list of questions which came off weird",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1249140C0",
    "positives": "Extremely personable team, aPD was very sweet, shared program factoids in detail. Everyone seemed happy to be there. Tie-up with Hopkins for Hem-Onc, and option for away electives (4 weeks every year). Appears couple friendly. Good fellowship match rate.",
    "negatives": "Community hospital, so more effort to be made in way of research for pursuing fellowship."
  },
  {
    "nrmpProgramCode": "2316140C0",
    "positives": "APD, faculty and PC were very nice. They knew my app very well and asked specific questions about it. Enjoyed the vibes overall and residents seemed happy. Felt more like a conversation than just an IV.",
    "negatives": "Not a fan of the interview day. Three interviews and had nearly over an hour in between each interview. It was a very \"what questions do you have for me\" type of interview.",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1252140C0",
    "positives": "Strong fellowship matching, PD is very nice, residents seem to enjoy their lives, very relaxed and conversational interview +3 >> agreed, mine was probs the most conversational interview i've had so far    Residents seem to enjoy the program and had good things to say, especially how easy and helpful faculty are in getting   them invovled in research/career goals. They are continuing to work on a medical education track. Inteviewer was   enthusiastic and led a great conversation. PD seems very invovled and wants to continue to improve the program.",
    "negatives": "My interviewer seemed nervous interviewing me, which was a little weird, but I felt it was still very positive interaction //   Residents harped on the people + feel, but vibe didn't seem to match, didn't seem enthused - also got the sense that it's more workhorse +2  Residents seemed a bit awkward and did not look happy during resident Q&A. +7  PD seemed very nice and approachable on interview day but did not respond when I reached out in regards to couples match.  They have 3-4 24hr+ calls during 2 week MICU rotation (2 MICU rotations total during intern year) + more during senior level rotations >> PD actively trying to remove all 24hr calls, residents all said limited 24s especially with the way the PD wants to change the program    Barely had a chance to talk during my interview; faculty member did not seem to have read my app and basically spent 20 minutes interrupting me to ramble about their specialty. Residents did not seem very happy, and they still have 24- and some 28-hour call    Apparently some subspecialties (esp cards and GI) it is harder to get a mentor. They supposedly give everyone a mentor when you start but an intern trying to do cards told us he still didn't have one, and it's December // No one really addressed stipend is pretty low in comparison to other programs in the same city",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "1905140C0",
    "positives": "Has new PD who seems really sharp and committed to building a great program; this program used to be a super malignant IMG mill and you can tell they're working very hard to shed that reputation. Electives available at the main UMD program as well as other area institutions. Really nice new hospital. Faculty also seemed very energetic, residents seemed genuinely happy. 100% pass rate on ABIM last year.",
    "negatives": "Lots of changes being made at once, so everything about the program is in flux. If you're a USMD and you match there, you'd be the first, which might not work for some people. PG County is pretty expensive. <- the salary is extremely low! << welcome to residency",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1256140C0",
    "positives": "4+2/3+3 schedule sounds clutch, can signal your preference for doing night shifts or q3 28hr call in the ICU (though not guaranteed).// Strong focus on medical education, innovative with regards to structure of residency (for example mentioned a new AI resident track, only program to explicitly discuss AI). Great vibes from current residents during social events, seems collaborative and supportive. Historically poor benefits, but this year they seem to have a new $100 housing stipend, so PGY-1 salary is 57k.",
    "negatives": "As an intern you'll be a guinea pig for both the new PD and Epic switch (said to be done by May/June). Both may go smoothly but could be a lot of change at once.// So many hospitals in Boston, each occupying various niches, so maybe not as well-rounded as a non-Boston program. // weird interview experience-second interviewer was all \"questions i have\" and evident she hadn't really read my app ...   very busy for such small hospital. Dont know if procedures are limited due to patient safety.",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "nothing",
    "comments": "PD Dr. Smith leaving soon (will be vice chair of education at BIDMC), will still be involved with program, search for new PD ongoing"
  },
  {
    "nrmpProgramCode": "1257140C0",
    "positives": "Great vibes from residents, they really seem to care about their patient population    One interviewer I had was matched based on interests, and interviews themselves were half standardized/half conversational. Strong committment to community advocacy from both faculty and residents. Many tracks available and seems like many residents participate in one.    Had the most engaging/interactive noon conference I've seen so far",
    "negatives": "Was very disappointed by the benefits, seems like the program relies on their reputation to recruit. COL very high, parking is $150+/month at main hospital. Can spend up to 3-4 months per year at the VA that is not located near BMC/area where residents live and transport is unreliable according to faculty/residents. VA you also work with BIDMC/BWH which has its pros, but also separates time from your cohort so take from that what you will. Residential parking is a \"nightmare\" according to my interviewer and will add time on to your commute especially during the winter if you need to dig yourself out/in to a spot. Very difficult to pay for residential parking on the salary they give. Patient population will require the use of translator apps frequently, program overall is very proud of their mission but important to understand for daily workflow.     Not OP but I didn't think their benefits were bad at all... From what I can see, they give $750 meals/year (+free lunch every day), $1,200 education stipend/year, $4,250 total stipend for any spending our first year (it becomes $5,000 our second year), plus our starting salary would be 78k (pgy-1), and then 84k (PGY2) which is high even for a city area",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "1265140C0",
    "positives": "honestly very surprised by how much i liked interview day! faculty and interviewers seemed very down to earth and approachable. while traditional schedule does have its cons, residents on most services except ICU work 18 hour shifts. also lots of flexibility with the schedule and residents often trade rotations to tailor their experiences to certain specialties or to have easier blocks to get more research/extracurricular work done on the side. BWH and MGH also formed a union and bargaining will begin soon, hopefully amounting to increases in salaries and other benefits by spring of intern year. also having the harvard name and connectiosn that come with it. interviewers emphasized having a culture of kind residents, less \"jerks\" lol. residents seemed happy overrall   awesome primary care tracks with amazing PDs and residents :)  Genuinely good vibes, all the residents and faculty were joking with each other constantly. PD seems lovely.  Compared to MGH, more convenient to take advantage of HMS resources and med student teaching opportunities due to physical proximity",
    "negatives": "Petty but for their stature they have one of the worst residency websites I've had to use +4 that website truly gave me nothing; truly garbage website  - Not sure if anyone else got this impression, but like the info session was very dry and my interviewers were very unengaging/dry just like a series of questions (and someone mentioned it was by design?). Not sure if others had the same experience, but not the best impression +1 so disappointing >> do you mean that they asked you to ask them a series of questions? Didn't find the people to be nice, one interviewer in particular was incredibly rude to me. Your mileage will vary, but posting this to validate anyone else who may have the same experience. <<<<Was it Dellaripa? He has a bit of a reputation << lol i had him he was so intense <<Thank you for sharing guys, I also had a bad experience with Dellaripa, he was so condescending he's single-handedly the reason I am not ranking BWH #1...glad it wasn't just me. Everyone else was nice though, obviously a world class program no matter what I think but you only get a small amount of time to evaluate programs and when someone chosen to represent the program is rude, its really hard not to extrapolate that experience, big 4 or not.   Though it's partly offset by the twilight system and ability to trade rotations/golden weekends, traditional schedule is still rough and they have no plans to change it anytime soon",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1268140M0",
    "positives": "Harvard-affiliated community program that is focused on providing care and advocacy for those in need. PDs are fantastic and super relatable, schedule is 4+2 and lots of educational activities",
    "negatives": "primary care program so lots of future PCPs - not for anyone wanting to do competitive specialties like cardiology or pulm crit. < what about heme onc. Interview day was mostly the faculty telling their autobiographies..very little discussion about the actual program, no food at hospital. Small program, so intern year may be heavy, you may be called suddenly to cover for someone during your ambulatory block because there are so few people.",
    "howInterviewDayAffectsRank": "HIGHER",
    "comments": "Fellowship match for upcoming and recent grads  -Rheum at Stanford  -PCC at UT Austin  -Cardio-oncology at MSKCC  -ID at MGH, Montefiore, Dartmouth  -Palliative at Brown"
  },
  {
    "nrmpProgramCode": "3130140C0",
    "positives": "my favourite interview by far! they were so nice and they knew my application in its entirety and i really appreciated that. the interviews were long enough that we didnt feel rushed and could actually have a proper conversation. i do wish we got more than 10 minutes with the PD though cuz he was awesome",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1261140C0",
    "positives": "Surprised by how nice everyone was and how well they got along. Also residents seem to actually like the Bigelow. The team interview was great, they are very friendly and gush over your accomplishments.//Was surprised by how balanced their schedule actually seems to be despite all the 24s. Lots of customizable elective time, inpatient time is protected so you almost never have half day clinic during inpatient blocks, everything being in two week blocks makes for a semi-x+y structure. Most residents actually prefer the Bigelow over the traditional day/night because the non-call days are fairly chill and it's a really social environment being with 3 other interns. And no prerounding!",
    "negatives": "Lots of 24/28hr call shifts// \"vibes\" = \"clout\" in that context imo. // Similarly felt that residents weren't very gushing about the program structure itself, and a few mentioned they didn't like the Bigelow system // Might be hard to navigate if you dont speak Spanish <<< this is America Spanish is basically a second language.<<Not sure where the Spanish comment came from because it's only like one clinic with a majority Spanish-speaking pop that you can opt into if you want. Residents said about 2 patients on their inpatient list of 16 need an interpreter (of any language) on average which is very little to me and actually a downside personally. //Can't moonlight until PGY3.",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "1812140C0",
    "positives": "Everyone were very friendly and welcoming. IV was conversational . Panel IV with PD,APD and cheif resident. They are genuinely intrested to know more about you / Good opportunities to rotate in decent medical centers including MGH and Tufts.",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1269140C0",
    "negatives": "Lots of scut work at this hospital. Residents are not happy at this residency. Lots of 24/28 hr call. PD did not seem interested during the interview. High COL.",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1284140C0",
    "positives": "Salary is decent. Close proximity to Boston",
    "negatives": "The living cost is very high which makes the salary relatively low.",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "1266140C0",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1290140C0",
    "positives": "People were friendly and the interview wet smooth",
    "negatives": "anticipate medical questions < like during the interview???????? yes what kind of questions please?<what kind of Qs please? Reproductive system. You show me yours I'll show you mine vibe",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1263140C0",
    "positives": "The penguin thing during interview day was the funniest thing I've seen in my entire life #IYKYK +1<<haha such a fever dream of an interview day, I want to rank tufts highly just for that alone 😂 they're currently considering 2+2+2 schedule where all of the blocks will be two weeks. supposedly will be easier as we'll have golden weekends back to back",
    "negatives": "Hospital may be having money problems - Tufts has met all financial obligations. The hospital is heavily investing in residents, increasing salaries by 9%, adding a 5000 stipend yearly, and matching retirement contributions. Hospital is also remodelling a lot of the inpatient units and is expanding its liver transplant program. Overall, our wards are always full << What is the typical end time for wards short call vs long call days?< intern said she got out routinely around 9/9:30pm for long call  Resident during social said it feels like they get thrown in at the start of intern year << it depends how quickly you can do admissions + timing of admissions. but on long call now im consistently leaving between 7-8",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "3050140C0",
    "positives": "PD is soooo nice. Residents seem happy  +2 about the PD. Very nice, approachable, and open to feedback from residents. Wellness is a top priority. Relatively good fellowship match rate with a lot of in-house fellowships",
    "negatives": "PD wasn't there for IV day, but had a good reason (family event)",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1286140C0",
    "positives": "PD very nice as were the residents and APD i interview with, good amount of critical care training, QoL isnt that bad for New Wngland but Springfield also is kinda lame, lots of feed back, seevral different tracks available, in house fellowships\">>PD is very down-to-earth and relatable, a lot emphasis on resident wellness, residents seemed happy and got along well with each other",
    "negatives": "Have anonymous feedback which seems like it could be abused  Springfield sorta sucks",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1930140C0",
    "positives": "the PD seemed fairly nice and very passionate about teaching. The resident interview was chill.   Seems like they have a fair bit of dedicated teaching time (twice daily didactics - morning and noon, as well as grand rounds, etc)",
    "negatives": "-felt like they didn't really know my app (only 2 15 minute interviews with generic \"why IM\" and \"why here\" questions)  -when asked about their favorite part of the program, resident answered with \"the workload\" and said he was a workaholic  -felt like their interview day was very low effort - no welcome/introduction ppt, only 2 15 minute interviews with basic questions not specific to my app, website was spare about information about their program, no resident meet and greet the day before either  -their ABIM board pass rate is 58% but when I asked the residents if they felt prepared about their boards they said absolutely (which seems sus?????)  -got the vibes this is a workhorse program  - 66% fellowship match but they have extensive fellowship programs in house",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "1915140C0",
    "positives": "- Super chill interview. PD is amazing! Looks like a very supportive environment and they are very strong in teaching.  - POCUS curriculum and SIM lab.  - Residents look happy.   - 100% pass board this year. +1, great interview day!",
    "negatives": "Once a week half day clinic. Not a X+Y schedule.",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "$10 Starbucks giftcard",
    "timeGiftReceived": "Post-interview"
  },
  {
    "nrmpProgramCode": "1361140C0",
    "positives": "PD and the residents were very nice. Interview day was very organized.",
    "negatives": "For-profit hospital",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1307140C0",
    "positives": "My interviewers had a chill vibe, but they asked about red flags immediately. 2. So for me I really liked the new PD and the faculty especially Dr. Zreik. Took time to read my personal statement. Went over all my experience. Really appreciated my answers. I feel so good vibes. The residents look happy. If you have kids and family and ur an immigrant. Its a great program for you.",
    "negatives": "Felt rushed +1. I also felt it was rushed. The alloted time was short. The only bad thing is the location. Otherwise everything was great. The program is situated in an unsafe part of Flint, and was advised by the residents to to go out at night."
  },
  {
    "nrmpProgramCode": "1951140C0",
    "gift": "(In person): this cute pizza cutter and utensil kit + pizza recipes",
    "timeGiftReceived": "on arrival at hotel (in person)"
  },
  {
    "nrmpProgramCode": "1866140C0",
    "negatives": "Flint is trash. It's an IMG heavy program, and Flint is small city.",
    "comments": "Don't drink the water in Flint"
  },
  {
    "nrmpProgramCode": "1866140C1",
    "positives": "residents seemed to like program, APD and PD were very chill and friendly, seems like they get decent training, work hard but with reasonable schedule, only do a couple 24 hour shifts in their residency",
    "negatives": "during my 1-on-1 interview with a resident, he said that the meet-and-greet painted way too rosy of a picture of the program, felt like they weren't supported, the hospital is understaffed, there is no focus on education, didactics are primarily resident driven (2 residents said this), that \"the hospital brings out the worst in people\" and residents have thrown each other under the bus, he had the program ranked low but the algorithm matched him there, said the program is getting rid of UWorld funding, mentioned the low ABIM pass rate   -1 of my faculty interviewers had his camera off the entire time, which I thought was odd  -they don't have POCUS yet but the PD said they're working on it  -multiple residents mentioned research opportunities were limited",
    "howInterviewDayAffectsRank": "MUCH_LOWER"
  },
  {
    "nrmpProgramCode": "1866140C3",
    "positives": "I rarely walk away from an interview thinking \"Wow\", but these guys did it. PD is very cool. Good vibes all around from all the interviewers!  -I'll agree the PD is very cool",
    "negatives": "the PD started off my interview by asking what my friends hated about me which gave me a bit of an internal crisis lol, but otherwise he was chill",
    "howInterviewDayAffectsRank": "HIGHER",
    "comments": "I met someone that did a TY year here who said he was carrying 20 patients as a PGY1"
  },
  {
    "nrmpProgramCode": "1315140C0",
    "positives": "Their fellowship match list is kinda insane in a good way (for the caliber program that they are)",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1951140C0",
    "positives": "had in-person and virtual interview options.     For my in-person experience:  -resident dinner super chill, good vibes from resdients, they are happy with the program     Inperson interview: PD, APD, + chief interview. Felt like they really knew my entire app, chill interview vibes, seems like they focus a lot on resident education    General: subsidized apartment housing available (but not required) for the residents for fairly cheap, absolutely GORGEOUS hospital - most beautiful hospital I've seen by a long shot, 1.5h away from chicago",
    "negatives": "Location is probably a con for most people, not much to do in St Joseph    Knew someone who had an in-person interview here but one of the faculty interviewers was on vacation so the interview was done over Zoom anyways",
    "howInterviewDayAffectsRank": "HIGHER",
    "comments": "one core faculty was 6 minutes late to a 15 minute interview, PD was nice but i did not vibe with her"
  },
  {
    "nrmpProgramCode": "1292140C0",
    "positives": "- PD is SO nice. Can tell she loves teaching and wants program to be adequate for teaching. Encourages everyone  - Can tell every interviewer read my application thoroughly and asked specific questions about it",
    "negatives": "- Cost of living in AA is very expensive, compensation doesn't exactly reflect that",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "1418140C0",
    "positives": "PD very nice",
    "negatives": "Not many pathologies"
  },
  {
    "nrmpProgramCode": "1293140C0",
    "positives": "Spectacular benefits and salary. Ann Arbor is a wonderful college town. PD and the rest of the program leadership are genuinely some of the most kind people I've met on the trail. Interview day was super chill, more of a vibe check",
    "negatives": "Predominantly home match < what does this mean? There's quite a bit of people who match from outside Michigan every year < Original comment is not necessarily a negative, UM is a top program with tons of prestigious in-house fellowships +1 you can't count home match against a T10 program. bad parking situation, residents mentioned several times. ICU training seems meh",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "nothing :(((",
    "comments": "did anyone get the vibe that the ICU here is an afterthought? Interested in PCCM and really liked it but it seemed small/heavily staffed w NPs, would love anyone else's opinion <<same impression here, not really a fan of how procedures are set up at michigan either"
  },
  {
    "nrmpProgramCode": "2170140C0",
    "positives": "Seemingly nice people. +1    very good culture!",
    "negatives": "5 hour interview process, the affiliation to UMich isn't really making a significant impact, not much to offer.+1 The required general surgery rotation during intern year is also a big negative for me. +1 Felt more like a FM program disgusing as IM, especially since their continuity clinic seems to be their biggest draw.",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1314140C0",
    "positives": "- Loved the PD!! She is super passionate, does a great intro, makes every feel super comfortable before going into interviews.   - Super organized, very well structured.   - Had a lot of the typical questions we ask answered in presentation by PD   - 100% board pass rate and 100% fellowship match rate over last 9-10 years even though they hardly have any in house fellowships.   - Lots to do in Kzoo/west mich",
    "negatives": "-one of the APDs gave slightly unhinged answers to some of my questions (was very defensive about their traditional schedule instead of x+y)  -personally I wouldn't say there's a lot to do in kzoo",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1330140C0",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1329140C0",
    "positives": "People really believe in the safety net mission",
    "howInterviewDayAffectsRank": "MUCH_LOWER",
    "gift": "Nothing",
    "comments": "Genuinely enjoyed my rotation and the people here, but felt like the interview was trying to convince me not to come +1"
  },
  {
    "nrmpProgramCode": "1328140C0",
    "positives": "4+4 with heavy outpatient which is great, lots of time for electives and research. Almost 14k given for attending conferences. Rotate through all subspecialities. DEI focus is big. They're here to support you literally nicest ppl everyone and I mean EVERYONE said how nice it is to call consults bc they want to teach and don't want to be mean. Very collegial. PD seemed awesome and supportive.",
    "negatives": "Rochester can be difficult if coming from big city and not super diverse patient population although more diverse than I thought. Food scene meh. << Contrary to popular belief, I found this place super competitive. The weather, food and lifestyle are absolute turn offs >> competitive in what sense? (i think it means unhealthy competitive environment in the program?) >> residents seemed very distant from one another +1 (I have experienced this too)<<so I'd buy that +2  Minneapolis is NOT that close despite what might be advertised, can make it difficult to travel. DEI focus is a negative. What ever happened to a medicine focus?",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "YouBetcha Box with chocolate, $30 grubhub giftcard to be used during night of social < are the boxes sent pre-interview?<No, I got mine after the interview <got mine before my interview last week but upcoming holidays may have been a factor",
    "timeGiftReceived": "3 days before"
  },
  {
    "nrmpProgramCode": "1334140C0",
    "positives": "Really good work life balance with the 4+4. Residents seem very happy with their choice and seem to get along really well. PD was very nice <<<echo what was said about Dr. Duffy the PD. Love what they have going on culturally here. seems like a great place to work and live . Research support/opportunities seem very robust",
    "negatives": "3 hopsital system with the hospitals somewhat far away from each other < the hospitals are 10-15 minutes from each other    The weather gets tough in the winters, only thing scaring me away from the program < it's really not as bad as you would think; it's very manageable",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "2266140C0",
    "positives": "Everyone seems very happy at program, residents feel well prepared. They want to know interviewees, so in person. Sim wars. Really personable. Nice facilities. Great pass rates. Really low COL.",
    "negatives": "Weekends, small airport, no Uber/lyft, rural",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "In person hotel and meals- bag, pens, info, lanyard"
  },
  {
    "nrmpProgramCode": "2288140C0",
    "positives": "beautiful facilities, residents happy, SEC games, dedicated procedure rotation as intern, POCUS, Oxford is nice but expensive, unopposed",
    "negatives": "new program, no solid numbers",
    "howInterviewDayAffectsRank": "MUCH_HIGHER",
    "gift": "In person hotel and meals - lanyard, lunch box, bag, pens, notepad, bluetooth speaker",
    "timeGiftReceived": "iv day"
  },
  {
    "nrmpProgramCode": "2335140C0",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "1957140C0",
    "positives": "Everybody was sweet and welcoming. Very family oriented. Cheap COL /// extremely comorbid patients with advanced pathology. has a VA (across the parking lot). good procedural exposure. solid match, program believes strengths are in cards and PCCM because of once again, extremely comorbid pt pop and advanced pathologies. people are all very kind and welcoming - really loved everyone i met between social and interview day. <<< very impressed by their PD Dr. Thigpen",
    "negatives": "Jackson. Mississippi.",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1365140C0",
    "negatives": "resident said in response to what do you do for fun in St. Louis \"we have limited time, so hanging with friends is always good.\" They said program responsive to feedback by granting them elevator access.",
    "howInterviewDayAffectsRank": "HIGHER",
    "comments": "Haha elevator access, what??? << Interviewed here and that was never said"
  },
  {
    "nrmpProgramCode": "1994140C0",
    "positives": "Residents were friendly and seemed to get along, PD was friendly    The PC really knows the city. Interacting with her allowed me to get to know the city. She also knows many of the former residents",
    "negatives": "-Not a lot to do in Columbia  -lack of patient diversity  -parking $30/month  -no meal stipend  -APD whole interiew was applicant asking questions and would respond 1 sentence answes +1 (had very weird vibes with the APD, felt like if she didn't want to interview anyone but was forced to it)",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "1343140C0",
    "positives": "Residents were friendly",
    "negatives": "Entire interview day was 1 hour long",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1633140C0",
    "positives": "3 wk blocks, Nicest PD and PC. Zen room. All the residents talk about how good they have it, lots end up staying after graduate. Admin open to resident ideas. Small program, close group. Tertiary Care, Level 1. 100 % fellowship match, 1/3 fellowship, 1/3 dualist, 1/3 hospitalist. Rural rotations. It is beautiful, lots outdoor stuff to do. agree +1",
    "negatives": "It gets really cold. Rural rotations for some.",
    "howInterviewDayAffectsRank": "MUCH_HIGHER",
    "gift": "Waffle cookies, taffy, honey straw, water bottle, notepad, pen, montana info pack",
    "timeGiftReceived": "cookies are delicious!!!!!   Pre-interview"
  },
  {
    "nrmpProgramCode": "1372140C0",
    "negatives": "Both my interviewers had such dry personalities. Interviews were not the most conversational, they were more interested in runnng through a list of questions. In fact my first interview was a game of 20 questions and it was the first time I did not get a chance to ask anything. >>>>> I wouldn't call their personalities \"dry\" - it was straight up HOSTILE. Had a very similar experience and it was INCREDIBLY OFF-PUTTING. Felt like I was being grilled and nitpicked non-stop. Most unpleasant interview experience this season. >>> Yeah i guess dry wasnt the exact word, my interview wasnt exactly hostile but not a warm reception, and definitely surprised me considering how the residents kept saying everyone is \"too nice\" and that it was a midwestern characteristic.",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1376140C0",
    "positives": "Residents were great. Faculty were friendly and low-stress interview. >>>>>> residents receive an extremely competitive salary AND lunch every day at noon report AND $10 per diem on their badge for food/coffee. Unheard of and absolutely incredible ///// extremely strong ID presence",
    "negatives": "Still have 24 hour calls. Traditional-ish schedule.  Personally I thought the residents were lower energy than other programs",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "UNMC Yeti",
    "comments": "yeti is sweet. didn't think they were sending it out this year. (did my IV several weeks ago)"
  },
  {
    "nrmpProgramCode": "2337140C0",
    "negatives": "Didn't put too much effort to sell the program,  weird interview questions from one attending    Residents said wards ends at 6pm when the night team gets there but \"sometimes they get there early!\" lol",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "2223140C0",
    "negatives": "toxic vibes, residents seem overworked, throw to the wolves type of environment"
  },
  {
    "nrmpProgramCode": "2028140C0",
    "positives": "Overall the residents seem to like each other, and there are in house fellowships, PD seems super nice, seemingly receptive to resident feedback",
    "negatives": "Seems like they aren't too keen on keeping their own residents for fellowships, the residents made it seem like the program lied a bit about their research availability - said its basically more a community program than it is an academics.",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "2017140C0",
    "negatives": "was really excited about this program prior to interview day and got weird vibes, resident hour during interview was disorganized & one resident overtook the whole conversation, residents didn't seem super happy and didn't really see them interact/joke with each other like other programs, PD almost seemed offended when applicants asked him challenging quesitons which imo he should have been ready for these",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "lanyard, laptop case"
  },
  {
    "nrmpProgramCode": "1377140C0",
    "positives": "Super chill and fun. Very friendly environment  >>> second that. PD is also amazing! Really values wellness and residents seem super happy there. I read these negatives prior to my interview and got nervous but I thought Dr Friedman was great as well. Overall positive interview experience",
    "negatives": "APD Harley Friedman incredibly offensive to various applicants. will shame after rank lists << How so? I didn't have this experience at all << separate commenter - during interview he challenged my main passions with skepticism, but this allowed me to defend them and show how much I really care. I could see how this could come across as rude when many other programs try to recruit you by buttering up to your app, but it seemed like a strategy for him to see if you actually care about what you put on your app. If there is truly something shame worthy, it should be made known now please, before we all make an important life choice. I'm sure it can be said with enough anonymity if it is important enough — lmao this is ridiculous, bro you're Dartmouth you should be fluffing applicants to try and get them to move to New Hampshire instead of being a douche <---LMAO. I had weird interview experiences, it also seemed like they were challenging my experiences and seemed skeptical almost? bummed because i was really excited about this program .",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "2248140C0",
    "comments": "Why is HCA in New England - this garbage should stay in Florida"
  },
  {
    "nrmpProgramCode": "1394140C0",
    "positives": "PD was super responsive, really friendly and responded to my thank you letter. Residents seem happy, 70% fellowship rate and opening up more in-house fellowships over the next few years. Lots of case reports / Their Interventional Cardiology is very strong. Card faculties from Cornell moved to Morristown recently. Nice QoL. Residents said they had tons of free time during intern time to study for Step 3.",
    "negatives": "Community hospital, residents were clear about - if you want to match competive stuff like GI you're going to have to really go digging, research is not readily accessible",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1408140C0",
    "positives": "First PD to actually respond to my thank you letter",
    "negatives": "Asked one clinical scenario question",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1378140C0",
    "positives": "Strong culture, super friendly and supportive faculty.",
    "negatives": "Not ideal for fellowship, resident reported getting research will be difficult as it is not common among attendings. Malignant program. Not friendly for people of color. A resident recently got fired from here for no reason. Literally over something that happened in the cafeteria. <You got this info from the interview?",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "2003140C0",
    "negatives": "Residents look very unhappy. The program haa long hours of call. Mismanagement at peak. The Faculty interviewing asked me about my scores and my grad year which was weird. She did not know anything about me. And the whole interview I had weird vibes."
  },
  {
    "nrmpProgramCode": "1380140C0",
    "positives": "You can get a real community vibe, PD is super nice and friendly. Big academic center with exposure to many subspecialties",
    "negatives": "Board Pass Rates is a bit discouraging. The interview day is painstakingly long and by the time you get to the Q&A after 2 hours of presentations there are quite literally no questions left to ask- it was crickets, and PD didnt even want to end it early since no one asked questions. Also interviews on thalamus suck and super glitchy. // I found the interview day not that long compared to others. Only two 25-30 minute interviews and two 1 hour presentations by the PD and chiefs respectively. Then 1 hour Q&A. Overall 4 hours total. the interviews were only 20 minutes long and of the 20 minutes, each interviewer spent only 10 minutes asking you questions...",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "2136140C0",
    "negatives": "Condescending attitude from PD and other interviewers. Everyone seems miserable. Overall, worst interview I have had in terms of vibes and that says a lot because it was my last one for the season.",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "2086140C1",
    "positives": "Very friendly vibes from PD, APD and residents. Seem to really care about residents and their well-being",
    "negatives": "no inhouse fellowship",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "2086140C0",
    "negatives": "Residents said there were not enough computers available for Rs when asked negative things about the program.    SOAPed last year.",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "2120140C0",
    "gift": "Magazines and pens"
  },
  {
    "nrmpProgramCode": "1395140C0",
    "positives": "Super chill Rs",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "3043140C0",
    "negatives": "Super rude PD. He criticized every single answer I gave him. Residents seem very unhappy",
    "howInterviewDayAffectsRank": "MUCH_LOWER"
  },
  {
    "nrmpProgramCode": "2375140C0",
    "positives": "PD talks more about New York City than the program & new jersey combined in his presentation lmao. PD made it hard to choose the program. was begging to rank the program low if we anticipate some challenges.",
    "negatives": "The program does not have much no SIM lab etc, and pays very low. Rotating in different hospitals, you won't see your co-residents for the whole of PGY-1. PD didn't give a friendly vibe. Kept interrupting between answers, looked disinterested.     Interview with PD was incredibly off-putting (asked one question about why I had so much research, why I took five years in med school (research year), interrupted me during my answers, and then the classic \"any questions for me?\" for the rest of the interview). Poor organization with no agenda on interview day. Low pay. Cap of 10 patients per intern. << I agree with the comments above, the PD seemed really disinterested, I felt it was because I was the last person getting interviewed. Even the questions asked by PD seemed unprofessional and unkind. <<<< Similar experience. PD interview lasted 4 minutes. Extremely uninterested +1. PD is rude, uninterested, and offputting, and kept interrupting. The questions are random, illegal, and lack structure.      probably the easiest DNR i've ever seen in my life lmao lowest salary I've seen by over 10k, PD was uninterested, program seems trash",
    "howInterviewDayAffectsRank": "MUCH_LOWER",
    "gift": "Nothing",
    "comments": "DNR!!! PD himself needs interpersonal skill training but demands residents to have the skill, lol +1      do not go to this program unless it's your last choice lol. PD flexed how competitive they were by saying they had to go up to spot 50 on their rank list for 20 spots. probably bc they only rank bottom tier applicants. << not to mention that almost everybody else on my interview day was an IMG from the PD's home country"
  },
  {
    "nrmpProgramCode": "1857140C0",
    "positives": "PD pretty chill, has all fellowships, and most residents match in-house",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "2108140C0",
    "positives": "Affiliated program. PD really nice, clearly read application and was genuinely interested in what I had to offer",
    "negatives": "Did not read my application. seemed disinterested     Rude interviewer. When asked a question to him, he actually yelled at me saying \"Why are you guys asking the same questions? Do you practice IV qs with the same book?\"     EOD long call schedule seems harsh.",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1380140C0",
    "positives": "PD seems very supportive and ambitious to help with the program.",
    "negatives": "New program (first official class started last year). Dont have great reputation in the region.",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "none"
  },
  {
    "nrmpProgramCode": "2298140C0",
    "positives": "good fellowship match as of their first graduated class 6/6 , chill PD . Residents look happy and supported by the program",
    "negatives": "adapting and changing program but i don't see this as a negative",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1390140C0",
    "positives": "??",
    "negatives": "8+1, work horse program-- like veryyy high, no sim lab, can't do away rotations outside rutgers system, very high COL, 24hr calls, not a lot of emphasis on wellness>>>>>>no cap on ICU patients, super busy clinic 10 patients cap on clinic>> no sim lab",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1392140C0",
    "positives": "Interview was very chill. Starts with one hour overview where applicants get to ask questions. Interviewed with PD and she was really nice and very interactive. She seems very close with her residents based on how she presented the program. Based on my interview with the PD she just really wants to get to know you and see if you are a great fit for their program. I am not sure about other interviewers though. It ends with a one hour meet and greet with a resident.    Super nice PD who seemed genuinely interested in applicants.",
    "negatives": "Higher COL due to living close to the beach    Super high workload. PD even asked if I would be okay with high patient volume. Senior Rs have 24hr calls.",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1398140C0",
    "positives": "PD seems very supportive and actively working to improve program. Big emphasis on teaching. Research encouraged and easy to get involved with. Moving to 4+2+2 as of July. PD was great… seems like he's responsive to feedback and trying to build a positive culture. << I agree that the new PD is making drastic changes in regards to promoting resident wellness and education. Of each 8 week block, 3 guaranteed golden weekends which in comparison to the prior schedule, might only have 2 golden weekeneds out of 10 weeks. He's also establishing early mentorship program for residents and is making it a priority in terms of making a schedule that speaks to the resident's career goals. During clinic weeks also, there's 3 half days with the weekends guaranteed off",
    "negatives": "Residents said transition from intern to senior was difficult. 3 sites to rotate at is a lot << chikitsa chhatra at njms here, each site has a completely different pt population and imo it's a great learning experience and not as bad once you adjust...   vibes were off, residents did not know each other well",
    "howInterviewDayAffectsRank": "LOWER",
    "comments": "What questions were you asked?"
  },
  {
    "nrmpProgramCode": "2918140C0",
    "positives": "Structured program, Abundant opportunities for research, Faculty and Residents Seemed Down To Earth and Friendly and Happy, Good location being in the middle of NYC and Philadelphia, plenty of Golden Weekends, 4+1, Clinic Weeks seem pretty chill, Plenty of Support for Interns, Seems like a highly academic environment. Relatively easier transition from Intern to Senior year as teams are 1 resident/1 intern with 12 patient cap, Can sign out on 12 on the weekends if not on call. Consistently strong fellowship match.",
    "negatives": "Spend 30% of your time at a community hospital in Princeton which is 40 minutes away from New Brunswick. Clinic weeks can also be in Princeton. Recent nursing strike at RWJ hospital (although residents were emphatic that it did not interfere with their education at all). Would disagree that RWJ is in a good location, it's between NYC and Philly but close to neither. There's really not much going on in the nearby area.",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "2391140C0",
    "positives": "Super chill vibe with the residents and attendings. APD was very nice seemed really engaged in the program.",
    "negatives": "Location. Elizabeth doesn't have the best reputation",
    "howInterviewDayAffectsRank": "SLIGHTLY_HIGHER"
  },
  {
    "nrmpProgramCode": "1406140C0",
    "positives": "good community among residents, research if you'd like to find it",
    "negatives": "very low salary. north jersey is not cheap to live in"
  },
  {
    "nrmpProgramCode": "1962140C0",
    "positives": "great vibes, great pathology, diverse population, able to work in a rural & urban settings, awesome PD, efficient IV day done in 2 hrs.",
    "negatives": "paid parking ($40/year), standardized/situational questions, understand the reasoning but conversations did not flow as well as other IVs +2, residents seemed tired during social and pretty low energy. Didn't seem to interact much outside of work. <Thanks. nobody showed up on zoom social so will be ranking them last +1 <Thanks, there was a social though but it started late",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing",
    "comments": "UNM residents seem to be active on this spreadsheet +1"
  },
  {
    "nrmpProgramCode": "2182140C0",
    "positives": "Good vibes for the most part.",
    "negatives": "Exudes chaos. +1",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1414140C0",
    "positives": "Short drive to green mts/adirondacks, large catchment area",
    "negatives": "Nothing but standard questions, boring area to live in, terrible winters +1",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "2113140C0",
    "positives": "Such sweet people - really care about wellness of their residents and the residents are super close. Super honest about the fact they aren't research heavy and don't make compeitive applicants for fellowship",
    "comments": "Said their accrediation issue is mostly related to the fact that the hospital closed own two fellowship programs last year (alluded to toxicity) and that the IM program has nothing to do with it. >Surgery program got shut down in 2023 also"
  },
  {
    "nrmpProgramCode": "1420140C0",
    "negatives": "Damn wtf was that. << What happened? Did they ask something weird/unexpected? << I was asked medical questions; intern said they do a lot of SCUT work",
    "howInterviewDayAffectsRank": "LOWER",
    "comments": "wasn't asked medical questions, but PD/faculty interviewers definitely did not look at my application. also only got to talk to 1 intern from the program who was doing a Q&A while giving us a tour, barely could answer q's bc she's an intern. red flag to me"
  },
  {
    "nrmpProgramCode": "2207140M0",
    "positives": "Good program if you are really interested in primary care",
    "negatives": "- PD looked really uninterested, was just asking behavioural questions   +1, Residents in Q&A stated that getting fellowship can be challenging,",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1994140C0",
    "positives": "Lots of layers of support, emphasis on resident education and listening to resident feedback, great resident benefits, have been increasing ancillary support// subsidized housing that actually feels subsidized; residents seem to be a really tight knit community and love their pods. Pod system seems cool, seems like it's builds camaraderie and ensures you develop longitudinal working relationships with co-residents.",
    "negatives": "Vacation/elective time taken out of Y weeks instead of inpatient weeks, kept saying \"we have more ICU time than most\" throughout the day. // They also mentioned that during elective weeks you can get pulled during weekends/elective time for coverage... was confused on the details as I'm not sure it's every elective block or not but was not thrilled about that;     They go on about their underserved patient pop but compared to many other programs with similar populations they seem to have little to no formal opportunities for real community engagement/health equity efforts besides just \"they're our patients.\" It's a little paternalistic and also a community being underserved isn't just the natural order of the world, someone (including you) is actively underserving them so what are you actually fundamentally doing to help change that dynamic<<Underserved is just an overly intellectual way of saying poor, not sure what Columbia is supposed to do about that, they can't just conjure cash and prizes and send them to their patients<< \"not sure what Columbia is supposed to do about that\" they could look to the many other institutions that are at least asking the question in an invested manner cuz their job is, y'know, research<< they mentioned that have dedicated selective blocks each year where they focus on a specifc topic centered on engagement in the community, i.e geriatrics selective PGY1 where interns go to community centers to work with the eldery pop there<<ah yes the zumba classes...groundbreaking for a multibillion dollar institution. Look I'm still gonna rank them highly based on other factors but I am gonna call out what looks embarrassing compared to what opportunities places like UCSF, BMC, and UChicago (hell, even Penn) are offering to residents who care about this stuff. This is the only program I've interviewed at so far where I asked for names of faculty working in my area of research interest and nobody could give me one. And if you don't wanna hear it from me you can look to all the news about what folks in Harlem/Wash Heights feel about how Columbia serves their community.<<Columbia residents spend most of their time bedside actually serving underserved patients. That is their job. I get that some people would rather do \"research\" on health equities or something, but that type of thing tends to help the careers of people doing it more than it actually helps poor people. << Honestly agree that most people seemed to avoid thinking critically about structural inequities and disparities. As an institution, Columbia could definitely be investing more in education pipeline programs, policies for affordable produce, funding CBOs who work on health-adjacent initiatives, lobbying NYC elected officials, etc. <<not only does columbia have very little, if not zero public outreach in the community but they have been actively buying up property for years, displacing poor people from their homes in upper manhattan. if you look into it, it's pretty bad. some of their properties aren't even used for anything academic, they act like corrupt landlords and jack up the rent.    I think the issue with the ancillary support is real, even if they claim it's getting better.",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "Nothing",
    "comments": "jesus its a whole god damn essay in the negative section"
  },
  {
    "nrmpProgramCode": "1422140C0",
    "negatives": "Shit program (WHY ? please mention)",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1492140C0",
    "positives": "PD is awesome. Intern year is relatively light, but pay for it on the backend with heavy 2nd and 3rd year schedule. No 24 hr call. Typically 1:1 intern to senior resident ratio on wards, 8 patient intern cap. Get hospital food stipend ($10/mo), catered lunches everyday, bagels in the AM. $2 lyft stipend per year. (Theres 27 hour call in ICU and lots of ICU time btw)",
    "negatives": "COL is insanely high (for me) even with subsidized housing. Second year very hard? <-- said they're doing 6+2 for PGY2 year as well now // housing is not subsidized. it's only subsidized in the sense in that our salaries are among the highest in the country, but the rents themselves are more or less at market rate for the area. in fact, a few years ago, the rates were above market rate and people were moving out. in general, rents are at roughly market rate. to be clear, i don't think this is bad, in fact it's good, bc when rents are too low the landlord is not motivated to keep the building in good repair. but i also want to dispel the myth that it's subsiized. << Not a lot of outpatient time during PGY2. Evening clinic time 1 day/week until 7:30pm. No formal Med Ed track but there is a certificate program apparently but they did not talk about this at all during interview day. Overall, interview day was pretty uninformative in terms of what they offer and they spent a lot of time trying to convince us that it's a good place to work/train without many concrete examples. Interview day did not run that smoothly, not a fan of them not even telling you what exact time your interview will be and it was just a bunch of standard questions that the interviewers had write down notes about your answers. During Q&A, residents talked about going over duty hours a few times.  Not a single residnet I spoke to had a positive experience at MSK beyond the reputation. Also, \"hold phone\" for what is effectively urgent care once a week on your outpatient day's till 10PM, which effectively feels like long call. // agree, MSK is almost universally disliked. The best learning imo for an Onc rotation is 1/3 inpatient, 1/3 consult, 1/3 clinic, but our MSK time is 100% inpatient. Doing that much MSK inpatient is not educational, and cynically, I wonder if it's just bc they need warm bodies for inpatient coverage. Some residents even rotate at MSK thru Gen Med, and I did not learn a single thing about cancer during my MSK Gen Med time. I never even talked to an Oncologist. It's marketed by the program to applicants as a plus, and it has that potential as a world leading cancer center, but as it stands, just mostly doing the same inpatient BS you'd do at any other hospital. << 27 hr ICU call wtf???",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1663140M0",
    "positives": "any info would be greatly appreciated thank u!"
  },
  {
    "nrmpProgramCode": "1445140C0",
    "negatives": "Felt robotic, not organized, no schedule so you just sat at your computer for 4 hours awaiting for your turn. +1 same experience.",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "2230140C0",
    "positives": "PD is very straight forward. Seems cool. He literally said 'real recognizes real' and seems to focus on a good fit for both the applicant and the program.",
    "negatives": "newer program",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1478140C0",
    "negatives": "PD asks clinical scenarios for ddx and treatment",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "3172140C0",
    "positives": "Say it with me: Jacobi STRONK <<shxt. Impressive presentation by PD. Very conversational interview and they really know your application well. The camaraderie seems really strong and make me a fan of their program after the interview    Unionized. They really support research. I guess the program's prestige revolves around their fellowship match so they'll go above and beyond to guarantee that.",
    "negatives": "<<<how was your interview with the PD? <<<exactly what you'd expect 🙄    The ICU is on the smaller side imo (11 beds)",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "nothing",
    "comments": "Mine was a good one. I learned a lot more about the program, and my interview with PD and another APD both went really well. Joyful conversations. 30 minutes each. Hope that helps."
  },
  {
    "nrmpProgramCode": "1484140C0",
    "positives": "It was all good. PD and APD's are nice. Chief residents and residents are super friendly.+3",
    "negatives": "Lots of behavioral questions from the PD. They also dont shy away from the fact that the patient load is crazy high, and the residents mentioned \"social issues\", which im guessing are major if they felt they had to spell that out in the Q&A.",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "1428140C0",
    "positives": "very friendly residents, PD and chairman., even though they are a community program i noticed big emphasis in research and teaching. >> i did not notice any emphasis on research>>> same, didn't notice any emphasis, if you wanna do you can do",
    "negatives": "Super busy hospital, you will only have time for sleep and no social life. But i guess that comes with all nyc programs. COL is high if you want a decent place around with amenities (in unit washer/dryer). but can get room for 1000$ too in the basement if thats your thing. >>>> Overflow of ICU patients. CAP is 10 patients but your team takes care of 50+ patients which is a lottttt>> very tiring>>>>>> REsidents and Chief took meet n greet from the hospital and had to leave in 30ish minutes, clearly speaks of how busy it is>>> GOLDEN weekend not garunteed on Y",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "3153140C0",
    "positives": "Get to work with a very diverse & sick population resulting in strong training. PD faculty and chief residents seemed really nice; residents seemed to get along well and said they do lots of social things together",
    "negatives": "Like 50% of the residents live on the upper east side, with like a 40+ minute commute. Lot of emphasis on \"autonomy\" so interpret that as you will, some attendings on service don't love to teach, residents who i spoke to seem very burnt out and not enthusiastic about the program (although recently unionized so maybe things will improve)>agreed, residents kept saying things like \"you will work hard\" and \"this is a place to come if you'll be OK with being thrown in the fire.\" PD mentioned sometimes ICU-level patients (on pressors) will be on the floor (he tried to spin it as a good thing for our training lol)",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1459140C0",
    "positives": "Very friendly PD and faculty, tie-up with Montefiore Moses for electives/research, location, mentorship since it's a small program, you get to do more procedures since you don't have to share tasks with fellows",
    "negatives": "High COL, has a required research project but other than that they don't seem very research-oriented // IVs felt very disorganised - you're waiting around in a break room until your turn?? No previous notice of when your actual interview would be, so you're not technically on \"a break\" even though they call it that. PD and APD didn't seem to have an objective to their interviews - didn't even read my app --> didn't ask any focused questions. Not even going to rank",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "2309140C0",
    "negatives": "Residents seemed tired/not interested during meet n greet and interview was medical questions; been there: was in an unsafe and bad geography of newburgh, literally scary down the street from the hospital, program has no environment for research at all, hostile vibes, nothing like wellness or anything. // One faculty asked medical questions during IV. Another one showed lack of interests and asked only 2 questions: What happened if you don't match? And what happened if you won't soap successfully?. Interview sucked!",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "3153140C3",
    "positives": "PD very sweet. Program takes regulaer feedback. Interview with APD went smoothly. Residents close knit > had an interview with PD, agree she is very sweet. residents also seem to be fine",
    "negatives": "Short call is 12hrs and long call is 26hrs. How is that even OKAY? No time for research, can only do during clinic. You will be doing scut work. ICU not well established. Did not like the vibe of the program. Felt toxic",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "1490140C0",
    "positives": "Residents really seem to love each other (+2) and feel supported, patient diversity nearly unmatched, PD seems cool and straight up said our only job as 4th years is to chill, lots of elective time intern year. // New PD seems very nice and seems to have a vision for the program moving forward. They're looking to expand their sim and POCUS curriculum. No 24 or 27 hr call. Subsidized housing, but they didn't talk much about it during interview day.",
    "negatives": "If you're really into global health Kenya is the only option and you can't create your own global health opportunity elsewhere, you're basically locked into whatever housing lottery pick you get as an intern because if you decline an offer you can't reapply, alternating black (ie. no weekend day off) and golden weekends rather than the typical one weekend day off but this depends on the person whether it's truly a negative or a positive /// Not about program itself but interview day is about 2-3 hours longer than it needs to be +1// Program seems to be more and more research focused and less clinically focused. Almost everyone pursues fellowship, every resident has to do some sort of research project. Night float has to stay for morning rounds the following day, so comes out to ~13-14 hr shifts.",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "Nothing",
    "comments": "Seemed typical length to me. My impression was the different meetings were not only an opportunity for us to ask questions, but for the leadership to learn about us. If you can, schedule social with residents night before IV// Why is it negative that most residents pursue fellowship and residents do research projects? I thought these would be positives. I didnt think they were saying they were less clinical. Reading the other comments re the level of acuity of their patients and morning report on interview day it seemed like their patients were really clinically complex. Any current resident who could comment on clinical vs research focus? <-- current resident here. patients here are incredibly complex and quite sick but the training is well-structured so that you get eased into your responsibilities. as an intern, you don't do admissions during the day (your senior does all day-time admissions while you manage the floor) and you do every single admission on nights with the supervision of a PGY-3. each team is also structured to have two interns and two senior residents, so you have direct supervision for each patient you care for. morning report is protected didactic time for senior residents to help them build their clinical acumen and decision making skills. we also have noon conference for residents and interns. in terms of research, you are required to engage in \"scholarly activities\", but there are a lot of chill QI project opportunities if you don't want to do clinical or wet-lab research. lots of research going on as an institution but you will have to network aggressively during intern year to find opportunities (particularly within cardiology and GI) because attendings are very busy and stretched thin in terms of mentees. residents do match very well for fellowship, and on the interview trail Sinai residents have built up a reputation for being both clinically and academically strong. as a whole, I feel that the program is great for wellness (generally quite friendly hospital cullture, tons of golden weekends because of alternating golden/black weekend schedule, am consistently able to get out by 2-3 PM on q2 short call/long call, cheap subsidized housing, great location in NYC)."
  },
  {
    "nrmpProgramCode": "1491140C0",
    "positives": "Resident seem to love eachother, good vibes, chill, lot of opporunities, good leadership and supportive +1, very diverse, residents/chiefs were all happy and get along well. SUPER supportive PD, everyone praises her. No scut work, no labs, growing research; elite resident pay, the day of interview was not bad either, chief/residents/PD all seemed chill and great vibes all around! Allowed us to turn off camera in between while we wait for interview was a nice break",
    "negatives": "none, it is community hospital; long call every other day >> what is the long call hours? Seems bad to have long call every other day :(  <- I was told that long call is 7 am to 7 pm and short call is 7 am to 4:30 pm. this is only on WARD but clinic+elective is fairly chill is what I was told  Emailed to inform everyone that their salary will drop by 10-12K. huge red flag --> Chief Resident here: the salaries are NOT dropping by 10-12K. The program contacted applicants to be transparent about ongoing contract negotiations. The sample salaries that were sent to applicants are from the last finalized contract between our union CIR and NYC Health + Hospitals, which was about 4 years ago. The sample salaries that you received were indeed within a competitive salary for an NYC program AT THAT TIME. Once agreed upon, the new salary will be competitive and similar to other NYC IM residency programs. We encourage applicants to join the Q+A session on 1/11/24 if they want to understand more about the employment change.",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "2070140C0",
    "positives": "Great location / Primary care track PD was super friendly +1     I'm not as scared about the merger as everyone else is. I go to a large med school and I don't particularly feel the need for \"individual attention\" as a resident. It sounds like the program has made great progress in recent years and their fellowship matches were quite impressive. I don't know where all the negative points are coming from, there are much worse programs in NYC and Morningside/West has definitely benefitted from the Mount Sinai name and proximity to the main campus. Also my interviews were great and the faculty were really friendly and nice.",
    "negatives": "merging with beth israel and the program is going to be humungous. Less individual attention, just another body +5 >> Will this effect fellowship opportunities? /// Honestly had a terrible interview experience; you have 1x 30minute interview with an APD and felt interrogated rather than having a conversation with someone. +4 APD rolled her eyes a lot while I was giving my answers (which retrospectively, I still think were really reasonable?) and it threw me off. I guess this shouldn't my color my whole opinion of the program, but it's made me reconsider ranking this as highly as I initially wanted to +4 ///// had a similar interview experience, APD was clearly texting during my interview and was obvious they were not listening to a word I said while answering their questions, conversation was entirely impersonal and it didn't seem they cared to get to know me as an individual at all /// Didnt feel like APD had read my app and i too felt like i was being interrogated, and felt like the program has already decided their rank list so I was just wasting their time :(( +1  Golden weekends are not guaranteed during Y schedules due to WARP system where Rs have to be on call during 1 weekend night on elective/outpatient. >> Rotating M4 here, they are planning to switch to Q2 call schedule and the rationale was that it will guarantee golden weekends --> Q2 call for IM is insane, yeah? -> Wait is this for real? -> confirmed in interview today that Q2 call is happening. -> I must have missed this, so it ll be till 8pm q2d?   <<What's gonna happen to their subsidized housing after merging? Are they still able to offer housing to all new interns and BI Rs?>> Same question //////",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "nothing",
    "comments": "Yes, the merger will make them a huge program but they are also taking in all of BIs APDs to keep the same ratio they have now to keep an eye on residents and offer the same quality of mentorship (if that helps in any way lol) >> I wish the program would provide more information of the anticipitated post-merger changes >>>> incoming class seems almost doomed to have a lot of logistical issues with housing, rotations, fellowships, research, individual attention, everything. it's a shame << how so?? What is an influx of PGY2/3s going to do to fellowship matches for the class of PGY1s?? PGY2/3s from BI should already have established research mentorship by now, how/why would that take anything away from PGY1's who likely won't even have the time to get started on meaningful research until the second half of intern year? I think the perceived downsides to the merger are being blown way out of proportion"
  },
  {
    "nrmpProgramCode": "3067140C0",
    "positives": "Very nice facilities; residents seemed happy; PD, PC and faculty interviewer were all extremely nice. Good relationship with Sinai main and people match for fellowship there pretty often. Has 2 \"Shabbat spots\" (Sabbath-compliant resident positions) per class, if that's important to you. Interview day was an appropriate length.",
    "negatives": "Newish program (founded 2019); Oceanside seems boring and suburban while still being pretty expensive; doesn't have fellowships in house, although cards is coming in 2025 with plans for GI in the works. Sunrise EMR in inpatient setting",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1448140C0",
    "negatives": "Malignant. Hated the interview day. It was 1 interview with a core faculty hospitalist (not even an APD).+2",
    "comments": "DeVry pays this place $$$ to take their idiot medical school students"
  },
  {
    "nrmpProgramCode": "1473140C0",
    "gift": "Bandaids, stress ball, and $20 Starbucks gift card<- i did an interview there and I didn't see this. Who sent it?",
    "comments": "panel interview with APD and another faculty 20-30 mnutes."
  },
  {
    "nrmpProgramCode": "1429140C0",
    "comments": "new PD"
  },
  {
    "nrmpProgramCode": "1822140C0",
    "positives": "Any insights about the program?"
  },
  {
    "nrmpProgramCode": "1700140C0",
    "positives": "Program seems very receptive to resident feedback, PD emphasized being okay with not knowing things at the start of intern year. Residents overall seemed pretty happy. Residents fed well (catered lunch during noon conference, snacks, free coffee), free parking.",
    "negatives": "PD pimped us during the interview day... IDK but I just got a weird vibe from this program during interview day. IDK what it was but something just semed kinda weird  +1 PD also pimped us, agree about the vibes, something was off<<Were the pimp questions her insulin/diabetic diet shtick?<<We did not get pimped at all. We were asked what TV shows we all watched. Thats about it. PD seemed very nice and approachable IMO. +4    PD referred to all the residents as 'kids' and 'kiddos' EVERY time..I understand feeling proud of them as if they were your children but calling them kids all the time while talking about their growth and milestones and hand-holding in the first few months just sent off not great vibes...  heard the EMR sucked <<fwiw, they are transitioning to EPIC in 2025 << Current First year here; coming from epic, the EMR at first was horrendous but you get used to it. Actually pretty simple and easy to use after you use it for a week",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "2062140C0",
    "positives": "program coordinator has the best energy i've ever seen. I know this isn't a huge influence on any decision making but she made the interview day really enjoyable and i got the sense that this positive vibe carries throughout the program. I also liked that they mention that even for a community hospital, residents who take the initiative to pursue certain goals for specialties can certainly find the opportunities to do so. Overall happy to say I came away more impressed with this program than I expected. +1, had an excellent interview session with this program. PC is the coolest. Would rank higher if I was willing to move to NYC",
    "negatives": "Rotate at Manhasset for a month. Small community hospital, fellowship support is not great.",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1483140C0",
    "positives": "strong education emphasis. good collegial environment with residents and faculty. Good mentorship and support from faculty. Barely any ambulatory sessions during the 2 weeks, so lot of free time to chill then.",
    "negatives": "call q3, weekends for interns seem overwhelming- 7 am-8 pm with a senior only there to help you for 2 hours.     WHERE. ARE. THE. FELLOWSHIP. MATCHES. << thanks, i'm not stupid. i've seen this. this is not helpful. <Idiot, you could grow some courage and email/ask the program << thanks, asshole, i already did e-mail them. got no response.",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "Nothing",
    "comments": "fellowship matches -> https://professionals.northwell.edu/graduate-medical-education/residency-internal-medicine-lenox-hill-hospital/student-life >> it's not by year though so hard to know how well they match per year"
  },
  {
    "nrmpProgramCode": "2187140C0",
    "negatives": "Tons of IMGs. High COL",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1417140C0",
    "positives": "PD, PC, attendings and residents were all nice and easy to talk to. Residents seem happy. Really liked the vibe of the program",
    "negatives": "New program",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1515140C0",
    "negatives": "Food voucher given that they dont even acknowledge in their cafeteria.<< PD interview was 5 mins, she asked if i have family in new york and if \"I know anyone in the program.\" Negative to both so i assume that weakened my position lol. Maybe that's a me issue tho? Interview with APD was good tho.",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "2183140C0",
    "positives": "Enjoyed my interview day, everyone was nice.",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "2978140C0",
    "positives": "I was genuinely surprised given everything I heard online, they seem like they have a good lifestyle. 4+2, vacation comes out of X weeks, Y is always protected for golden weekends. Clinic days are light relative to other programs. Have 24 hour call in ICU at several locations, but get post-post call day off at Bellevue(?) (similar to Columbia). Seems like elective time is chill + trying to find coverage/switch around rotations.",
    "negatives": "Apparently the Community/Brooklyn program included the fellowship matches from the Manhattan campus in their list which they don't make available online and only reveal during the interview which feels deceptive. << felt like everything during the interview was an aggressive sales pitch for a program i didn't even want. the way they shoved people into the brooklyn program and separated them from being able to rank the other programs is messed up. << pay is objectively the worst out of the Big 4 in NYC, class is like HUGE (think with prelims it is close to 100, categorical + PC + PSTP is about ~60), don't really get whole class hangout vibes but rather you try to find community within the class. No intern retreats.",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "Nothing",
    "comments": "did anyone else get very weird vibes from interview day? residents seemed unhappy, weird pay discrepncies between the programs. << Wow I didn't realize there were pay discrepancies. That's such a dumb idea, the residents at Sinai Elmhurst fought for equal wages with the other Sinai campuses and won. NYU pulling that same BS is asking for trouble"
  },
  {
    "nrmpProgramCode": "1455140C0",
    "positives": "Faculty and Residents were very nice. Seems like a nice, friendly environment to work. Becoming more of an academic enviornment now with medical school. Residents mention less management of private patients over the years. Good mix of community hospital setting with academic hospital setting. Residents seemed happy, and mentioned while they work hard, they don't feel like they are drowning in work. Good ancillary support. Right on LIRR being around 40 minutes away from the city. Only rotate at one hospital. EPIC EMR. Residents seem to want to stay at NYU LI either for fellowship or to work there as attendings. Opportunity for subsidized housing.",
    "negatives": "While Schedule is \"4-6 + 2\"\", the two weeks also can include elective time or vacation time, not just outpatient time. Might not see as complex patient cases as other university hospitals. Might not be the best program if you want to work in a clinic or want to match into a competitive fellowship at a top program. No continuity in clinic during ambulatory- its just random",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1509140C0",
    "positives": "You could tell every interviewer had taken the effort to thouroughly read my app. The PD was amazing and seemed very involved in resident wellness and support. By the end of my interview with the PD I genuinely felt like I had grown professionally because of the relevant and thought provoking questions he asked me. The program has implemented many changes based on resident feedbacks.The residents all seemed very happy. Many of them apparently ranked the program number one after interview day, and I can see why. They got along well with eachother. << second to this one. I had the same feeling after my interview",
    "negatives": "80% of their questions were just about research (or lack thereof)",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1510140C0",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1897140C0",
    "positives": "residents don't have to work weekends in ICU",
    "negatives": "24 hour call, Only one interviewer (PD who was late) and ability to talk to one resident, no food stipend most residents bring their own food, small educational fund, No MKSAP provided, resident alluded first year was terrible then better workload after that",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "2919140C0",
    "positives": "PD seems very invovled, will support residents ,  in their interests, Decent fellowship match. >>PD APD and residents were really nice and seemed happy, got a good vibe.. Honestly everyone was so nice to me during my interview day. Sucks that they have a shit schedule",
    "negatives": "Salary is low for COL, pay to park,   minimal golden weekends during intern year,   long call q2>> Why is it on LI and need a car? otherwise would strongly consider :(.... Also rotate at VA in northport which is like 40 minutes away from stony brook >> Residents mentioned that on the +1 clinic outpatient period, a lot of times you will have to do a weekend overnight shift at the hospital >> this is why they have minimal golden its a horrible schedule    Horrible benefits and salary, program does not seem to care about CoL. Look up Stony Brook on Reddit…",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "nothing",
    "comments": "https://www.reddit.com/r/medicalschool/comments/szxjbd/name_and_shame_stony_brook_university_hospital/"
  },
  {
    "nrmpProgramCode": "2919140C2",
    "positives": "It's the Hamptons",
    "negatives": "Hamptons in the winter"
  },
  {
    "nrmpProgramCode": "1426140C0",
    "negatives": "Low salary, hectic work, most of the residents mentioned overwhelming workload, hard to save up money due to expensive housing, very huge program so no support system it is on our own from the start    Hospital may be closing >>> see comments column -- only inpatient unit, switching to different hospital",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Stethoscope ??? seriously",
    "timeGiftReceived": "mail, after IV",
    "comments": "https://www.nytimes.com/2024/01/20/nyregion/suny-downstate-hospital-closure-brooklyn.html"
  },
  {
    "nrmpProgramCode": "1426140M0",
    "negatives": "Pay is very low compared to other NYC programs. No specific meal stipend, its incorporated into your salary so its taxed as well. Housing is expensive in the area with some residents paying up to $2500 for a studio. They still have 24 hour call in some rotations.",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing",
    "comments": "Downstate is cheap as fuck with salary"
  },
  {
    "nrmpProgramCode": "1516140C0",
    "positives": "PD is really hardworking, innovates in MedEd, +/- 50% of their residents stay there after training, 3+1 schedule with really nice 4 days clinic 1 day catch up to call pts, the social was pretty nice, residents knew their co residents baby names, they said the program increased the offer of vegetarian food options (after feedback). Huge salary increase coming, with cost of living in area being cheap you can afford to buy a house here if you want. Best of the SUNYs by far with recent changes",
    "negatives": "You do 24h shifts as a 3rd year in the ICU. Interview day way too long, paid parking ://, no real city transporation",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "hi ;)"
  },
  {
    "nrmpProgramCode": "3099140C0",
    "positives": "Residents were nice. Have all major fellowships in house except rheum. PD is extremely supportive and incredibly passionate about her residents, every interviewer clearly read my application and was interested in getting to know me (i appreciate, thank you! +1 - very detailed questions from them), very cool seeing PD and APDs interact in between breaks i could tell this program had a supportive family-like environment",
    "negatives": "4 different hospitals, multiple outpatient clinic. Had different tracks/pathways advertised, but were not very fleshed out when asked about. 4+1 schedule that means you get 1 golden weekend every 5th week (that means you get 1 day off every week for 1 month, and the 5th coming week you get an weekend off)   sites not close to eachother, many different EMRs (3 different EMRs- not only you need to learn all 3, but also being able to know them well, so get ready to learn),  resident support seems lacking. Residents were not forthcoming of the issues and only spoke of the positives of the program. OOS applicant: they grilled me about coming to Buffalo despite my own reasons, I get they have a physician shortage but 2/3 interviewers grilled me about it which was a huge turnoff +2",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing",
    "comments": "Got pimped on medical info during my interview lol"
  },
  {
    "nrmpProgramCode": "1511140C0",
    "positives": "Lower COL making housing affordable, associate PDs were very friendly and engaging, seem to really care about resident happiness +4, seemed very family friendly",
    "negatives": "Paid parking +10 minute walk",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "2157140C0",
    "positives": "My interviews were super chill. Seems like a hospital that likes taking their own for fellowship. Options for chill elective weeks, and clinic weeks seem to be pretty chill. Lot of clinical complexity on the floors. Seems like a great hospital to do residency at if you wanna be a hospitalist. Program seems very receptive to resident feedback.    Residents seemed cool. The union benefits are nice. They receive a lot of transfers and provide adequate support for residents.",
    "negatives": "Seems like clinic experience is lacking. Not the biggest name. Floors seem like they can become very busy.    Seems like coverage for conferences is something you have to come up with. Seems like the program's reimbursment services for presenting at conferences only covers flights within continental US (came to be a situation for CHEST this year)",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "3116140C1",
    "positives": "What can I say? The sex parties <<< wtf>>> lmao",
    "negatives": "residents seemed absolutely miserable"
  },
  {
    "nrmpProgramCode": "1435140C0",
    "negatives": "totally disorganized! +1 were begging me to rank them high and was trashing other programs",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "2128140C2",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1527140C0",
    "positives": "Really positive faculty, everyone seems super happy, benefits are amazing (800 every 3 months for food and such) residents seem to be very good friends and the atmosphere of the group was amazing  Absolute nicest interviewers ever  Getting a PCCM fellowship in next couple of years",
    "negatives": "Don't have my fellowship of interest there. lots of nights-interns do a night shift every 10 days while inpatient and then random shifts to cross-cover. This makes your day off inpatient either post or pre-night shift",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "Tote bag, Charlotte city guide, mini candle, cheesey biscuit bites",
    "timeGiftReceived": "Post interview"
  },
  {
    "nrmpProgramCode": "1943140C0",
    "positives": "Great faculty, great culture, great location",
    "negatives": "APD emphasized focus on primary care, so less opportunities for fellowship connections/research. Current residents are 80% male.",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1529140C0",
    "positives": "Residents seem happy and do hangout a lot together it seems despite the long hours. Program administration is super nice. Durham has a lot to offer for its size and is rapidly revitalizing - downtown is super walkable now with lots of new buildings and renovation of old ones. COL is pretty good. Good variety of clinical experience with DUH being a quaternary center with a huge catchment area, DRH serving as the Durham County safety net hospital, and the VA. Garage parking is free and pretty convenient with a mostly covered walk to DUH. Fellowship matches are stellar, with a good mix of home match and top tier outside matches.",
    "negatives": "They blocked out 5 hours of my day for only 3 interviews that were each 1-2 hours apart. No info session or Q&A, just a website for me to view on my own. I liked my interviews, but I felt like they could have put more thought into the interview day like other interviews I had. During my social I also had the impression that residents work very, very hard. Great vibes, but they definitely kept saying how hard they worked.   Rough schedule and long hours: their gen med schedule is 7-7, and everyone stays until sign out. +1 I don't think there was a single resident at social or on interview day that didn't say something along the lines of \"we work a lot\"  IM wards rotations are in the \"Duke North\" part of the hospital, which is really old and kind of cramped. ICU and certain subspecialty rotations are in the nicer \"Duke Central Tower\" and \"Duke Medicine Pavilion\"",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "comments": "Anyone know or asked any residents if theyre making any changes to the schedule or the fact that everyone has to stay until sign out??    A resident told me unprompted they don't expect that to change"
  },
  {
    "nrmpProgramCode": "3057140C0",
    "positives": "very nice people, like what they have going on here. sick patients",
    "negatives": "no VA."
  },
  {
    "nrmpProgramCode": "3023140C0",
    "positives": "PD seemed very accomplished in accademic medicine, with lots of experience in the area. She is very responsive to resident feedback and making changes based off their suggestions. Even though this is a fairly new program (graduating their first IM class this year), they have many core faculty members with years of experience in academic medicine. Big emphasis on rural medicine, primary care, and general internal medicine (hospitalist). Innovative \"tandem\" block scheduling allowing for more golden weekends (2 wks inpatient, 2 ambulatory) - this allows for their to be actual continuity with their patients in ambulatory blocks.",
    "negatives": "Main teaching hospital is an HCA facility (however they still qualify for PSLF through MAHEC). May not be the best option for those looking to match into a fellowship, given that this is a newer program (the PD has been working hard for her residents applying to fellowship so they are prepared for application etc). Resident work-spaces seem a little on small side/ a little cramped.     Is it me or did the residents seem to not vibe super well? Maybe I came in with higher expectations since it's a small cohort",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "Chocolate, tea, honey, coasters",
    "timeGiftReceived": "Months prior",
    "comments": "I was very suprised by this program, leadership really sold it."
  },
  {
    "nrmpProgramCode": "1534140C0",
    "positives": "The residents are super close with each other and looked genuinely happy at the program. On something different every 2 weeks so feel like a better schedule.",
    "negatives": "Research available but you have to seek it out. LOTS of ICU time. Meals not provided (get a stipened, but one resident said they ran out with like 3 months to go)",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "Notebook + pen + handwritten note",
    "timeGiftReceived": "post-interview"
  },
  {
    "nrmpProgramCode": "1900140C0",
    "positives": "Nightcation, where upper level residents get one week off following every week of nightshift, so additional 8 weeks of vacay per year. Residents also seem to love program, faculty emphasize individual development. +1    Dr. Bynum is green flags all around. She was so kind during my interview. The chiefs are also wonderful. It seems like just about everyone at this program is thrilled with it! >+1, everyone was incredibly nice, especially the PD Dr Bynum +1",
    "negatives": "Paid parking ($800/year!!), though food provided makes up for it. nightcation in pgy2/3 means you do a week of nights every 5 weeks  Parking is 10+ min walk to sign out. Have to stay until 7:15 2 days in a row every 4 days.   Match list was a little bit lackluster in my opinion -> they heavily emphasized that most wanted to stay",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "None",
    "comments": "Seemed that UNC is a place where people go to and stay. Even people who are not from NC, they tend to go there and be lifers. Not a positive or negative.     The program also seems to attract a lot of people with families. Lots of people with 1+ children. Not necessarily a plus or a minus, and likely a side effect of their very nice schedule."
  },
  {
    "nrmpProgramCode": "1537140C0",
    "positives": "They are so personable, really good energy.+3  PD was very thoughtful and sweet.  Very apparent that the faculty are friends with each other.",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "Dewey's cookies, Texas Pete sauce, waterball, pen, pamphlet about living in dining in Winston-Salem, and a card with tips for interview day",
    "timeGiftReceived": "Pre-interview"
  },
  {
    "nrmpProgramCode": "2275140C0",
    "positives": "Very personable, everyone was really nice",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "1542140C0",
    "negatives": "Residents say food sucks and red flag that they kept selling affiliation doing aways at CCF to get fellowship LORs.",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "$25 GrubHub",
    "timeGiftReceived": "Pre-Interview"
  },
  {
    "nrmpProgramCode": "1553140C0",
    "positives": "Friendly team. Conversational. Low pressure. Residents stayed on for an hour over lunch to answer questions. PD was very nice, matched with an interviewer tailored to my research who had also read my app. Residents seem happy",
    "negatives": "Paid parking",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1552140C0",
    "positives": "Great work/life balance (elective time is plentiful and very flexible according to residents). PD is super kind and can tell he really cares about his residents. Residents seem to really get along with each other. Not to compare but genuinely enjoyed this interview WAY more than Cleveland Clinic",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "Taste of Cleveland Box - Cleveland Coffee Co. Beans, Fun UH Socks, CWRU Coffee Mug, Malley's Chocolate Bar, and UH Pen",
    "timeGiftReceived": "Post-Interview"
  },
  {
    "nrmpProgramCode": "1547140C0",
    "positives": "Great cardiology exposure",
    "negatives": "No food allowance"
  },
  {
    "nrmpProgramCode": "1968140C0",
    "positives": "Interviewers were nice. No 24 hour shifts in all of residency. Lack of procedures is being worked on. New PD is incredibly nice, humble, and genuinely wants to improve the programs. They've seen many of the past complains ie training of the residents and procedures and have taken great strides to allieviate them. Thoroughly read my application and asked very deep questions about my app and me. +1 Was a bit apprehensive based on all the negative things said about the program but overall, I came out of the interview day way more impressed. The PD seems enthusiatic and willing to bring major changes to the program in positive ways. It seems a bit of a workhorse program but also a good place to see a diversity of pathologies. On ICU as a intern, you are by yourself with a fellow so it sounds like if you show initiative, you could get plenty of hands-on and procedural experience. One of the residents also reported that parking is about $50/month and average food stipend is about $500-600 every 6 months based on your call schedule which doesn't sound bad considering the low COL in Cleveland. // Very nice faculty and staff. Obvious success of the program. Lots of emphasis on resident education",
    "negatives": "Not much noon conference food   Zoom was recorded, and lowest energy chiefs/residents i've met, heavily lack procedure, class not close, rarely hang out  Long days and hours  Still lack procedures  Low independence  Noon conference is a 15 min walk from most rotations, need to leave duties for 30 mins at least and additional if want to buy lunch  Parking is super experience, answer from residents was \"but you're at CCF\"  Weird resident vibes, no one had read application // Resident said dont apply if you are interested in doing procedures, which another resident later softly refuted but not with much conviction   Found the standardized questions very weird, specific, and hard to answer - which was completely unnecessary because I also felt like the program would learn nothing about me as an applicant from them. And they took so long to answer that I barely got to ask any questions of my own and felt like I left the program knowing little more than I did prior to IV day. +1  not safe location"
  },
  {
    "nrmpProgramCode": "2122140C0",
    "negatives": "OMT heavy, situational question focus+1; PD flat out told me that they have \"the best curriculum in Columbus\" and talked very poorly about the other affiliated hospitals (i.e. Riverside). Didn't seem like interviers read my application. Only got asked behavioral questions, which were the exact same for each interview.",
    "howInterviewDayAffectsRank": "LOWER",
    "comments": "LOL at calling Riverside inferior training."
  },
  {
    "nrmpProgramCode": "1576140C0",
    "positives": "Free breakfast/lunch inlcuding weekends, strong comaraderie, PD is really invested in resident success. Salary almost $65,000 intern year.",
    "negatives": "Only cards + hem/onc in-house fellowship   Pray with patients? Lots of docs do this.   Virtual applicants projected on large wall with other in-person applicants. Clinic 10-15 minute drive. Mildl disorganization",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "1576140C1",
    "positives": "resdients seemed normal, and nice minus being a little bit weird OMT people. high salary.   Residents happy and program is well balanced. Osteo Rec. Residents seem appreciated. LOTS of prodecures.",
    "negatives": "OMT emphasis including questions about how you will incorporate it (ITS a Osteo Rec Program-what did you expect??)",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "2203140C0",
    "positives": "very honest and kind-hearted APD and PD. They really do the most for their residents. They're a new program, so they're trying really hard to make it the best for their residents",
    "negatives": "location  they're a newer program",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1566140C0",
    "positives": "Residents are so nice, easy to talk to, seem like they all are friends",
    "negatives": "Anyone else feel PD IV was uncomfortable? Not conversational, just very behavioral question oriented. Did not seem to enjoy interviewing me +1 > yes PD interview was awkward which was a turn off because I loved all my other IVs > Yeah I was so sad bc the other IVs were some of my most favorite but the PD one was my least fav IV experience of the season. Looks like spreadsheet from 2 years ago had some ppl w/ similar experiences > APD/PD of PCP track was extremely rude during my IV lol",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1567140C0",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1584140C0",
    "positives": "really friendly interviewers and residents, family like feel, not too bad of a fellowship match rate",
    "negatives": "in the middle of nowhere, residents definitly do no like the city"
  },
  {
    "nrmpProgramCode": "1541140C0",
    "negatives": "Summa was purchased by VC General Catalyst and is going to become a for-profit hospital: https://www.statnews.com/2024/01/17/general-catalyst-buy-summa-health/"
  },
  {
    "nrmpProgramCode": "1550140C0",
    "positives": "someone?",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "2308140C0",
    "positives": "nice schedule (4+1) and no 24 hr call. Relatively close to major city (Pittsburgh) w/ cheap cost of living",
    "negatives": "Newer program. Very strange interaction with one of the interviewers.> CAN YOU SHARE MORE DETAIL ABOUT IV QUESTIONS THANKS"
  },
  {
    "nrmpProgramCode": "1548140C0",
    "positives": "Residents were all very nice and evidence of strong culture. Very conversational interview. Dr. Warm (PD) has been there for decades and really cares about this program and how to be better. >>> Residents seemed they're friends with each other and had a good, positive vibe >>> PD is invested in residents. Had well read my PS. Academics/didactics at program very strong. Safety net hospital and the only academic center in the region. Decent felloship matches. Solid Upper Mid Tier Program.>>>Residents work hard but get along well, not a cut throat environent, def not toxic.",
    "negatives": "PD & program as a whole seem more interested in medical education and showing off long block or their newest ways to give feedback or deliver content than they do in taking care of patients. if that's your thing (med-ed) then an awesome place for you but felt like patient care is an afterthought here <<<Any data to back this up, or is this just your biased opinion >>> OP here, clearly an opinion and I never claimed it to be fact so why the accusatory tone?? Deliberately used words like \"seem\" or \"felt\" in a tab called \"IV IMPRESSIONS\". If you want facts then look at their more than sufficient website? // Also felt this way after my interview - PD seems to treat residents like his guinea pigs for his MedEd research projects getting hundreds of data points to pump out MedEd publications. Big Turn off for me. They also really push \"patient centered rounds\" which are honestly a waste of time because can you really imagine speaking medical jargon and getting interrupted by the patient constantly? Not efficient at all. Go see the patient after you discuss a plan. <-just wanted to say that as an M3 on IM, none of my teams did patient centered rounds. The attendings always deferred to the seniors resident's rounding preference. <<as a current resident, I can honestly say that I've never met a group of people who care more for their patients in a safety net hospital dedicated to serving our community. Patient-centered rounds often are emphasized, but they emphasize not using medical jargon to engage in shared decision-making with patients. The understanding is that attendings, seniors, and interns have all pre-charted and don't need the intern or med student to list off data or medical jargon, but rather its about interpreting information together and collaborating with patients moving forward. >>> The pay isn't great, not the best benefits, no food stipend",
    "howInterviewDayAffectsRank": "MUCH_LOWER"
  },
  {
    "nrmpProgramCode": "1579140C0",
    "positives": "Great program coordinator, nice residents with good collegiality."
  },
  {
    "nrmpProgramCode": "2189140C0",
    "negatives": "seems very bro culture",
    "howInterviewDayAffectsRank": "LOWER",
    "comments": "Anyone know how the mostly male dynamic affects the culture? 100% interns...seems bad"
  },
  {
    "nrmpProgramCode": "2011140C0",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "2162140C0",
    "positives": "Crazy good vibes. PD is very chill and loves to converse. Residents appear to be very happy.",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "sticker, Tulsa magazine, rice krispie treat, coaster"
  },
  {
    "nrmpProgramCode": "1588140C0",
    "positives": "Honestly very solid experience. PD was welcoming and actually put effort in recruiting us. Residents were very kind and extremely transparent. Have made big changes based on resident feedback recently that has improved QoL greatly"
  },
  {
    "nrmpProgramCode": "1594140C0",
    "positives": "seemed like great vibes among the residents, really strong ICU training, SUCH nice faculty and PD so coversation and felt like we realyl got along and wanted to know me +1 Extremily genuine residents, faculty and PD who made me feel welcome and took the time to review my application; 2+2 schedule with a heavy focus on wellness",
    "negatives": "weird merger thing happening, outside of critical care and geriatrics not mayn fellowship prospects (Were honest about that),",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "nothing     hand written card"
  },
  {
    "nrmpProgramCode": "1599140C0",
    "positives": "Probably the best vibes from the residents on my interview trail. Everyone seemed super nice and supportive. Lots of outdoor stuff in Portland. Views everywhere.",
    "negatives": "expensive parking, conditional food money  sounds like there's some big change upcoming but unclear what it is    why you would have such a long interview day with a significant portion of it being \"break time\" is beyond me.... feels like they don't respect my time +2    Though I love serving the underserved community, OHSU seems to serve a high number of the homeless community and while can be meaningful, I feel I would get burned out and discouraged by the patient population. OHSU has a mission to \"do more than to just be a doctor,\" which may or may not resonate with certain applicants.",
    "howInterviewDayAffectsRank": "LOWER",
    "comments": "new curiculum for residents starting during 2026 (our PGY3)"
  },
  {
    "nrmpProgramCode": "1599140C1",
    "negatives": "Very new program",
    "howInterviewDayAffectsRank": "LOWER",
    "comments": "Big social justice emphasis. I could see that being a pro or con depending on the person +1"
  },
  {
    "nrmpProgramCode": "1827140C1",
    "positives": "Residents seem to genuinely like each other; PD seems like a genuinely nice guy",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "1827140C0",
    "positives": "program emphasis on wellness, lots of opportunities to do procedures if that's what you're interested in",
    "negatives": "the social dynamic among residents seemed gunner-y, some legit seemed insufferable +1 <yikes!    interviewers nitpicked my app, PD and faculty all seem like ibrarians, longest and most boring interview I've had by far, considering DNRing +1 <LMAO librarians, it's true though.",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "1715140C0",
    "positives": "Yeeeeehaw",
    "negatives": "...yeehawwww",
    "howInterviewDayAffectsRank": "LOWER",
    "comments": "lmao +1"
  },
  {
    "nrmpProgramCode": "1600140C0",
    "positives": "One of the best programs so far. The residents looks genuinely happy. The program cares alot about the program and residents. Has linkage fellowship spots in cards and PCCM at Jefferson",
    "negatives": "Weird vibes among residents, seems like they dont really get along.",
    "howInterviewDayAffectsRank": "LOWER",
    "comments": "I don't get the hype up for Jefferson Abington. They are mediocre at best, like any other community hospitals that jefferson acquired."
  },
  {
    "nrmpProgramCode": "1631140C0",
    "positives": "Great fellowship match rate to incredible program + oppurtunity to work with underserved by circumstance not by choice. That's literally it. Information is availible, but it is so much nonsensical stuff if I am being honest.      6+2 schedule. The APD in charge of the urban health track seemed very cool.",
    "negatives": "You work hard and I'm sure you learn a lot but heard the environment was toxic and residents were very miserable. But this is all word of mouth. EMR is cerner. PD seems condescending, bad vibe.    Adding to the above response, \"Hollup, let him cook\". Their interview day is 7 hours long. The PD talks for around 3 hours straight and is evaise on even of the most basic softball questions. They only have 3 USMDs in a state that is chock full of them that should be wanting to do IM. That in itself should be a red flag. This interview felt like SI in a nutshell. The merger makes me believe they are going to be lower on the totem poll. The residents seem sweet, but also appear to have a gun to their head. The only thing they talk about are their stats and results (like dude who doesn't have a 98%+ board pass rate???) but neglect the process, which is code for \"hey your life is going to be hell for three years straight but ATLEAST YOU GET A FELLOWSHIP SPOT\". The fact that most people leave for fellowhsip should also clue you in on how malignant the environment is. PD mocked people for asking about perks. Doesn't seem to me much of an emphasis on wellness, which is especially bad because you can't live within 10 minutes of the place by car because it is apparently \"unsafe\".       The way the PD interacted with applicants threw me off tbh. I couldn't understand if that's his sense of humor, I feel like I wouldn't feel comfortable discussing with him my concerns or my career path. The interview day was by far the longest I had and I was very tired in the end.",
    "howInterviewDayAffectsRank": "LOWER",
    "comments": "recently acquired by Jefferson"
  },
  {
    "nrmpProgramCode": "2206140C0",
    "negatives": "65% Board pass rate <-- DAAAM"
  },
  {
    "nrmpProgramCode": "1648140C0",
    "positives": "nice people",
    "gift": "$5 starbucks",
    "timeGiftReceived": "before IV"
  },
  {
    "nrmpProgramCode": "3185140C0",
    "negatives": "Run away!!!! super unprofessional, they ask you to work up a case in the IV. Interviewer had his kid crying in the background, turned off his video mid IV. 3/4 ppl got fellowship not bad but not great either.",
    "howInterviewDayAffectsRank": "LOWER",
    "comments": "was such a terrible experience , faculty member bashing my app and im wondering why did they decide to interview me , did not ask me any questions just asked em to workup a case, hopsital got a D rating for safety in October but no one addressed that and went on and on about what a great training is offered << Just FYI... I am from philly area and purposely did not apply to this program due to their poor reputation as a hospital."
  },
  {
    "nrmpProgramCode": "1608140C0",
    "positives": "Super friendly! Everyone seems happy to be there. Seems to really care about residents and their success. Not a crazy work schedule. Has a lot of fellowship opportunities within the hospital system. Decent pay and low cost of living. free parking. Meal voucher (in form of check so you can use it at teh cafeteria or grocery outside of the hospital ($1800 + $300 badge voucher). Really great fellowship match list this year. 3 GI, 2 cards, along with other specialties.",
    "negatives": "Current residents implied that the program is trying to \"downsize\" the Danville hospital and will be moving many fellowships and departments to the new Geisinger Wilkes-Barre hospital over the next few years, meaning there will be fewer opportunities. < << don't know where this rumor came from? GME is supportive of growth on all campuses. Danville is the main hub and will remain the mothership, it's continuing to grow with a new critical care building and new outpatient clinics. If anything there is an attempt to add more fellowship to extensive list which already exists. < Agree with that. Geisinger Wilkes Barre is very separate. They're starting up new fellowships - GI and cardio are both less than 3 years old  nothing to do, location not great",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1608140C1",
    "positives": "Very friendly interview, only standard question was why I wanted to go there, otherwise chill discussions. Fellowship opportunities growing fast.",
    "negatives": "One interview was awkward and didn't even ask questions, apparently intern cap is 10 patients<<this is the ACGME intern cap and it's common across many programs<<all others I've interviewed at were 8",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "2103140C0",
    "negatives": "Two interview sessions with residents... It was awkwared and they didn't seem to know what to ask etc...",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1601140C0",
    "positives": "Everyone was friendly. Residents seems happy. Great program if fellowship is the goal. A lot of applicants match into fellowship but it's exclusively to LVHN or St Lukes. Lots of DO fellowship opportunities for GI/Cards/Heme Onc. Highest volume for STEMI in PA very strong in cardiology. If you are ranking and planning on fellowship I would expect to stay at LVHN for full 6 years not sure how often people match to programs outside the area but it seemed like most residents stay in house",
    "negatives": "Awkward interview with one of the faculty / Was asked for clinical implications in some research I did. Good question but was not expecting that and had not looked at my own CV in a hot minute.<<upset someone asked them questions about something on their CV? Huh?>> Yeah, this sounds like a negative for you, not the program. << One faculty interview was great and the other one was... eh. They kept going off topic and wouldn't let me talk.",
    "gift": "Nothing",
    "comments": "They are planning on merging with Jefferson and personally, i dont know how this would affect the program and it's reputation."
  },
  {
    "nrmpProgramCode": "1632140C0",
    "positives": "some in-house fellowships. in a more well-off area of Philly. higher salary compared to nearby residencies.",
    "negatives": "Has 28-hour call for ICU and floors, which residents claimed was \"not bad at all\" but were clearly lying +2 apparently they brought this up to the program leadership but not sure if they are going to do anything about it / one of my interviewers was very very condescending worst interview i've had so far/ my interviewer came late and left early, was only in interview for 10 of the 20 mins. Did not seem to be paying attention / .... Didn't give me an interview. Rude.",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "Nothing",
    "comments": "aka Main Line"
  },
  {
    "nrmpProgramCode": "1636140C0",
    "positives": "Community program but everyone is very kind, experienced, and intelligent. You might feel out of place with the residents as a US grad as almost 90% of all residents are IMG from South Asia but great community for learning and forming connections overall.",
    "negatives": "Hospital building isn't the best, cafeteria not super great. Lots of bread and butter cases but uncertain about having more complex cases. << Personally, I felt that during the talk with the residents, they weren't as nice and friendly (could have been just my experience). Also, when one of us asked why they chose to apply to this program and one resident said \"it was the most IMG friendly\"...",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1932140C0",
    "comments": "cool name for a hospital. sounds like something the goth girl from teen titans would say"
  },
  {
    "nrmpProgramCode": "1617140C0",
    "positives": "PD is great! The chief resident who interviewed me was very nice and friendly. Thoroughly reviewed my application and asked deep questions about my app and me. Great APD vibes as well.   Chief residents seemed to get along well. Nice friendly culture. // PD is so kind and young and fun. big emphasis on mentorship and wellness.",
    "negatives": "Location <-- VERY BIG NEGATIVE <- Why? Cost of living is higher than most of PA but not terrible. You're near Harrisburg which is a small city. // Everyone was very nice but it did seem like they were trying to \"sell\" me the program a bit. instead of a conversation to see if we would be a good fit interviewer was trying to relate back my resume to what the program could offer which is great but I wasn't a fan with how it felt like how hard they were trying to convince me to go there ...For the person that said location is very big negative, only if you want a big city. Went to med school here and central PA/hershey/lancaster is a gem if you're okay with a more suburban and rural setting, theres still plenty to do. <<hard disagree. nothing at all to do in hershey. lancaster is boring too",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "$35 doordash. ; I didn't get the door dash but got a nice gift afterwards with a water bottle, penn (lol), hersheys bar (ofc) and pamphlets + personalized TY note from PD",
    "timeGiftReceived": "before IV; gift package after IV"
  },
  {
    "nrmpProgramCode": "2158140C1",
    "positives": "eh it gets the job done",
    "negatives": "Multiple hospitals, might have difficulty finding electives. I was told OMM emphasis in curriculum (immediate decrease)",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1664140C0",
    "positives": "Low COL area, in house fellowships, good salary, lots of subspecialty exposure",
    "negatives": "residents are over worked, rural area, not well known",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "1630140C0",
    "positives": "The \"baby chiefs\" were very funny and personable. It is cool that they will be the ones that will be your chiefs if you match. Program seemed strong. Philly is a fantastic city, lower CoL. Their 4+2 schedule seems ideal, PD placed huge emphasis on QoL. PD is very nice and funny. New POCUS curriculum, multiple different tracks/career pathways to participate in. 403b retirement matching. Large teaching and referral hospital. Tution reimbursement for additional degrees through Jeff.",
    "negatives": "Q4 24 ICU call but has gotten better? ; not as great POCUS training in curriculum, have to cover full 12 patient list on senior's day off. Hospital parking costs $400/month (however it sounds like most residents live close enough to walk/bike). Like mentioned above, q4 24 hour call in MICU, but recently reduced from 28hr call, but also get post-post call day off as well (internal polling by the program shows residents like the schedule so they have kept it for now). 10 patient cap as intern, can have up to 8 admits per team per day....Apparently only get post-post call day off if it's Thursday-Sunday on 24 hour ICU shift.",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "Handwritten post card",
    "timeGiftReceived": "After interview"
  },
  {
    "nrmpProgramCode": "1605140C0",
    "positives": "Super fun interviews. Great vibes and emphasis on teaching. A lot of inhouse fellowship opportunity. Trauma level 1",
    "negatives": "interviewer had unprofessional dress and unstable wi-fi, chewing gum during interview. Unorganized interview with residents, could not ask any questions due to residents constantly kicking each other off call",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "2176140C0",
    "positives": "Everyone is incredibly nice and supportive. Lots of in-house fellowships. Everyone is very receptive to resident needs and feedback",
    "negatives": "new program but few have matched cards etc into St Luke's main  Was pimped during my interview << about what if you don't mind?? << couple of medical knowledge questions that you would know after prepping for step 1/step2 (side effects etc.), either way I was still blindsided lol",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "$20 grubhub"
  },
  {
    "nrmpProgramCode": "2139140C0",
    "positives": "Everyone seems to be happy. PD, aPD and cheif residents were fun and easy to get along. No traffic",
    "negatives": "low pay, meal stipend included in salary. Smaller hospital. <<SUPER LOW PAY (in the upper 50k) compared to other residency programs in the area (and meal stipend is included in the pay). Small hospital, lots of transfering patients out to other hospitals. Apparently it is known as \"a hospital patients don't want to go to (said by a patient)...",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "$10 cafeteria money",
    "comments": "belos 60k salary should be illegal"
  },
  {
    "nrmpProgramCode": "1970140C0",
    "negatives": "PD was a little unprofessional. I interviewed for prelim and he talked down on my specialty and poked holes at my future aspirations. He's a very smart and funny guy but it was a bit unnecessary especially for a prelim interview. Hospital is not doing well financially and does not have good reputation in the area.",
    "howInterviewDayAffectsRank": "LOWER",
    "comments": "Not sure how this hospital is still surviving"
  },
  {
    "nrmpProgramCode": "1646140C0",
    "positives": "PD seems nice and very supportive of residents. Residents seem like a close group. \"6+2\" curriculum, the 6 weeks are made up of roughly three 2 week rotations (can include wards, ICU, electives or vacation). Clinical training is rigorous given very sick and underserved patient population (basically Philly's saftey net hospital). Free parking at the hospital. 100% fellowship match rate last year (although it does seem like some residents work as hospitalists for a year or two and then apply to fellowship). No 24 hour call. Expanding POCUS curriculum, just added POCUS fellowship at temple >>>>>>>>> The residents really get along (Did an away) and you could see that during interview day. Although interview day felt chaotic, their moonlighting money is fantastic 150-300/hr. Fellowship match is very strong. US elective very strong I learned a ton from their residents. Overall interview day impression was a group of close -knit (in spite of large program size) residents who are very honest. If I go here I know exactly what I will be getting into, which makes the negatives seem substantially more bearable",
    "negatives": "Location, most residents live ~15-30 min away. No residents live near the hospital for safety reasons (but feel comfortable going to and from train station as there are many hospital employees) No VA hospital rotations. Has a reputation as a workhorse program and residents work a lot. Clinic understaffed. Attending supervision is there but vibe from the interview was that theere was less than at other programs. Got a lot of behavioral type questions - like after the third difficult scenario you ask for do you want me to make something up? Less conversational than my other interviews which was surprising as the rest of the interview day everyone was super friendly >>>>>board pass rate has dropped over the last several years to the 80s, unclear why but its probably the lowest among the big philly programs. program is trying to address this with more dedicated board review time. They had a great interview presentation but not sure if they were over selling the program on wellness/career choices. >> few of the residents I know complained about long hours and working a lot more than neighboring academic programs. When it comes to work-balance, it's a little hard.",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing",
    "comments": "More impressed than I thought as well +!"
  },
  {
    "nrmpProgramCode": "1661140C0",
    "positives": "PD very kind/personable. Good work/life balance. Hospital looks ridiculously nice (check out youtube video). Have a lot of inhouse fellowship.",
    "negatives": "Fellowships matches are not strong in all specialties. Automatic OMM focused for DOs... not attractive for me  <<Canceled my interview because of the forced OMM exposure",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "2290140C0",
    "positives": "New program - we'll be the second class, so there will be no third years and we work mostly directly with the attendings. Nice PD/faculty. Close-ish to Philadelphia. On the border between suburbs and farm country so diverse population. Good food apparently? Major teaching site for Drexel, 1 third-year and 1 sub-I on every team.",
    "negatives": "No fellowship. No in-house radiology, uses UPenn for radiology. Continuity clinic 20 min away by car. Multiple people mentioned high cost of living. It is a much smaller sister hospital of tower health main campus.",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1628140C0",
    "positives": "Philly is a good lifestyle city, just unionized and the PD described it as a positive, increasing elective time, lots of opportunities with Penn main campus due to proximity",
    "negatives": "Ridiculously paltry benefits compared to peer institutions, still have 24s and you stay till 11am for rounds, will be guinea pigs for new PD, unlikely to benefit from the union as an intern since negotiations will take a while, interview day was painfully long//if you're into heme/onc, they're getting rid of their solid onc rotation",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "$25 doordash",
    "timeGiftReceived": "only used during day of interview//actually from day of social through day of interview"
  },
  {
    "nrmpProgramCode": "1652140C0",
    "positives": "Resident lead rounds result in a super autonomous environment, and residents feel super capable at the end of training. Thought residents seemed like gr8 friends, and everyone was suiper awesome! Must depend on the day you interview.    PD seems really friendly and approachable. Residents haven't noticed any major diffs with the new PD. Going to have their 1st woman Chair of Med starting in Mar 2024 (coming from Johns Hopkins). Residents were all very friendly and honest. Faculty knew my app well. Emphasis on DEI, advocacy, med education. Good benefits. Free parking, lots of free food.",
    "negatives": "Still on 28-hr call, many residents with 8-9 weeks of continuous inpatient despite 4+4 sched, higher jeopardy weeks during PGY2 impacting elective time, lots of dept changes with new PD, incoming chair, and talks of new EMR. Resident class large, limited camaraderie. Inpatient teams capped, 7am to 6-7pm schedule 6 days/week, limited procedure opportunities. Awkward resident dynamic, interviewer didn't introduce themselves, made awkward remarks throughout. Agreed with all, misled about 4+4 with +Y being inpatient consult services instead of protected ambulatory blocks. Weekends in +Y not always protected if on nights/geri/EM, misleading. Resident social vibes off, didn't know each other well. One applicant asked for one-word program description, one resident responded \"rigorous\" lol. PD believes 28-hr calls are \"educational\" and \"justified\" despite resident disagreement. Interviewer just asked my questions, didn't know my app. No enthusiasm, heavy ICU focus. Super disappointed, imagined it high on my list, currently at the bottom. Only 5 28-hr calls/year.",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "$15 Grubhub gift card",
    "timeGiftReceived": "Sent ~3 days before interview",
    "comments": "This is actually wild and disappointing to see as someone with an upcoming interview lol    Overall I had a very positive impression    Surprised to see the negativity.. I enjoyed my interview and most residents were extremely friendly and outgoing. They also commented on the 4+4 schedule being the best for QoL with the back to back inpatient rotations being extremely few and fare between. They also said they rarely have 28 hour shifts only when transitioning from days-nights and vice versa... not like its a Q4 call or something for a full rotation"
  },
  {
    "nrmpProgramCode": "1615140C0",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "2173140C0",
    "positives": "Everyone was really nice, small program, residents are close",
    "negatives": "3 away rotations that are up to 1.5-2hrs away. Program puts you up in housing. PC wanted to emphasize that you needed to be a \"self-learning\" if you were planning to be there.   Traditional schedule w/ 1 day a week in continuity clinic",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "1620140C0",
    "positives": "Seems like the resident classes are super close, honest about wantnig to make PCP/hospitalists. Lots of their staff come back to work there.",
    "negatives": "Hard to do bench research. Limited fellowship - alligns with their goals"
  },
  {
    "nrmpProgramCode": "1649140C0",
    "positives": "New PD - new changes liek moved to 4+1 and the resdients seem to love her.",
    "negatives": "Odd vibe between the new PD and some of the other core faculty - told me other faculty don't like the changes she might make and the people she might recruit to the program? really weird +1 Also not sure how easy it is to get research here, seems like you have to really network to find opportunities",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "1674140C0",
    "positives": "Residents sold the program, they were super nice & friendly with each other. Faculty seemed really nice as well.",
    "negatives": "None, I really liked this program. << As a person interested in fellowship, not great fellowship match or opportunity (other than cardio and maybe cc). It's a smaller program, which means you work more. Residents mentioned that their hours are long and they work a lot but still enjoy it. They kept trying to sell the location as being close to a lot of cities but as a person from neighboring area, it is NOT that close to Philly (>2hrs), it is NOT that close to NYC (>3hrs) and it is somewhat close to baltimore (1-1.5hrs). Not as important but for some decent shoppingm, they suggested going to a mall that is more than 1.5hrs away",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "1677140C0",
    "positives": "PD and residents seem very nice and welcoming. No 24 hr call, free hospital parking.   Both interviewers were great, it was clear they read my application. Many opportunities for moonlighting (RIH, Miriam, VA)",
    "negatives": "Traditional schedule has its pros and cons << more cons than pros in my opinion. They talk a lot about how they like the traditional scheudle but every year they are \"reconsidering\" a switch to X+Y -> they actually are switching to an X+Y the following year (<< this is not confirmed). MICU schedule does not seem good (5.5 days, one off, 3 nights, 3 off). They only do kidney transplants at RIH, no liver or heart.",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "2270140C0",
    "positives": "Residents seemed happy and was super nice. They made side comments with eachother but wasn't overbearing and tried to include us in the conversation. Program really sells you that they are an amazing program. Decent board pass rate and match, althought not everyone matched this year.",
    "negatives": "PD was trying to be really funny but was kind of intimidating at the same time. Rotate at Kent and VA",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "Lemonade pouch and a folder about the program",
    "timeGiftReceived": "few days after"
  },
  {
    "nrmpProgramCode": "2307140C0",
    "positives": "Amazing PD! Excellent vibes, super invested in education",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1680140C0",
    "positives": "Residents seemed super happy with the program, PD and Chair seemed invested in education - lots of benefits including free hospital athletic center in hospital complex",
    "negatives": "Some workhorse vibes from the residents +1 Lack of diversity in class +2 They do have 24 (28 really, you have to stay for rounds) call",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1683140C0",
    "positives": "residents and faculty seemed to be very happy and a lot stay to work after residency or do fellowships there, honestly was very impressed with this program and didn't think i would rank them very high plusss Chick Fil A in the hospital what more could you want. Really nice interviewers and residents were super friendly. Family friendly vibes in a decent location, was very surprised by my interview and it went up my rank list significantly.",
    "negatives": "lower end of pay with higher cost of living",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "Mini popcorn mix, coffee mix, chapstick, folder about the program",
    "timeGiftReceived": "about 2-3 weeks after interview"
  },
  {
    "nrmpProgramCode": "2805140C0",
    "positives": "PD is very nice and interested in people who show a prefernce for remianing in south dakota even for felllowship, residents seemd friendly and overall good vibes",
    "gift": "card and starbucks gift card"
  },
  {
    "nrmpProgramCode": "2252140C0",
    "positives": "HQ of HCA, massive hospital, GME space is huge like 60000 sqft, theyve spent tons of money on GME to the point where residents have ultrawide monitors etc.",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1844140C0",
    "positives": "The PD is amazing. She hypes you up and makes you feel so supported and special. The residents seem to get along well and are eager to support each other. The program really emphasizes family. The 3+1 schedule gives a lot of room for work life balance.",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "Nothing",
    "timeGiftReceived": "BBQ seasoning in mail, hand-written letter"
  },
  {
    "nrmpProgramCode": "1699140C0",
    "positives": "Really great interview overall with personable staff and residents. PD starting her first year in June but has been on staff as APD for years. Very kind and seems open to a lot of feedback. Discussed wanting to incorporate AI dictation to reduce note-taking time and shift to patient encounters.",
    "negatives": "Not a large program but that's personal. Also only one fellowship is available (Cards) but residents seem prepared to match in fellowships elsewhere, 24 hr call as upper",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1702140C0",
    "positives": "Impressive swag box. +2 <<sounds like it was a real \"box office hit\"! 🤣  Residents seemed happy, PD was kind, interviewer + PD were very familiar with my application and the PD suggested specific customizations to the curriculum I might take advantage of given the interests in my app. I did not specifically ask about duty hours, but an intern stated they worked as much as they \"expected to\" in residency. PD mentioned they are increasing class size which might \"decompress\" resident teams.",
    "negatives": "residents mentioned going over duty hours +1 definitely a workhorse program and residents seem tired; more than one resident voiced that residents at vandy work more hours than peers at similar tier programs (+1). I don't understand the purpose of extensive admitting days when there are so many residents in the program. tru",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "box of goodies- coffee/cookies/note (Categorical); Nashville Scene Magazine + Vandy Notebook (PSTP)",
    "timeGiftReceived": "Sent all at once (categorical; Week before interview (PSTP)"
  },
  {
    "nrmpProgramCode": "2312140C0",
    "positives": "!",
    "negatives": "Odd structure on interview day, scheduled from 8-12 but there was no powerpoint or resident Q&A till the very end. Interview was only 2 x 20minutes but could be at different slots. So you are sitting and waiting the rest of the 3 hours. Resident did not seem happy. Interviewers were rude, coordinator super nice, resident pretending to be happy. No PD/APD IV, confused faculty giving diff answers, unprofessional 2 I had a somewhat strange interview day as well. One of the interviewers seemed like he disliked me from the get go and did not return the greeting even though that's kind of basic, so a bit unprofessional. Kind of felt the interview was passive aggressive, asked me about 3 times the same questions about why I had chosen to apply even though I'm from TX as well. In general, not my favorite.",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1716140C0",
    "positives": "Relatively short low stress interview day. Eliminated 24 hour call recently and seem to be moving toward more balanced schedule. Training seems strong and diverse. Good fellowship match prospects. Also reduced the number of wards months intern year.. +1",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "2259140C0",
    "positives": "Very quick interview day. Starts with a short video then interviews begins. PD is friendly and residents seem really happy and enjoy program benefits <<<wait did you meet the PD? I did not meet her (neither in the interview nor duirng the social) - also does not reply to emails directly and instead forwards to PC",
    "negatives": "Some of the questions were very weird behavioral questions and the interviewers seemed to lack any emotion when conversing. +6 <weird behavioural questions +7<<<<DId not directly answer my question on their probationary status - was just beating around the bush!",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1706140C0",
    "positives": "Small program, strong community and mentorship. Good benefits for the residents. Residents all seem very happy, scored highest possible on AMA wellness survey. Strong fellowship matches! Happy residents, community program . Free food everywhere & parking",
    "negatives": "Traditional schedule. A lot of teaching scheduled for during morning rounds time. Less research opportunities",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "2116140C0",
    "positives": "Residents seem very happy and genuinely enjoy the program, program really values wellness so many activities, PD is a gem, small town with greenery and lakes",
    "negatives": "Panel interview was awkward they just went off a list and asked questions no conversation no emotions or response to my answers a bit weird tbh. <- might have been an off day because the resident panel I had was great, they answered questions for 3 hours straight. >>they are talking about the actual interview panel not the resident evening. I agree the panel interview was terrible , they just fired one behavioral Q after another and sat there expressionless after and made the IV really tense.",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "2244140C0",
    "negatives": "No PSLF"
  },
  {
    "nrmpProgramCode": "2110140C0",
    "positives": "Program values resident feedback and creating a close/family type culture. The PD is very friendly and passionate about her work in the community and with the residents. One resident mentioned that the residents are very close to one another and hang out every week, workload is regulated by program. City close to the bay with a lot of sun most of the year.",
    "negatives": "Program still integrating POCUS and rennovating for a new sim lab. Some interviewers did not seem so interested in the conversation (one looked like they were in a rush and wanted to leave, another droned on about their opinions). This is the only residency program in the city and work with a free clinic, so you will see the sickest patients in high volumes",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "2211140C1",
    "negatives": "APD looked very disinterested/awkward from the beginning+1 heyy could u please share ur iv experience I have an iv coming up there - plzzzz it's only my 2nd iv -> when was your interview?"
  },
  {
    "nrmpProgramCode": "2211140C0",
    "positives": "in-house fellowships, access to HCA network fellowships PD was welcoming, residents seems close and nice but the resident panel was awkward",
    "negatives": "Interviewer was in a rush to leave, PD was great though."
  },
  {
    "nrmpProgramCode": "2188140C0",
    "positives": "very supportivr group there, interview was with PD, recent graduate faculty from same program, and head of the hospotalist group.discussed the dispariteie in the area and ways of getting more community outreasch",
    "negatives": "Fellowship was nephrology favored, tough fwllowship. match rate, manly hospiatlist route. was told by one interviewer the medicine there is 10 years behind schedue and struggglig to keep up to current standards. PD interim role,",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "2244140C1",
    "negatives": "Absolutely odd interview. 2 interview sessions that were very quick (no schedule beforehand so you don't know when your session is), yet you stayed on the call for 2 hours to ask a resident whatever Q&A. If you didn't care about the interview answers then why interview at all.",
    "howInterviewDayAffectsRank": "MUCH_LOWER"
  },
  {
    "nrmpProgramCode": "1707140C0",
    "positives": "residents seem happy, attendings nice, PD really cares about residents, catered lunch everyday, residents didn't look overworked, diverse patient population and pathology, many residents live within a close distance of the hospital, PD goes out of way to create customized electives for residents: one mentioned they were interested at hospital admin in one point so they helped create an elective for them working with the admin",
    "negatives": "not sure why someone deleted but the residents had a lot of negative things to say about their hot mess, outdated, raggedy-ass resident workroom. but its getting rennovated so shouldnt be an issue like a year from now",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "$20 grubhub"
  },
  {
    "nrmpProgramCode": "1167140C0",
    "positives": "Great schedule, residents seem to be happy and friends with each other, very chill and laid back iv day, HMH is a nationally ranked hospital and there is opportunity for connections/mentorship with great physicians. Plenty of in house fellowships - good for cards/pccm, only rotate through 1 hospital (no VA or navigating other hospital systems), random bonuses",
    "negatives": "Still do have a 24-hour shift in the ICU, only once a week as an intern but ramps up PGY2/3, some fellowships don't seem to \"take their own\" (which is a bit sus) <- not sure? Seems their overall fellowship match is good. I was excited to IV here, but IVs felt a bit rushed, like they were just trying to get out, didn't care to get to know me, so I'm kinda bummed now +1. During the interview, the PD also mentioned a few times that they have high standards as a nationally ranked hospital and kept bringing that up, how it's a tough program. >> Same with my IV; PD made it known she wants applicants who are mighty competitive. >> SAME!! Made me really question why I was selected for an IV to be honest +3. A friend of mine interviewed here with the PD and loved her, had a very good experience, but she is AOA, 26x, GHHS—maybe that's who she's trying to recruit, but my friend's ranking them pretty low, so there's that.",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1167140C1",
    "comments": "Anyone please? +1 <<< sorry, they chose not to interview me <<<+1 they didnt interview me either <<<+1 they didnt interview me either but hey at least they have standards"
  },
  {
    "nrmpProgramCode": "1725140C0",
    "positives": "Loved my IV, asked mostly about my app, career plans, dad joke session at the end a bit cringy but nice to see a group of PDs not take themselves too seriously.",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "2279140C1",
    "positives": "Great Parking and unlimited food. THR has a great rep with the other two THR IM programs. Work-Life Balance important.",
    "negatives": "New program, 100% IMG.",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "2279140C3",
    "positives": "Friendly program. Very small program, but offers great support. Good relationship with Southwestern. Located in Dallas, great city good cost of living compared to other major US cities.",
    "negatives": "Not x+y schedule. No in house fellowship."
  },
  {
    "nrmpProgramCode": "2279140C0",
    "positives": "Very friendly IVs, they seem to value wellness by emphasizing more golden weekend for residents. X+Y schedule, no 24 hr call, unlimited food and free parking.",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "2279140C2",
    "positives": "free food",
    "negatives": "No away rotations, a new program that doesn't have any residents at the moment.",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "2993140C0",
    "positives": "Great ICU rotation and procedural exposure, more attention to residents due to lack of fellows small town big city feels, residents seem friendly with each other. - Faculty seemed friendly. They were very straightforward about people either loving or hating Amarillo. PC heavily emphasized this point.",
    "negatives": "Traditional system. No in house fellowships, difficult for those who going into Cardio and Gi due to lack of faculty. Amarilllo is a smaller city, not suitable to those seeking a fast paced city life. - Very open about there no being many activities to do around the area which is fine if you're a homebody, but if you're not, then it might be boring.",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "None",
    "timeGiftReceived": "1 month in advance",
    "comments": "Wish there was more information on the website."
  },
  {
    "nrmpProgramCode": "1710140C0",
    "positives": "Friendly residents, salary and food benefits is huge for COL (e.g. 400 dollars q2w for meals). In house fellowships for GI, cards, new pulm/crit  >>>>>I really liked the interview experience here, interviews were conversational for the most part, they didn't waste time with introduction lectures and Q&A sessions (residents Q&A night before), especially bc they shared ppts with all this information via email, I appreciated that I didn't have long breaks between interviews and it flowed well. The residents seem close and friendly, hang out outside of work, intersting pathology and patient population, good in-house fellowship match rates, I believe this year they had ~6 people match cardiology and a few matched internally so good sign.",
    "negatives": "High faculty turnover, not many stay after residency  2022-2023 spreadsheet: Weird, unsettling vibes. PD kept interrupting me during my answers and so I have to keep asking him what he just said while he interrupted me. Don't think he cared what I had to say at all and just wanted to get the interview over with. Resident interviewer did not seem to react to my answers. Not conversational at all and felt like I was getting grilled with generic interview questions the whole time without attempts to make it a conversation whatsoever. Totally agree with the comments on last year's spreadsheet. I would cancel this if you have enough IIs/not desperate to be in El Paso or Texas, total waste of time    >>>> Location, El Paso is in the middle of nowhere not much to do; difficult patient population, 24 hour call in ICU and wards as PGY2+",
    "howInterviewDayAffectsRank": "LOWER",
    "comments": "Website does not show where residents went to medical school, but 99% IMGS"
  },
  {
    "nrmpProgramCode": "2973140C0",
    "positives": "Everybody is super friendly",
    "negatives": "Little opportunities for abortion care"
  },
  {
    "nrmpProgramCode": "2169140C0",
    "positives": "San Antonio is a great place to live. Lot of different pathology. New program. low COL",
    "negatives": "PD not real friendly, maybe his personality. Feels like, lots of issues need to be ironed out. In same hospital as another IM res program. Residents not real excited, felt forced to talk to us.",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1793140C0",
    "positives": "The program is making rapid changes to position itself among the other more-established schools in the state. It's got a long way to go, but overall residents and faculty at the program seem really pleased with how it's going. New hospitals are being built soon (combination of MD Anderson and UT Specialty Hospital), but will not be ready for several years. Residents seemed super chill. Got the best vibes from this cohort compared to other TX programs. Really enjoyed the happy hour, it was a trivia night and was engaging. Everyone in the program seems to enjoy it! A large part of the intern class seems interested in specializing, good match last year",
    "negatives": "Residents are employed by Ascension and the primary rotation sites are there. Procedures can be hard to get. Dispo issues lead to patients staying on list for extended periods of time and less learning opportunities per residents. IV with minimal breaks + resident social w/trivia later that night was tiring    https://www.texastribune.org/2023/06/27/texas-nurses-strike/",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing, swag for jeopardy winners"
  },
  {
    "nrmpProgramCode": "2923140C0",
    "positives": "Broad' training with county hospital (LBJ), quaternary care center (Memorial Hermann), and #1 cancer center (MD Anderson); Strong' fellowship match for a mid-tier program; Low' cost of living and pretty' left-leaning academic/urban environment; very' diverse patient population. Seems' challenging in terms of complicated' illnesses and social situations that' you treat at the county hospital, but' probably makes for great clinical training' overall. PD' is really down to earth and' care a lot about trainees and' education. Lots' of opportunities for resident-driven research' and QI initiatives.    I agree with above seems like theyre' really trying to improve their culture. +1    Super' impressed w/ interview day. Seems' like a solid option w/ good' fellowship match for a state' school. I' was concerned it was a' work horse after looking at' the sheet, but I didn't' get a lot of workhorse' vibes on interview day truthfully. Seems' like an awesome place if' you want to do cardiology or' heme/onc",
    "negatives": "Workhorse' program, research' opportunities but no time to' actually pursue <- DISAGREE +1- residents' seem very happy, chill, and' actually aren't sick of each' other because they actually hang' out outside of the program. The' social the night before literally' had all of the residents' kiki-ing at one of their houses' and just zooming in from different' rooms for the breakout sessions. They' said inpatient weeks are dependent' on the upper, but usually they' only have one intern stay' for sign-out so there are' many inpatient weeks where they' average only 60 hours; also it's' 4 + 2 + 2 (with most' of the 2 + 2 being' golden weekends) and no 24's. There's' plenty of time for research and' it's in the Texas Medical Center' so there's plenty of research' institutions outside of UTH to' choose from- including Rice &' MD Anderson. Didn't' get the best vibes from' the residents, they seemed overworked.' Research' is abundant, but got' the sense that the hospital is' always full with often patient's' who are 'rocks'. Agree' with workhorse program. Feels' like this program had a' workhorse reputation prior to Dr.' Swails (PD) and is now' working really hard ot change' that.",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1714140C0",
    "positives": "Residents seemed to get along well. PD was very nice. Supportive family-like culture. Pretty much all available fellowships.",
    "negatives": "Location. When asked about what there is to do on the island, one resident said watch netflix. another said go to the gym.",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1825140C2",
    "positives": "Program coordinator was very nice.",
    "negatives": "No powerpoint or compiled information. Walked away from interview still not entirely understanding schedule. Interviewer did not seem interested in application or know anything about invidual application - immediately went into why program, behavioral questions. Co-applicants on the call were very weird (one was un-muted the whole time and responded to everything, went on a long tangent). Current residents did not seem happy about location or program. <<< interesting current residents seemed happy during mine maybe it was an off day? but the biggest negatives for me are location, traidtional schedule seems like they almost always end up doing back to back wards months",
    "howInterviewDayAffectsRank": "LOWER"
  },
  {
    "nrmpProgramCode": "1825140C0",
    "positives": "Good experience. The residents actually looked satisfied/happy. It's a smaller program and it is on the southernmost tip of TX. However, if you dislike cold weather, this may be up your alley. Interviewers made relevant questions and I did not feel any hostility. You usually get 4 IV's 15 minutes each. It is true that you have to attend morning report before IV's start, nevertheless, the case we saw was very interesting and you get a feel for what this entails for the program. Two of my interviews were very pleasantly suprising and one interviewer in particular was very sweet/supportive/ sincere. I did enjoy speaking with all the physicians. Also, if you speak Spanish or have any medical Spanish skills, that helps out a lot.",
    "negatives": "They made us listen to morning report for an hour before interviews started. Complete waste of time, wasn't even organized well. Location is in the middle of nowhere, carries the UT name but is not really an academic program - no fellows. More of an academic-affiliated community hospital. Talking about political affiliations and Jeopardy during morning report.",
    "howInterviewDayAffectsRank": "MUCH_LOWER",
    "comments": "will rank higher"
  },
  {
    "nrmpProgramCode": "1722140C0",
    "positives": "Two main rotation sites - VA and university hospital, free parking, has almost every fellowship (except A&I), PD is nice and known for being a very \"friendly\" program, San Antonio is very affordable and a great place to live (depeding on what you want); VERY friendly residents and good support for going to conferences/time off <disagree, easier said than done according to residents applying for fellowships. Diverse patient population and lots of pathology and complex cases + complicated social situations give you a solid clinical training experience",
    "negatives": "Not research heavy, so take into consideration if going after a competitive fellowship, large program. Not as good in terms of benefits. Parking situation not the best for upper levels but new parking garage opening soon should improve that. >>Possibly an outlier experience given how friendly PD seemed and the overall friendly rep the progrqam has but had the weirdest interview where interviewer was strangely passive aggressive and rude the entire interview and seemed as though they were trying to catch me in a lie somehow.",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "3626140C0",
    "negatives": "24 hour call q4 during ICU and Cards months. Tyler isnt exactly the greatest location."
  },
  {
    "nrmpProgramCode": "2835140C0",
    "negatives": "I didn't get the feeling that my interviewers had read my application +6    seems very workhorse. Felt like this program was a trojan horse - meaning good name/reputation, but residents seemed over worked +2 strong match list, but would be concerned about duty hour violations. <<med student here and can confirm residents routinely go over and adminstration does not do much about it    PSTP: very serious time. technical questions, program organization was not the best",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "Care package with Texas snacks/treats and a mug",
    "timeGiftReceived": "Pre-interview"
  },
  {
    "nrmpProgramCode": "1732140C0",
    "positives": "Great vibe among residents, faculty were genuinely kind and interetsed in learning about me. Great skiing nearby, one intern said he went skiing 15 times intern year. Housing is not too expensive",
    "negatives": "Location, lack of diversity in pt population>>didn't really get that vibe, felt like pretty diverse training with lots of opportunities to work with underserved. Expensive parking ($800/year) - most people don't purchase parking passes.",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Postcard",
    "timeGiftReceived": "Post interview"
  },
  {
    "nrmpProgramCode": "1734140C0",
    "positives": "PD and leadership all very friendly with huge   emphasis on resident support; residents seem to   all get along very well & seem very happy; great salary and benefits (unionized);   good fellowship match; $1800 food stipend, free   parking",
    "negatives": "Housing can be difficult to find    Cold af. Not an alotted fund for research and conferences. said we can \"try\" to arrange if you have a project to be presented",
    "howInterviewDayAffectsRank": "NO_CHANGE"
  },
  {
    "nrmpProgramCode": "1748140C0",
    "positives": "Residents, faculty, PD all very friendly, seem to value resident wellness, very affordable COL",
    "negatives": "PD and faculty seemed unwelcoming to people without ties to the area, residents look like they're being forced to act happy. PD is kinda kooky, he'd say a lot of weird comments     PD vibes were really off>>right?? so weird because the residents seemed to like him >>> He seemed a little off but overall a nice guy tbh, maybe just how he comes across on zoom >> I thought it was just me!",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Local coffee, honey, chocolate, handwritten notes",
    "timeGiftReceived": "Post interview",
    "comments": "Did an away rotation here, residents & fellows were very nice, but some of the attendings were not. IM residents don't get trained in intubations, and PGY-3s are struggling to get their procedure numbers because fellows have to go first. 3rd years still not comfortable running codes & rapids."
  },
  {
    "nrmpProgramCode": "2980140C0",
    "positives": "everybody I interacted with was very nice, residents seem to get along very well and there are large program organized \"wellness activities\" (will rent a boat for the day, hotel for the night, trips to local amusment parks thanks to donor to wellness fund), guarnteed week off for christmas or new years, will be gaining inhouse gi and cards fellowship, specific heart hospital which makes up for lack of current cards fellowship related research opprotuniites, will be joining with local university which would expand research infrastructure",
    "negatives": "Have to go to the VA which everybody from the residents to some admin indirectly hinted at not being the best place to learn (slow, low variety of pathology), while the area the hospital in is safe per residents and admin it looks like the surorunding areas can be a little dangerous"
  },
  {
    "nrmpProgramCode": "2129140C0",
    "positives": "4 + 1, very friendly chats, interviews with the faculty were both over my life and geography i had in common with them. ended talking about Louisiana and NYC life and stuff. very relaxed atmosphere",
    "negatives": "No PD on interview day +3, APD made several off-putting remarks(i didnt see any on mine, alll my interviews were with faculty, no one was a PD or APD)",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "Nothing",
    "comments": "The resident who was assigned an inteview room was exhausted and straight went into what questions do you have for me? didnt get the typical IV experience.   Can confirm, as a student who rotated here, they work a LOT"
  },
  {
    "nrmpProgramCode": "3199140C0",
    "positives": "Interview was pleasant and conversational; residents were clearly happy; hospital is nice af; pays well with good benefits and lots of perks    Highly underrated program in terms of the academic perks it has. Nationally renowned faculty in certain departments and they have a significant amount of research going on for a \"community hospital\". Everyone seemed happy and residents were clearly friends with each other. PD was highly regarded by the residents.    Pretty good for newer (first class started in 2014 I think) program, residents seemed happy and friendly with one another, PD very nice, nice variety of patients and pathophys, xmas or new years off without counting towards 4 weeks of vacation",
    "negatives": "Traditional schedule; Fairfax is further out from DC than people think; residents noted issues with ICU midlevel encroachment at both Q&A and social (but PD aware and actively working on it)    midlevel problem came up during mine too, apparently attendings will often have midlevels do proceudres if \"emergent\", they have expanded the procedure rotation though to maybe help some with this, honestly just don;t love the idea of having to advocate/ fight for something that is supposed to be apart of my training, one interviewer was great, one clearly hadn't looked at my app and seemed to be interviewing from her phone",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "2347140C0",
    "positives": "PD and faculty were really friendly and seem very experienced in resident education, residents gave off great vibes. New hospital with expanding research options",
    "negatives": "New program (we'd be in their 2nd class), so obviously no sense of how people do in the fellowship match",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "1739140C0",
    "positives": "PD, APD, and PC were all great, they seem to be committed to building a good program and the GME at the hospital seems very supportive, PD is experienced, hopsital is renovated and very nice, very nice shared resident lounge and call rooms (allthough they are kinda far from the patient units), generous food stipend for use in the hospital",
    "negatives": "New program",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "Coffee mug"
  },
  {
    "nrmpProgramCode": "2145140C0",
    "positives": "PD & faculty were very friendly, community hospital that focuses on residents getting lots of procedures, running codes, emphasizes autonomy",
    "negatives": "bad location, traditional schedule with one day of clinic per week instead of X+Y; 2 rotations (GI & Endo) done in NC",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1737140C0",
    "positives": "super good residents and faculty, one of my favorite interviews +1    one of the friendliest vibes from everyone I interacted with!    seemed to have most of the perks of higher tier academic places without as many of the annoying personalities    couldn't agree more with the above comment - the vibe was great throughout each interview and the residents were awesome during the noon conference>>>it was honestly the best environment i've see across the spectrum of t20 programs to small community places, really made me excited to potentially match here    Of all my interviews this was probs the most convincing that the residents actually hang out with each other a lot. 3+1 schedule seems nice too and the residents like it",
    "negatives": "Small airport, Charlottesville very expensive for size and location. Pretty low stipend relative to COL, paid parking. Specifically excluded from more robust medical center retirement plan, and the plan that residents are eligible for does not have matching. Business casual on the wards when not on call, on weekends, or on nights. <<wait seriously? they don't wear scrubs usually??<<big dumb, let me roll out of bed without thinking about what i'm wearing    Personally got opposite vibes from residents at my social/interview. They hinted that they don't hang out outside of work that much, and \"grocery stores\" were used as an example of \"best things about CVille.\" >>>LOL, Cville isn't NYC but if you can't find something you like here then thats on you. << Lol I know Cville has a lot to offer, but that comment from a resident raised some question marks about resident culture/time off. Seeing how others had a great time at their interview, I'm confident mine was a fluke. Faculty had really good vibes though",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "candy, pen, notepad, handwritten postcard",
    "timeGiftReceived": "Post interview"
  },
  {
    "nrmpProgramCode": "1743140C0",
    "positives": "Richmond is cool  VCU hospital pulls from large diverse area  Residents seemed pretty happy; program seems to have low faculty turnover; fairly chill block schedule    Focus on wellness and faculty seemed super supportive    Faculty interviewers had clearly read my app very thoroughly, asked thoughtful questions",
    "negatives": "Interns aren't allowed to do any procedures<<wtf << what? that is not what was said to me at my IV...  ^it's part of their \"graduated autonomy\" structure. Interns consent and drape but don't actually put in the lines ...interns CAN do procedures with supervision <<< there's required proceudres you must do as an intern; really weird vibe from my IV day, felt like they were trying to grill with questions (even in the informal interview) rather than trying to get to know me and my goals; fellowship match is not great except for pretty much GI; lots of people didn't even know about VCU at other places I interviewed at; benefits are poor compared to other programs (apparently does not give enough food money, parking is $50/month, Step 3 costs aren't covered)  i got really weird vibes here, mostly that it's an incredibly busy hospital and the residents work a lot. there is a lot of busy work that is part of this graduated autonomy, ie you have to sign off on procedures in sim before doing it on patient. there are mandatory physiology retreats where you go camping for 3 days and learn, mandatory small groups where you write reflection papers. it felt like medical school. i have also heard from several graduates the culture isn't the friendliest  One of the very few places that does not seem to adequately feed their residents, which is a major concern given their focus on \"wellness\" << yeah they are clearly poor, but so is my home institution and our residents are fully fed and watered, so idk what's going on there",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "VCU pocket notebook and pen, generic handwritten postcard",
    "timeGiftReceived": "Post interview"
  },
  {
    "nrmpProgramCode": "2216140C0",
    "negatives": "traditional schedule with one day of clinic per week instead of X+Y, not all rotations in house",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "nothing"
  },
  {
    "nrmpProgramCode": "2159140C0",
    "positives": "It's a couple hours North of Seattle, so the area is pretty.     Loved my interview expereince here. Faculty and residents are genuine and they truly care about you as a person. Specialists really enjoy working with residents. Everyone gets along super well and overall program seems to have a great vibe.",
    "negatives": "Residents did not pass the vibe check; rude, did not familiarize themselves with our applications, asked repetitive questions and then obviously did not listen to the response. Said they \"dislike academics\" and want more people who are \"just like us\" to match there. Felt borderline discriminatory because I did not physically look like them, they made an assessment of 'fit' before getting to know me. (eyerolled as soon as I joined the room and turned on my camera.)    I did not have this experience ^^ Absolutely did not have this experience",
    "howInterviewDayAffectsRank": "LOWER",
    "comments": "Residents were reported"
  },
  {
    "nrmpProgramCode": "2167140C0",
    "positives": "The residents seem really nice and so did the PD. The program is very flexible and willing to make adjustments based on resident feedback. +1 Nice but candid. 100% board pass rate 2023.",
    "negatives": "Poor retention of local specialists. Weak didactic, resident driven. Disorganized interview day as coordinator is very new (but sweet.)"
  },
  {
    "nrmpProgramCode": "1918140C0",
    "positives": "one year of elective time, unionized program, great variety across 3 sites and great ambulatory/primary care training regardless of track, lots of outdoorsy/sporty residents and most state no problems with COL on current salary (also no income tax helps)",
    "negatives": "still has one month of 24 hour call and trad schedule system, continuity of care for clinic seems hit or miss, PD leaving , have to earn cafeteria credit based on work hours? <<$13 credit per 12 hr shift, pay for parking ($9/day). High COL area, salary relatively low. Residents seem very overworked. << parking closer to $13-20 per day. Long communte times between hospitals. Residents didn't know each other.",
    "howInterviewDayAffectsRank": "LOWER",
    "gift": "nothing",
    "comments": "one month of 24 hr call? how does this get spread apart scheduling wise? <- from what I heard on IV day its a Q4 28 hour shift (day shift, ?day shift, day+night shift, day off, repeat)"
  },
  {
    "nrmpProgramCode": "1756140C1",
    "positives": "new program. PD and core faculty seemed super nice during interviews and seemed genuinely interested in getting to know me. lots of emphasis on wellness and teaching with goal of building a positive residency culture from the ground up. Residents seem to genuinely like each other, happy with being there",
    "negatives": "New program. we'd be entering their second year. away rotations seem available but they said during introductions that they are still working on establishing preceptor connections for some of the more competitive fellowships. also training current PGY1s with attendings serving as senior residents with hope that current PGY1s will be ready as new seniors for our incoming class next year",
    "howInterviewDayAffectsRank": "LOWER",
    "comments": "PD named didactics after himself and offered house flipping advice. Faculty interviewer hadn't read app/didn't want to be there"
  },
  {
    "nrmpProgramCode": "2276140C0",
    "positives": "workhorse",
    "negatives": "IV questions are standardized, I understand the concept for making it fair for everyone but it makes the interview very dry, unnatural and not conversational. The interviewers were just reading off the questions from a sheet, but everyone was nice",
    "howInterviewDayAffectsRank": "LOWER",
    "comments": "Why is workhorse listed as a positive, lol"
  },
  {
    "nrmpProgramCode": "1902140C0",
    "positives": "Admin seem nice overall, in house fellowships expanding and seem to like to take residents from within,PD does seem comitted to resident welness, residents seem to be happy with the program and training",
    "negatives": "One APD kinda seems odd, use cerner",
    "howInterviewDayAffectsRank": "NO_CHANGE",
    "gift": "Key chain with signed generic postcard",
    "timeGiftReceived": "post interview"
  },
  {
    "nrmpProgramCode": "3066140C0",
    "gift": "Engraved keychain",
    "timeGiftReceived": "Post-interview"
  },
  {
    "nrmpProgramCode": "1837140C0",
    "positives": "Schedule seems adequate, plenty of tracks. Solid global health track. Population you serve is very underserved so pathology is diverse.    Everybody seemed nice, residents seem to like eachother, seems as though research and mentorship is easy to come by, hospital has everything under the sun all in basically one place, cheap to live, can watch footbal from the hospital lol    One of my favorite interviews because everyone was so nice and seemed to really enjoy being at WVU",
    "negatives": "The residents interaction felt a little bit off. <idk, not at my interview>>+2, vibes were fine  Morgantown is not that big/pretty remote",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1787140C0",
    "positives": "Big on resident wellness. Felt like the PD really cared about improving the program. Residents receive lots of perks such as meal stipends, free parking, etc. They stressed how the small program allows for better mentoring. Many fellowships through Aurora. St. Luke's has a good cardiology fellowship.",
    "negatives": "Research that's not cardiology seems hard to come by and residents would need to do a lot of the leg work. Schedule isn't x+y so you could have a couple of months of inpatient back to back.",
    "howInterviewDayAffectsRank": "HIGHER",
    "comments": "Seems like overall a great hybrid residency especially if interested in cardiology."
  },
  {
    "nrmpProgramCode": "1774140C0",
    "positives": "Big on wellness, recent switch to X+Y, residents seemed happy and got along well. Offer subsidized housing",
    "howInterviewDayAffectsRank": "HIGHER",
    "gift": "Nothing"
  },
  {
    "nrmpProgramCode": "1780140C0",
    "positives": "Above average stipend, free parking, rural rotations available. Wisconsin is a nice place to live.",
    "negatives": "PD very unprofessional. Schedule is a mess. Invited us to morning report but they never let us into the meeting room. Entire class is IMG. 28hr call during PGY3. PD seems very toxic, asked weird questions and acted like a jerk.",
    "howInterviewDayAffectsRank": "LOWER",
    "comments": "Did not apply or interview, but this healthsystem is financially in midst of collapse. No idea how this impacts the program, but just a heads up.//Can you provide more information or source? I interviewed here :( - Link to RIGHT to news article. They completely cut off all 401k match benefits to employees and are slashing salaries. Again, not sure how this effects residency, but not a stable financial enviroment at the moment."
  },
  {
    "nrmpProgramCode": "1784140C0",
    "positives": "Emphasis on resident wellness including from PD, dedicated teaching and research time, flexibility in electives. Individual interviews felt like they wanted me to go there vs. me explaining why I want to go there. I+O's schedule (4 week inpatient, 4 week outpatient with weekends off), high salary compared to COL, residents seemed to get along very well",
    "negatives": "Minimal breaks during interview day, 28 hr call (residents voted to keep it), minimal free food > no free food during noon report but funding in other places including huge parties during I/O switch, food during journal club, etc",
    "howInterviewDayAffectsRank": "HIGHER"
  },
  {
    "nrmpProgramCode": "1779140C0",
    "positives": "PD is awesome, really invested; in improving program. Schedule prioritizes; professional development and wellness. Strong; midwest vibes, very collaborative. The; PD is truly amazing. Residents; couldn't stop mentioning him when; talking about the program.",
    "negatives": "Parking apparently sucks, but PD; said the 3 residents who; didn't get it this year; were given free parking in; the patient ramp for the; year. Not a lot of; freebies (free food only 2x; per week, no food stipend). Tried; asking more about cons of; this program but a lot; of the residents and faculty; were stumped and couldn't really; name significant concerns. Greenest of; flags ^all that they could; come up with for my; group is that there's some; \"\"physician lounge\"\" with free soup; that APPs have access to; but residents don't so no; free soup for them. Some; of the residents were awkward; and very unenthusiastic during the; social. Probably the lowest energy; residents I have encountered during; a social so far. Not a; lot of patient diversity/diversity in; Madison.",
    "howInterviewDayAffectsRank": "HIGHER",
    "comments": "Overall v good vibes from; the program, clear emphasis on; wellness and education. Anti-workhorse, very; receptive to resident feedback."
  }
]