[
  {
    "nrmpProgramCode": "2132140C0",
    "positiveImpression": "very teaching enviornment. Residents are fun and easy going."
  },
  {
    "nrmpProgramCode": "1007140C0",
    "positiveImpression": "Current MS4: really strong and rigorous program at a major academic center, 1200 bed hospital, huge catchment area w/ great subspecialty exposure to some of sickest patients in whole country. Morning conference is honestly best i've seen in the country because they have residents present cases but expert clinicians who lead the discussion and show/teach how they think about HPI and how to clinically reason. All residents super chill and nice. Tough schedule intern year but otherwise it's a really great training program. > also current MS4: 100% agree w/ everything said, absolutely incredible didactics. Took this for granted once I saw the didactics at other places, even other strong programs. Lots of programs have clinicans reason through labs but HPI is a different story < +1 to both of the above",
    "negativeImpression": "Alabama is not a good state for women's or minorities' rights. <-I have lived in alabama and find this to be false, dont perpetuate a stereotype +5. Speaking of perpetuating stereotypes though....i saw and overheard some weird shit when I was there for my sub-I. Some of the 'bama memes might have some truth to them << Alabama is very progressive, thinking of going there for an abortion << I think the above comments highlight how complicated this is. If you are a liberal, you will most likely feel like the first commenter, without a doubt. Birmingham is much more liberal than the rest of the state, but it still exists within the issues the state has as a whole. Have lived here a long time, and Birmingham will always have a special place in my heart, but I am looking to leave the South for political/personal reasons. Just depends on how important that is to you"
  },
  {
    "nrmpProgramCode": "1852140C0",
    "positiveImpression": "Current MS4: Residents are great to work with, didn't work with a single malignant personality. Attendings same, although one or two can be a bit particular."
  },
  {
    "nrmpProgramCode": "3200140C0",
    "negativeImpression": "Intern: This program has become increasingly busy, with a lot more inpatient time and time in the ICU. The ICU experience sucks. The program is cutting benefits (recently dropped to 5 days of sick leave), and it's nearly impossible to capitalize on some of the benefits they advertise (rotating at other Mayo sites, at Valleywise, etc.). The leadership keep proposing changes which, while they are doing with good intent, always seem to have the effect of increasing the amount of work that residents have to do. If this trajectory continues, I would imagine this program becoming increasingly malignant over the next few years. The patient demographic is really narrow and there are a lot of patients with anxiety and IBS/POTS insisting on getting invasive diagnostics. Continuity clinic experience is terrible."
  },
  {
    "nrmpProgramCode": "1015140C0",
    "positiveImpression": "Home MS4: Overall fantastic program, residents seem happy and well-supported. For the research-oriented, the new IM Dept Chair is looking to start a PSTP and supports ABIM-short tracking, and the UofA has great research opportunities in a variety of fields. The program has two \"home\" hospitals with a more community-oriented feel at the South Campus Hospital, where you'll get good experience working with people experiencing homelessness, psychiatric issues, drug use, etc. The Main hospital just got a fancy new tower with private patient rooms, lots of windows for a beautiful view of the city. Residents also rotate at the Southern Arizona VA and Tucson Medical Center (community hospital). Tucson is an absolutely amazing place to be - Low cost of living (I pay $1750, 3br/2ba house with w/d, garage, and central AC), world-class access to hiking/rock climbing/outdoors, and great food.",
    "negativeImpression": "Interns had to do OSCE's. A little weird to have to still do these. // Inpatient teams are not geographically oriented which means you have to hike all over the damn hospital for rounds and feel less partnership with ancillary support. They are trying to change that, though. Socially complex patients which can be a pro or a con depending on what you're looking for in your training - but it can definitely be frustrating to see your patients stuck on the floor for days-weeks waiting for a bed at a SNF/rehab. Hospital owned by Banner.",
    "comments": "<<technically teams are geographically oriented now, though teams still move around a bit which I think is better <<good be a pro for those who want to get some steps in"
  },
  {
    "nrmpProgramCode": "2295140C1",
    "negativeImpression": "Do yourself a favor and stay away from anything affiliated with ARCOM if it can be avoided"
  },
  {
    "nrmpProgramCode": "2214140C0",
    "positiveImpression": "<<<<ANYONE?",
    "negativeImpression": "not a single resident here plays video games<<<lol"
  },
  {
    "nrmpProgramCode": "1041140C0",
    "positiveImpression": "Current intern here, love the program. PD + chiar of medicine + most* attendings loves teaching and wants us to do well. Pay is pretty decent-good. 30$/day for meals. Cool pathology. Really underserved pt population is its rewarding working with them.",
    "comments": "not pro or con but schedule is a little weird, its \"3+1\" but its actually \"1+1+1+1\" where you change rotations weekly with every 4th week being your clinic week"
  },
  {
    "nrmpProgramCode": "1030140C0",
    "positiveImpression": "Residents seem happy, seniors do a good job protecting/helping interns, attendings I had loved teaching and were very personable, and work hours seem better than average. They use Epic, also cafeteria has great food options",
    "negativeImpression": "Did a Sub-I here; one of the most toxic rotations I've ever been on, constant complaining by residents and overall a very negative atmosphere. Night and day compared to my rotations on UCLA or even Kaiser. My intern and residents never went to noon conference or morning report, and it felt kinda uncomfortable seeing exclusively poorer Medicaid/unhoused patients on the teaching service while rich Beverly Hills patients got the attending team with better rooms and service. < Call schedule I thought was a bit weird, also resident workroom has no windows >What's the call schedule? >> call is q4, essentially 6:30-6, can get ON admits from previous night, typically wont get them post-call unless not a lot during call day, otherwise go to next call team or other non-call tems depending on list (from my understanding) < new 2024 comment: totally agree that place is toxic, some residents are horrible, mean, extremely nipticky, actively gossip about each other. very negative atmosphere for sure.",
    "comments": "<- this exact comment comparing them to UCLA/kaiser was on last years sheet lol"
  },
  {
    "nrmpProgramCode": "1067140C0",
    "positiveImpression": "Did a Sub-I here. I got an amazing team and there was palpable comraderae between residents. They have a 4+4 schedule and the workload seemed manageable. Residents get 3 free meals per day. Lots of interesting patients, everyone was really nice. Definitely left a positive impression on me! :) +2 (also cafeteria food is great!) < I thought Harbor UCLA wasn't on x+y schedule w half day continuity clinics? < they switched to X+Y 1-2 years ago",
    "negativeImpression": "Minor: Uses Cerner (2nd only to Epic), and things can get done slower because it's county (labs, imaging, etc)"
  },
  {
    "nrmpProgramCode": "2037140C0",
    "negativeImpression": "patient population seems monotonous"
  },
  {
    "nrmpProgramCode": "1042140C0",
    "positiveImpression": "M4 sub-i - residents seemed happy and the attendings were super nice and loved to teach. food is provided on weekdays!   Current intern- all my coresidents and the faculty are very nice and supportive, and based on what I've heard from friends at other IM programs the workload here is a lot more managable. So far very happy here"
  },
  {
    "nrmpProgramCode": "2950140C0",
    "positiveImpression": "sub-i. can be a very busy service but great bread and butter for IM + interesting infectious disease cases due to population. Residents appear happy and overall good culture. Teaching oriented. Every resident mentions loving the patient population. Socially complex patients.",
    "negativeImpression": "Sub-I. The hospital is dated and feels old, you will notice it the moment you walk in. Safety-net hospital, 28 hour long call days for R2s and R3s on inpatient. For Sub-Is/interns call days are 6am-10pm, admit 10, interns admit until 7pm. Food options are VERY limited. Computers are super slow and Cerner EMR is very bad compared to EPIC. Attendings are more concerned with elaborate notes, and very specific knowledge of disease processes rather than overall work ethic and how you support the team. Residents were very aware of and appreciative of my efforts and I often stayed after they left to get tasks done like D/C summaries, consults, and talking with family. Attendings did not see it that way. On my last two days I coordinated and D/C'ed three of the four pts I was carrying on one day (including a patient who 2 attendings said was the most complex on our whole team), attending told me he appreciated my work a lot. The next day proceeded to tell me I was \"below average\" in knowledge but couldn't even give a clear example. OV Residents do rotate at Reagan, but it is well known OV residents are not the same caliber as Reagan residents, (heard this from an attending based at Reagan who rotates at OV and has worked with residents from both programs) <<< 99% of residents are \"not the same caliber\" as UCLA residents lmao what a jerk < Agree, don't think theres a difference, but it was notable the attendings made that distinction. I think they're both overall excellent programs"
  },
  {
    "nrmpProgramCode": "1340140C0",
    "positiveImpression": "<<<<ANYONE?"
  },
  {
    "nrmpProgramCode": "2138140C0",
    "positiveImpression": "<<<<ANYONE?"
  },
  {
    "nrmpProgramCode": "2161140C0",
    "negativeImpression": "In stocton,"
  },
  {
    "nrmpProgramCode": "1025140C0",
    "negativeImpression": "Multiple ACGME violations. Still has ACGME warning if you look it up"
  },
  {
    "nrmpProgramCode": "1820140C0",
    "negativeImpression": "there was a fucking chinchilla in the resident workroom. He was chill though, just sat in a cage and chewed on some hay",
    "comments": "<< that is a positive."
  },
  {
    "nrmpProgramCode": "1046140C0",
    "positiveImpression": "Current M4. Extremely supportive program with great relationships between all the residents and attendings. Good exposure to a mix of patient pathology given the region the hospital serves. Recently changed ICU night float to allow the seniors to come in every other night, and the interns on night float are off on the weekends. Every attending loves to teach, and half to more of the attending-only hospitalist service is filled with Davis grads for a reason."
  },
  {
    "nrmpProgramCode": "1043140C0",
    "positiveImpression": "Current M4, chill program. Kind of cush even. Residents are treated well, never go above 80hrs/week. Faculty are supportive, good cases here. Really really good area to live in imo. Right between LA and SD. Perfect weather and super safe. Amazing food. PD is super nice"
  },
  {
    "nrmpProgramCode": "1956140C0",
    "positiveImpression": "MS4 - A wonderful place to have trained. Overall, the residents are friendly, brilliant, and seem quite happy. Great faculty, great variety in training because residents rotate at 4 different hospitals. Also the benefits/salary are way better than many other places. And nothing beats SoCal weather. Usually about 1/3 of the UCLA MS4s applying IM end up staying for residency each year because it is highly sought after.    Away Sub-I: Absolutely fell in love with the program while on a Gen Med team. Residents are happy, supportive, and bought us food/coffee every single day. Faculty are brilliant clinicians and eager teachers who truly just wanted us to have a great learning experience. Dr. Skinner is an absolute gem who handed out candy to every team on Halloween alongside the chiefs and went to more than half of the noon conferences in-person despite it being interview season. The benefits and location are unparalleled, and I have zero complaints or negative impressions to post. Just a wonderful program to grow up in overall."
  },
  {
    "nrmpProgramCode": "1049140C0",
    "positiveImpression": "Current intern. Super happy I matched here. The PD is really as kind and friendly in real life as the interview day. UCSD does a great job at recruiting hard working, smart residents who also happen to be genuine people that you'll enjoy working with. Also, it helps to be in a city with year-round sunshine,a beach and endless things to do on your day off lol",
    "negativeImpression": "Definitely feel jealous of my X+Y friends from med school who get more frequent golden weekends than me. < as someone in a 6+2 program, where all 6 weeks is inpatient, not that great either!",
    "comments": "Can someone comment on QOL/work life balance? obviously I hear it's amazing weather/vibes in SD but do you have adequate time off to actually enjoy it? Also, how is level of autonomy/procedures/sick patients etc? > Poot to everything you asked > current resident and very happy. city is fantastic, everyone is chill. time off is highly dependent on rotation. wards and ICU are very busy (like anywhere), but other rotations are laid back and always have full weekends. so essentially you'll be very busy for a month then chilling for a month"
  },
  {
    "nrmpProgramCode": "1062140C0",
    "positiveImpression": "MS4- Reaally an incredible progrram. Cliinical excellence without compromising on locatiion (SF is best ciity in the country IMO, with tons of beauty in every diirection) or supportiive enviironment (attendings here are incrediibly kiind). A lot of changes to the progrram in the last few years that have made it less intense (open ICU --> closed ICU, liimited 24 hour shiifts, launched this cute liittle app \"amioff\" where you can easiily see whiich of your co-residents are off on any given day so you can hang). An intern friiend says she has yet to work >70 hours in a week. Unlliike a lot of top progrrams, reaally values priimary care and GIM. MS4 - diid away here, all the fellows talked about positiive experiiences duriing residency / good hours compared to friiends at other progrrams",
    "negativeImpression": "Yourr days off duriing block are often in the miiddle of the week (versus some other progrrams when your day off is on a weekend). Hospitals are spreaad out throughout the ciity so hard to conveniiently place yourself and no free parking (except VA). Doing chart reviiew based research can be a liittle triicky here compared to other iinstitutions iif that's your thiing (iironiic giiven how much of a research powerhouse UCSF is)- IRB approvall process takes forever and research softwarrre is hard to work with. Because health sciiences only, no undergrads and can liimit iinterdisciplinary collabboratiion dependiing on iinterests (though connectiion with Berkeley).\" <Diisagree wiith thiis con, everyone wants to do research wiith UCSF, very common for other iinstitutions to collabborate",
    "comments": "How's the housing situation these days? <Surprisingly, not bad"
  },
  {
    "nrmpProgramCode": "1522140C1",
    "positiveImpression": "anyone????"
  },
  {
    "nrmpProgramCode": "1033140C0",
    "positiveImpression": "Please, anyone?? >> sub-I; positive impression overall. Seems like a very tough program based on what my interns told me although I was treated pretty well only having to carry 3-4 max and no weekends. But doesn't translate"
  },
  {
    "nrmpProgramCode": "1076140C0",
    "positiveImpression": "Excellent Noon Conferences, super nice chiefs.",
    "negativeImpression": "?? Anyone . Did my away rotation here, only major negative was 1 intern 1 senior teams, meaning the intern was handling more patients and the senior was doing intern work. Some resdents seemed cut throat +3"
  },
  {
    "nrmpProgramCode": "1079140C0",
    "positiveImpression": "Anyone??"
  },
  {
    "nrmpProgramCode": "1081140C0",
    "positiveImpression": "Great attendings, learn a lot on rounds. Teams only consist of one resident and one intern so interns do carry many patients but there are usually several med students on teams that can help with charting. Residents seem happy. The patient population is very diverse and acutely ill. Not a huge hospital but a good learning enviornment.",
    "negativeImpression": "Could be a pro or con but they generally only take FMGs/IMGs. Also, only fellowship offered here is cardiology, they do take residents from this program for the fellowship however."
  },
  {
    "nrmpProgramCode": "1093140C0",
    "positiveImpression": "Smaller hospital but friendly enviornment. Residents are all happy. Yale affiliation means they are able to do electives at YNH. Also GI and Pulm/CC fellowships offered. Some of the friendliest faculty/staff who love teaching."
  },
  {
    "nrmpProgramCode": "1080140C0",
    "positiveImpression": "Residents are close given small program size, hospital is pretty updated aside from one floor which looks straight out of the 80s, pathology on teaching services are varied, PD is very involved and is a good advocated for the residents, the attendings that like teaching are great and rounds actually feel worthwhile with them, patient population is on the underserved side and are generally appreciative, basically all IMGs which is a pro/con",
    "negativeImpression": "Residents seem to like each other, there are a few great attendings but there are some (including some that trained there and stayed) that are not great/ do not come off as interested in teaching/ just aren't great at it, noon conferences that i attended seemed hella basic (twice in a 5 week span there was an improv session where it wasn't clear what we were supposed to be learning), never saw any procedures on wards (everything done by IR or specialty midlevels), some of the midlevels on the speicality services are not great and don't really get supervised by their attendings (nephro NP tried to send a patient home with an aki that was wrose and continuing to worsen compared to admission, cardio NP consulted on our patient and when they came to talk to us about their plan didn't know basic but essential parts of the patients history)"
  },
  {
    "nrmpProgramCode": "1096140C0",
    "positiveImpression": "Current M4 (applying 2023-24) who rotated here for my M3 core IM and back for my Sub-I -- this place has a really awesome culture. Super educational, people are generally very kind to each other and collegial, the chiefs often go on to become attendings here who keep teaching, and everyone's really invested in the mission of educating students and residents alike. Very IMG/FMG friendly, and many of the residents here were already practicing physicians in their home countries, so the residents are also generally very knowledgeable. The faculty are really knowledgeable and excited about teaching. They also give you lunch every weekday and often one of the PDs/APDs brings breakfast to morning report. The hospital itself is really easy to navigate, too. The patient population is generally pretty ill; this is an underserved and poorer part of CT, so you'll get a good variety of cases, both bread-and-butter and zebras. Patients here mostly speak English, but there's a significant proportion of Spanish, Polish, and Portguese speakers as well.>>>small but pretty high acuity ICU with great attendings",
    "negativeImpression": "Like the commenter above said about Danbury, generally taking mostly FMG/IMGs could be seen as a pro/con. Also, no fellowship options here, just IM and Gen Surg residencies. It's definitely a small community hospital, so volume is pretty low in the warm months but becomes basically entirely COPD exacerbations/PNA in the winter."
  },
  {
    "nrmpProgramCode": "1094140C0",
    "positiveImpression": "anyone to share???? +2"
  },
  {
    "nrmpProgramCode": "1089140C0",
    "positiveImpression": "Great, supportive & responsive faculty/admin, no malignant culture I have heard of, happy residents and good pay in a relatively low CoL Northeast town w/ good access to all the big NorthEast cities. New carrier @ local airport w/ surprisingly cheap airfare (though to an albeit limited set of locations). Biggest name in a wide area so get to see a wide variety of cases including zebras. Top-tier research opportunities & fellowship match.",
    "negativeImpression": "Parking not covered by program. Somewhat difficult to arrange coverage for conference attendance (have to coordinate yourself), back-loaded schedule, most people in relationships/doing their own thing",
    "comments": "Getting rid of 28H call next year"
  },
  {
    "nrmpProgramCode": "1089140C2",
    "positiveImpression": "Interviewers read your whole application and ask questions directly from there. Very casual conversation, no behavioral questions. Friendly staff.",
    "negativeImpression": "Only 5 minutes with the PD"
  },
  {
    "nrmpProgramCode": "2260140C0",
    "positiveImpression": "Did a SubI here. Residents were all extremely friendly. Prior to audition, I had no significant intention of liking the place. But i had a great month with the team. New heme/onc fellowship, and working on approval for GI fellowship. Food is really delicious at the new hospital."
  },
  {
    "nrmpProgramCode": "1099140C0",
    "positiveImpression": "PD is really friendly and nice.",
    "negativeImpression": "EMR is powerchart cerner."
  },
  {
    "nrmpProgramCode": "1802140C0",
    "positiveImpression": "Small-ish hosptial, pretty diverse amount of path. Gets all of the level 1 trauma in DC, more than you would think for a small city, lots of GSW. There are some amazing teachers here, but the hosptial itself is a bit of a shit show. Occasional VIP from congress etc shows up. ICU staff is top notch. Cafe is solid 3/10, but there is a Whole Foods and food court right down the street. Cost of living is similar to that of LA. Summers are hot and swampy.     Great attendings, coresidents. Overall hours are reasonable and I have enjoyed my time. The PD is fantastic",
    "negativeImpression": "MS4: Agree with everything said in positive but in negative the hospital is definitely a shit show. It's for-profit and now 100% owned by UHS so they care a lot about money and makes things harder clinically (eg no IR on the weekends). Nursing shortage likely similar to everywhere."
  },
  {
    "nrmpProgramCode": "2193140C0",
    "positiveImpression": "<<<<ANYONE???"
  },
  {
    "nrmpProgramCode": "1801140C0",
    "positiveImpression": "Very supportive program, run by good people. Admin issues like at most programs. PD is very friendly and involved.",
    "negativeImpression": "0ut of the way without access to a metro, there are busses that run nearby though. INTERN 9/2023: I didn't realize how hard it would be to adjust coming from a large state program. Food is hard to come by, there is no hospital cafeteria. They give you these cold box meals but things will be rough if you have dietary restrictions. Living in DC is also like doing residency on hard mode. Driving here is horrific and you rotate at so many hospitals that you can't game the system by living close to 0ne. The VA here is also much worse than the one I was used to. 0ur iteration of cerner is atrocious. They always say you get used to it but even upper levels and fellows trained on epic continue to miss epic. If you're used to driving and living in DC and you have family nearby who can help you it's not bad. The program is very supportive. But if you're a single person think hard about what how much you want to work just to feed yourself when working long hours. Also the health/pharmacy insurance plans are borderline unethical throughout DC. HopefuLly you don't need a specialty medication because it'll be a strugg to get for yourself (or many of your patients) because the hospital pharmacy hours are pretty narr0w."
  },
  {
    "nrmpProgramCode": "1800140C0",
    "positiveImpression": "very diverse patient population, mostly IMG residents all incredibly intelligent, significant educational opportunities for residents, Georgetown students rotate here. Fellowship matches have all been very strong",
    "negativeImpression": "challenging schedule imo (1 day off per week on wards not necessarily a weekend),"
  },
  {
    "nrmpProgramCode": "1586140C0",
    "positiveImpression": "M4: Residents were all nice and enjoyed teaching students. PD seemed chill and supportive. Call is q2 at one of the hospitals, which I heard can be tough. No 24 hour call though.",
    "negativeImpression": "This is from a student who rotated there who gave me an honest review (not directly from me): some of the worst work hours I have seen for IM. Call days start around 6 AM and sometimes do not end until 8-9 PM; call days are every 3 days. However the program is reputable and has good fellowship match rates. ——Current resident: on call days we admit from 11am-5pm (M-F) and 7am-5pm (Sat/Sun). Hard cap of 10 admits for the team (max 5/intern) regardless of the schedule. Signout to Night team is at 6pm every day. Early in the year it's not uncommon to have interns lag behind in writing admit H&Ps/progress notes as they adjust to residency/EMR/etc, but I would say staying until 8-9pm is very uncommon."
  },
  {
    "nrmpProgramCode": "1826140C0",
    "negativeImpression": "TOXIC PROGRAM",
    "comments": "DO NOT RANK <<copied from older version of this sheet, may be the wrong FSU → Not the wrong FSU. PD has to go."
  },
  {
    "nrmpProgramCode": "2232140C2",
    "negativeImpression": "MS4: Do not apply if you are not fluent in spanish. rounds are done 90% in spanish. residents are very clicky. Most attendings don't like to teach. https://www.nbcnews.com/health/health-care/roaches-operating-room-hca-hospital-florida-rcna69563"
  },
  {
    "nrmpProgramCode": "2323140C0",
    "positiveImpression": "I came here with 0 expectations but there's so much for residents and us students. There's a strong culture of elevating the program so everyone is working together. Nothing toxic.",
    "negativeImpression": "Not really a con but as a visiting MS4, I didn't get the chance to rotate in their admitting IM rotation. Residents say its the best rotation.",
    "comments": "Attendings are the senior residents, some are recent chief residents that finished residency in local central florida programs."
  },
  {
    "nrmpProgramCode": "1032140C0",
    "positiveImpression": "??",
    "negativeImpression": "??"
  },
  {
    "nrmpProgramCode": "2085140C0",
    "positiveImpression": "Free food and physician lounge access, Epic// Current resident here: This place was my #1 and the best choice of my life. Best culture, PD, benefits, and work hours of any other program I know of. Very reputable hospital system and our graduates get some of the best offers. Huge attending network so you'll make invaluable connections. Great match results for every specialty except CritCare and GI which nobody has tried yet. Five weeks vacation + extra sick days/COVID/conference/interview days. $3-5k bonus this year to everyone. Hospital has $$ and we've got the latest tech and most expensive meds. Our attendings say we're spoiled being trained here. 1st wave of COVID we were never short of PPE. Lastly, living in South Florida just can't be beat..",
    "negativeImpression": "Same current resident here: Crazy expensive rent situation in South Florida. Still way better than NY or San Francisco tho. Also, if you're set on doing GI, other places can offer you more certainty. Our first resident that wants to go into GI is applying next year so we don't have results to show yet. However, our PD will pick up the phone and go to great lengths to help get you wherever you wanna go. Lastly, you'll need a car here.",
    "comments": "To the current resident: does this site qualify for public service loan forgiveness and do you feel the teaching as a newer program is strong? I am coming from the midwest with some of the top teaching hospitals here and was curious how teaching compares? // I'm not sure about the public service loan forgiveness question. I've heard some of my co-residents talk about it so I think it does, but best to email our coordinators or PD or chief resident as I don't wanna give false info. The teaching really depends on your personality, there are residents that want to be taught everything in-person (resulting in longer rounds) and others that prefer finishing early and having time to self-study. There are attendings of both groups here and you can pretty much choose what you prefer."
  },
  {
    "nrmpProgramCode": "1105140C0",
    "positiveImpression": "Current M4 doing my Sub-I here. Very good vibes and everyone seems to really enjoy the residency. Seniors and chiefs love to teach and have been incredibly helpful. On wards, you are on call every 3 days (7a-8p), but on pre-call and post-call days sign-out is at 3pm. If a pre-call day falls on a Friday, Saturday, or Sunday, you have that day off. No black weekends as far as I can tell. You can only get new admits on call days and interns cap at 10 patients. Lots of patients only speak Spanish, so knowing the language is definitely a plus, but several residents don't speak Spanish and do okay with the translation services. Beautiful views of Miami Beach out of all the windows, especially in the new surgical tower.",
    "negativeImpression": "Miami living can be incredibly expensive and traffic is frustrating if you are driving at peak time. Traffic usually isn't an issue getting to the hospital early, but I usually hit traffic on my way home.     Not many computers for note writing in the resident lounge, so some residents have to go to the library    Meals not provided. Can buy lunch in the doctor's lounge for $5."
  },
  {
    "nrmpProgramCode": "1587140C2",
    "positiveImpression": "MS4 here-- IM culture here is a gem between residents with a lot of down to earth faculty who buy food for teams and teach. If you're on the fence between here and another place, the vibes are great and this is your sign <<<hi thanks for this! :) just wondering if its caught in the HCA malignancy too or not? The PD does seem nice and lots of opportunities for residents to grow but just concerned about the HCA name?"
  },
  {
    "nrmpProgramCode": "1587140C0",
    "positiveImpression": "Current intern- I am the happiest I have ever been! This program has been amazing. The attendings take a very personal approach to teaching to help you improve in the areas you need rather than giving blanket advise. The residents are incredible- the PD has a gift for picking good people that will get along well. The expectations are reasonable and the workload isn't too much. They have altered the program so that residents have a markedly lower cap for the first day/week/month that gradually increases so you have time to learn how to be a resident. The food is free and excellent and it's great being in Orlando. I would absolutely choose UCF/HCA Osceola again every time. Many of the attendings were once residents here and I think that speaks very highly of how much we enjoy it here.",
    "negativeImpression": "?????"
  },
  {
    "nrmpProgramCode": "1101140C0",
    "positiveImpression": "Anyone?",
    "negativeImpression": "dont even have a coffee machine for residents or free coffee lol> did a rotation a visiting student, they had some food in the resident lounge"
  },
  {
    "nrmpProgramCode": "1104140C0",
    "positiveImpression": "Great place to train, emphasis on wellness, and lots of exposure to rare diseases"
  },
  {
    "nrmpProgramCode": "1821140C0",
    "positiveImpression": "hospital is nice"
  },
  {
    "nrmpProgramCode": "1109140C0",
    "positiveImpression": "Med student on endocrinology sub-I: everybody was super friendly during my month there, especially the endo team. My experience was limited to the James A Haley VA. Good variety of pathology surprisingly for veterans in endo. Made friends with some of the residents and still keep in touch! Wish I was able to see Tampa General. Phenomenal restaurants in the Tampa area.",
    "negativeImpression": "The VA food is either fried chicken, chicken tenders/burger or sushi every day. Many IM residents spend the majority of their training at the VA (50% VA, 40% Tampa General and 10% Moffitt on average) which I feel should be more Tampa General. The quality of training at the VA is poor. As someone who grew up in a big city, Tampa is kind of limiting: nice weather but small and extremely expensive. Per my understanding, residents on ICU have to do a couple of 24 hour shifts."
  },
  {
    "nrmpProgramCode": "1120140C0",
    "positiveImpression": "Super close knit group of residents. They really look out for each other. Macon is super affordable and Navicent is a level 1 trauma center, so you get all kinds of patients. The PD and attendings all really want the best for you and want to see you succeed.",
    "negativeImpression": "Only fellowship is ID but they usually have a few match every year into other specialties."
  },
  {
    "nrmpProgramCode": "1113140C0",
    "positiveImpression": "M4 here currently. Diversity of care between Grady, Emory Hospitals, and VA; all except VA now use EPIC (though they're not \"linked\" to each other). Overall, attendings and residents seem to have a healthy culture and enjoy teaching/helping each other. Residents get food at some conferences. Lots to do in the city between museums, breweries, food, parks, and sports. Pretty good COL for its size.",
    "negativeImpression": "There have been some complaints about workload and there's always an attending here or there that isn't as pleasant to work with. Traffic is pretty bad. Rent costs are increasing."
  },
  {
    "nrmpProgramCode": "1985140C0",
    "positiveImpression": "Current Sub-I: Super affordable city! Interns own houses. Residents look happy and are thriving in all aspects. Graduates love to stay there for fellowship and some even pre match here. All the fellowships are available except for palliative care. constantly improving their didactics, leadership is very open to suggestions. As Medical student, I felt part of the team, attendings are relaxed but teach a lot. good amount of autonomy and supervision. +1"
  },
  {
    "nrmpProgramCode": "2166140C0",
    "positiveImpression": "Lots of in house fellowships. Ever growing program. Extremely supportive faculty"
  },
  {
    "nrmpProgramCode": "1805140C0",
    "positiveImpression": "A very strong community program. Fellows historically match very well into competitive fellowships."
  },
  {
    "nrmpProgramCode": "1972140C0",
    "positiveImpression": "it seemed like they didn't like having us around or teaching us. I remember a May intern not knowing how to work up a common complaint and he told me he had always felt bad asking questions when he didn't know so he never learned."
  },
  {
    "nrmpProgramCode": "3350140C0",
    "positiveImpression": "switched to a 4+2 from a traditional schedule this year, really enjoying my time in the program; great camraderie amongst residents, plenty of opportunity to do procedures at Kuakini which has an open ICU, lots of autonomy, well supported, staff and medical students all nice; would choose this program again",
    "negativeImpression": "food stipend could be a little higher at Queen's but attendings buy lunch for us on the weekends as a tradition, COL higher but recently got a 10k raise to adjust for inflation, q4 24 hour call at Kuakini as an upper but for the other 3 days you can leave early if you finish all of your work"
  },
  {
    "nrmpProgramCode": "2117140P0",
    "positiveImpression": "??"
  },
  {
    "nrmpProgramCode": "1168140C0",
    "positiveImpression": "anyone????"
  },
  {
    "nrmpProgramCode": "1226140C0",
    "positiveImpression": "Current MS4: residents get unlimited money for food and coffee at the hopsital, overall seems like great work/life balance - 4+4 schedule and 4 weeks vacation and they seem very happy & are fun, geuninely nice people"
  },
  {
    "nrmpProgramCode": "3053140C1",
    "positiveImpression": "??"
  },
  {
    "nrmpProgramCode": "3053140C0",
    "positiveImpression": "??"
  },
  {
    "nrmpProgramCode": "1127140C0",
    "positiveImpression": "Poor HR, great residents (very friendly), attendings are mostly good w/ some malignant ones"
  },
  {
    "nrmpProgramCode": "1950140C0",
    "positiveImpression": "Great residents and attendings. Really nice and fun to work with. Great facilities for residents and support staff are nice for the most part.",
    "negativeImpression": "Seems like a sinking ship. They are slowly closing their fellowship programs and attendings/faculty are leaving en masse. Heard they are hiring a new PD as well, which probably explains why none of the sub-Is have ever seen/met him. At all my other sub-Is the PD interacts with the students/residents during didactics etc. but not here. Hospital is too small for my liking, although the residents say they get good exposure. < old from last year, PD appointed and everything has been pretty stable, fellowships re-opening due to more faculty on board. Hospital is small but good variety.",
    "comments": "Current resident and I'd have to disagree. Overall, IM residency at Franciscan has been very positive. I didn't go in expecting residency would be easy, but I'd have to say that our program is very benign. The work hours are very managable, no 24 hour shifts, get out on time. My co-residents and our attendings have all been very friendly. It's a small hospital, but the pathology is actually really good for its size, lots of obscure cases and disease presentations. Also has a crit care, rheumatology and GI fellowship and cards opening again in addition to urology, orthopedic surgery, general surgery, radiology and EM residencies which should say enough about the pathology you see."
  },
  {
    "nrmpProgramCode": "1170140C0",
    "positiveImpression": "M4- residents have always been very kind and like to teach medical students. They do work hard, but most of the residents I've worked with are happy here. I'm always impressed with their level of knowledge and training. +2    ^ Current M4 in 2023-2024 cycle, agreed with everything above. Residents and attendings are incredibly kind and welcoming and are committed to helping you learn. Was given as much autonomy as I wanted on my IM rotation and internal Sub-I. Leadership seems supportive as well, although PD is almost certain to retire within the next few years (but rumored successor is very highly regarded).",
    "comments": "Not as big of a name as NW/UChicago, but I was pleasantly surprised at the strength of the culture amongst residents. Recently graduated PGY-3s always had their juniors' backs, and that camraderie is evident amongst every single resident I've met."
  },
  {
    "nrmpProgramCode": "1121140C0",
    "positiveImpression": "Loyola MacNeal",
    "comments": "current M4: Extremely good fellowship match for a community program"
  },
  {
    "nrmpProgramCode": "2163140C0",
    "positiveImpression": "M-4 IM faculty are great, heavy emphasis on research and residents tend to publish a lot of case reports. Work load definetly seems manageable and residents all have seemed happy to me. Overall I think this is quite a good program that is improving with each year I have seen it.",
    "negativeImpression": "At times subspecialty faculty seem uninterested in teaching.",
    "comments": "I worked on the FM inpatient side and hopefully the IM team follows clinical guidelines and recommendations more than the FM team does: was shocked at some of the treatment plans with little to no evidence behind decisions made. I declined my IM interview based on my negative experience with the FM team at Javon Bea."
  },
  {
    "nrmpProgramCode": "2247140C0",
    "positiveImpression": "current intern. ovərall very happy with my program. Pros: great people/culture, I genuine|y love my coresidents. good clinical training, NMH is a pretty great hospital and place to work. Chicago is amazing and you can live pretty well on our salary. You get two to thrəe research blocks and people generally match well, lots of GI/cards/onc, awesome resəarch/mentors in every department. Workload is overall manageable, | pretty rarely break duty hours. Our PD is great and you get very good mentoring/attention/advice. With flex days, wellness days and holiday coveragə you get close to 5-6 weeks of vacation in pgy2 and 3 and often can make a vacation \"week \" into 10 days. Plus/minus: our morning report is very good but conferənce can be hit or miss. Working at the VA (25% of time) has its ups and downs lol. No moonlighting tiI pgy3. >> Also a current intern and theres honestly VERY few negative things | can think of. I would choose NU again and again and again if I was in the match this year",
    "negativeImpression": "Very busy intərn year, almost 9-10 months of inpatient - this is good training but you get way less weekends intern year than some peer programs and almost no elective (but then tons of elective in pgy2/3 so thats nice). Going to clinic while on wards can sometimes be annoying. Second yəar can be busy too so lots of people do hospitalist years to do extra reserach before applying to fellowship (though often this is because they genuinely want a hospitalist yəar.) Overall residency is tough but I am happy. +1 << ty for all the info, how many weeks of elective and/or research block are there in pgy2-3? >> 2 months of research PGY2. Can get a 3rd month PGY3 if youre productive >> +1 to difficult finding research time for cards/gi/pulmcrit, multiple residents complain that they get blindsided by mentors saying they need more research when fellowship apps roll around, most end up doing chief/hospitalist years",
    "comments": "Have heard thru the grape vine that current PD is leaving this year FYI +1 Can confirm they stated this in the interview. +2"
  },
  {
    "nrmpProgramCode": "2177140C0",
    "negativeImpression": "Was on an elective here: seems to be a program that over-consults without considering trying to find the answers themselves. Many pointless consults occured on my short time here. The one code I saw was run by a team of nurses and not residents??? Which I was shocked at- not a single resident was present or came by during the code which is the opposite experience I've had at every other hospital. Also the cardiothoracic/lung transplant guy is extremely toxic."
  },
  {
    "nrmpProgramCode": "1147140C0",
    "negativeImpression": "residents have to compete with fellows for procedures"
  },
  {
    "nrmpProgramCode": "2922140C0",
    "positiveImpression": "MS4 - Rotation was enjoyable, residents were all friendly, had good relationships with attendings. Small town but not to far from places like St. Louis. Fellowships in infectious disease and heme/onc (i think?) can be pursued. Noon-conferences as well as ground-rounds so plenty of academic exposure. Edit: 3+1, all in-house fellowships available, low cost of living, boring city, everyone very nice and feel respected. 50% AMG 50% IMG."
  },
  {
    "nrmpProgramCode": "1159140C0",
    "negativeImpression": "Had an IM resident with me during a subspecialty month. Resident openly admitted to leaving at noon and would leave me as an M4 entirely responsible for patient load. Felt I had too much independence with virtually no guidance. Had to adapt really quiclkly which overall helped me but did not help patient care, and demonstrated to me that at least this resident was not a team player. Really turned me off of the program."
  },
  {
    "nrmpProgramCode": "1160140C0",
    "positiveImpression": "Ιntern here. Overall, very happy with this ρrogram. The residents here have been warm and friendly. Residents are more than willing to helρ oμt each other which really suρρorts the aμtonoμous cultμre that we have. Goes from asking qμestions aboμt patients if we're stμmρed to helρing ρlace lines when MICμ is getting slaμmed. There's also a good intergenerational cultμre, jμst becaμse many of the fellows/facμlty are graduates of the ρrogram. Residents comfortable asking qμestions to consμlts becaμse they've known the fellows for years. (Also sρeaks to that μChicago likes to take their own for fellowshiρ). Ι was initially intimidated by the \"workhorse\" reρμtation of the ρrogram, bμt it has not been too bad. There are definitely toμgh days, bμt having a 4+2 schedμle where yoμ are rotating services every two weeks has been very helρfμl with wellness. Even on toμgher rotations, Ι feel like Ι can generally do anything for two weeks. Another ρlμg for X+Y schedμles in general is that it's nice to know that yoμ will be on with yoμr ambμlatory faculty for a stretch when ambμlatory-specific qμestions inevitably arise. That being said, clinical training has been toρ notch -- good volμme with many interesting cases, and if yoμ are a ρrocedure-oriented ρerson, yoμ will have many oρρortμnities to ρlace many, many lines (Ι have ρlaced (or attemρted to ρlace) ~10 before the new year). Moonlighting also starts at the beginning of 2nd year, which seems to decently ρoρμlar."
  },
  {
    "nrmpProgramCode": "1175140C0",
    "positiveImpression": "S-tier meal benefits. Small size if you like that. Rural/small urban focused.",
    "negativeImpression": "Living in Peoria. Nearly entirely IMG program with less than average research opportunities",
    "comments": "Outsider here but the meal benefits are legit something I've heard tell of having never gone to the program. +1"
  },
  {
    "nrmpProgramCode": "1187140C0",
    "positiveImpression": "M4: The residents are all really pleasant, good folks. Eskenazi is a really clean and nice safety net hospital. The team rooms are essentially corner offices with floor to ceiling windows. The VA is a pretty good VA hospital as far as that goes. University Hosp is full of really interesting cases and sick patients.",
    "negativeImpression": "Traditional schedule"
  },
  {
    "nrmpProgramCode": "1203140C0",
    "positiveImpression": "Current M4 here. Extremely nonmalignant. Training is way underrated. PD is incredibly supportive and takes care of his people. The categorical residents seem to be really happy and there's a great culture of collaboration. 90% of GIM attendings are stellar, none are mean. Most of the subspecialty attendings are great, obvi a couple personalities here and there but no more than anywhere else. Also, Iowa City's COL is still relatively low, it's a great place to live. Solid if you're single or not - schools are awesome, night life is bomb, the city hosts so many events. Would be happy to stay.",
    "negativeImpression": "Same M4. Not a good fit if you hate Iowa, though most outsiders are pleasantly surprised at how much they like it. Very bikeable/walkable city, but if you drive then you have to use the hospital parking system which requires parking a ways away and walking/taking the bus which can be cumbersome. The winters are tough - good gear is worth its weight in gold."
  },
  {
    "nrmpProgramCode": "3054140C0",
    "positiveImpression": "Sub-I: When not on long call (every other), you leave when the work is done (2/3). Amazing. LOTs of electives built into residency scheduling. Access to ultrasound and procedures though was not utilized whatsoever when I was there, but have POCUS curriculum. Interesting cases, supportive staff, didactics were good. Attendings are there, but serve a peripheral role with the seniors overseeing interns. Lots of inherent trust and autonomy - good or bad? Overall chill, supportive environment."
  },
  {
    "nrmpProgramCode": "1217140C0",
    "positiveImpression": "M4: home program. The residents here are really good. Most seem fairly happy. Some attendings are not my favorite but others are really great, I guess you'll find that anywhere. I haven't had a bad resident yet at least. All the senior residents I've met are very confident and comfortable running a service. They do a lot of independent work, and the ones who like procedures do them often. It's easy to get exposure to subspecialty fields. UofL inpatient uses powernote and outpatient uses EPIC. Louisville is an affordable place to live and a really nice place to live if you're in the right area. Don't live downtown, it's better to live 5-10 min away and drive than live somewhere close enough to walk.",
    "negativeImpression": "Walking around the hospital is a little sketchy when it's dark. it stays busy with people and the garage is very close so I don't feel unsafe, you just have to be aware of your surroundings. Also they rarely feed us for free and I wish they did, wasn't until interview season that I realized how often other places are getting fed."
  },
  {
    "nrmpProgramCode": "1221140C0",
    "negativeImpression": "Crime is bad"
  },
  {
    "nrmpProgramCode": "1224140C0",
    "positiveImpression": "Visiting M4: super nice and supportive residents that look out for their med students. Attendings all enjoy teaching and are always available to help. Really no complaints, great program!"
  },
  {
    "nrmpProgramCode": "1232140C0",
    "positiveImpression": "M4: home program. This program is very nice and welcoming. The residents are family unit. They have almost all specialties and fellowships. The city has good variety of pathology you'll see. They ahve night float so no 28hr shifts (yay). MICU has 3 different teams that come in at different times.",
    "negativeImpression": "Crime in the city is high. The areas around the hospital are not the safest but the hospital is increasing safety by having more security and cameras.> Way too many residents from India who all went to same medical schools, they have a strong clique together and I had a rough time adjusting with them as an away student.>>MS4 here, would rather go to another program based on my AI experience. The residents are toxic to each other. Super competititve with each other and actively try to make others look bad."
  },
  {
    "nrmpProgramCode": "1225140C0",
    "positiveImpression": "M4 from Lafayette: area is very nice and everything is nearby",
    "negativeImpression": "Visiting M4: was told by multiple residents to not come here if I had other options. Attendings are really hit or miss. All residents seemed unhappy with the current schedule."
  },
  {
    "nrmpProgramCode": "1966140C0",
    "positiveImpression": "Intern: Initially skeptical but fell in love with the program. Good patient acuity, diversity, volume along with a great balance of support from attendings and upper levels with independence. Major referral center. Heavy focus on didactics and hands on experience. Cohort is pretty goofy in a good way. 4+2 schedule with a q5 call schedule which guarantees a day off every 5 days. No 24hr call. Weekly academic half-days. Surprisingly extensive amount of specialized research and fellowship opportunities. You get two 2 week blocks of electives your intern year, with more later. Chief residents seem very invested in our mental health and I feel comfortable reaching out about whatever. Gotta fight for indoor parking sometimes tho :/. Same intern from last year, now PGY-2, saw the negative impression. I feel awful that you had that experience. I'd be mortified too and wouldn't blame you for steering clear. I don't know what to say besides my time here has continued to be generally positive. I've heard how some attendings are too \"chill\" and won't foster any intellectual curiosity or elevate your standard of care beyond what covers their ass, but the program is quick to pull anyone like that from teaching teams if people say something. I had a similar experience at my med school to yours despite all the residents being in love with it and it being regarded as a generally great program, idk what that says about the residents or the program itself but I sympathize. I hope that PNA situation got SOS'd or M&Md",
    "negativeImpression": "Personally I would NEVER recommend this program, ever. I saw the positive impression and felt obligated to say something based on my experience as a sub-intern. Ochsner is where patients and residents go to die. Steer clear of this program unless it's a last resort. <<<<Clarification? << Interviewed there I got posive vibes, can you explain more/give some examples please? << Everyone has different programs that work for them, but my experience was: resident teams were too large (resident, 2 interns, one if not two sub-I, two medical students, one pharmacist, one attending) all trying to shuffle through bedside rounds; with a few exceptions the interns were really behind in their knowledge and not motivated to learn (one intern repeatedly tried to prescribe Vancomycin for uncomplicated UTI's and couldn't explain why to the resident, just \"felt like it\" - which is just, insane - but just an example of how there wasn't a culture of looking thigns up/justifying logic/staying informed); the attendings scrolled their computers while interns/students presented and didn't enjoy teaching other than logging into their MKSAP accounts so we - the students - could help chip away at their re-cert questions for them while they watched, also kind of insane. More patients died in the month I was there than other rotations, do think that was partly due to negligence - like the team missed a really obvious pulmonary infection even though the family was begging for a CXR for days, and a few days later the patient died (from a constellation of reasons but untreated PNA didn't help). In contrast, we had a few VIP patients, Ochsner higher ups etc, who got concierge level medicine and were waited on 24/7, while the other patients really suffered. The refrain from patients was \"we tried to come to Ochsner becuase it used to be the best healtchare, but it's changed\" - and that's how you get patients lying in shit in their own beds while the nursing staff is on their phones, and in my experience how you get disintersted and intellectually lazy interns. Just my experience.",
    "comments": "I was also skepectical after matching here, especially about the board pass rates and fellowship match rates. However this program has been improving year by year. I've had no complaints so far intern year. Our previous 2 classes had a 100% fellowship match rate and board pass rates have been improving as well. For the class of 2023, 5 cards, 2 heme, 2 GI, 2 PCC, 1 nephro, 1 endo. Our home fellowship programs have started to take more and more inhouse as well, especially in cardiology and heme/onc."
  },
  {
    "nrmpProgramCode": "2352140C0",
    "positiveImpression": "Low cost of living. If you like wide open spaces and rural areas than this might be a good fit. One of the few hospitals that serves a lot of smaller communities. As M4 there, I didn't work with any residents but the attending were nice, approachable, and actively taught me through different procedures.",
    "negativeImpression": "IV M4 also from Louisiana: The religious affiliation may influence the care you are able   to provide. When I asked one of the residents if there was any effect, she said no at   first and then said \"...we can't prescribe birth contol...\" and did not elaborate which I   found very odd. Also no fellowships, likely have to venture out. Kind of remote area"
  },
  {
    "nrmpProgramCode": "3073140C0",
    "positiveImpression": "M4: Residents are super nice and smart. Program has a good culture and residents didn't seem overtired. The biggest negative was Tulane Hospital (HCA owned and so under-resourced with no space available for residents to work and low social support services) but now they are closing this hospital and redirecting care to University Medical Center (big public safety net hospital that is brand new and functions much better) and another institution for 2024 (merged with LCMC health). Attendings are kind and knowledgeable. New Orleans is a fun and affordable city",
    "negativeImpression": "Crime is exponentially increasing. Surrounding areas are not safe to walk in day or night. Salary is very low <<<agree with the salary but isn't the CoL quite low as well?."
  },
  {
    "nrmpProgramCode": "1237140C0",
    "positiveImpression": "Current intern here! People are super kind and faculty is very invested in residents. Hopkins faculty and opportunity without the insane schedule of JHH. 5-6 weeks of vacation intern year. Great cafeteria and you get funds on your badge for food. Great primary care / GIM curriculum. The 2 week blocks are great and my schedule averages to about 3+2 overall which is super nice.     Another current intern, agree with all the above. Wanted to add that big strength here is mentorship: the PD/APDs know each and every resident super well, very accessible and personable program leadership, and furthermore leadership literally sits down with each intern and helps hand pick research mentors/projects with you from Hopkins faculty. An extremely mission driven program that puts their money where their mouth is."
  },
  {
    "nrmpProgramCode": "2316140C0",
    "positiveImpression": "M4 - faculty are very nice and open to teaching. Newer program so they are responsive to feedback from residents",
    "negativeImpression": "Toxic and everything is micromanaged. Keeps threatening action will be taken and will be dismissed from the program. It's also a rural area and absolutely nothing to do here. I don't recommand this program unless you are desperate. Only pro is some attendings are very willing to teach and help with research.   New program that is almost exclusively IMG"
  },
  {
    "nrmpProgramCode": "1252140C0",
    "positiveImpression": "Home M4 + did sub-I - loved med school here and IM program is robust. Very friendly, collegial atmosphere with attendings/seniors who care about your learning. Training seems to be top notch especially in ICUs with large variety of path, residents from other med schools/visiting students have commented about high acuity and strong patient-based learning even on floors. Solid noon conferences with free food. Our PD (Dr. Wolfsthal) is legendary and has a great reputation from what I've heard, most of the residents I've talked to are very happy here. Program is very receptive to feedback, recently moved to an X+Y based on resident input. Work hour restrictions seem to be rarely violated, the only 24s that remain are in ICU (q4). Nurses are efficient and competent, there is good ancillary support.",
    "negativeImpression": "Not too many procedures if you are in to that. There is a social worker shortage like everywhere else so some of that work is borne by interns, but overall they help take the load off. Not the best culture of going to noon conferences every day, but some of that is residents just choosing to work through it.",
    "comments": "Can anyone speak to how safe baltimore is these days, esp for a single woman walking in the dark? >>>Baltimore is pretty safe, especially the downtown area where the hospital is. Sometimes gets a bad rap but on the whole it has been safe in Bmore"
  },
  {
    "nrmpProgramCode": "1256140C0",
    "positiveImpression": "Residentimpression: I love my program! Offers pretty good work-life balance, the only Harvard IM program w/ X + Y schedule. Most weeks of the year are spent working ~60 hours a week or less. Our worst shifts have us hit 70, and its very very hard to hit 80 a week. We have access to research/networking throughout the full extent of the Harvard system. Great match list every year even for competitive specialties. INCREDIBLE culture with great supports from attendings, coresidents, fellows. Have called many a stupid consult but have never gotten anything but thoughtful responses from consultants. Program leadership is very invested in resident wellness & professional success, w/ ample opportunity for mentorship & networking essentially all the time. Leadership is very responsive to feedback, have completely changed even ICU schedules based on resident feedback (adding nightfloat & taking away 28s for example). Free lunch every day but weekends    Most rotations are on BIDMC west campus, a handful are over at the East Campus (mostly surgical specialties & clinics otherwise), and a number of residents spend time at other Boston institutions also (Dana Farber, BWH, VAs). Incredibly strong primary care curriculum w/ a variety of options around Boston (some more PoC, some more LGBTQ, some a blend of whoever). Unlike some other Boston hospitals, we have all specialities in-house so you will finish residency having seen a very broad chunk of medicine.",
    "negativeImpression": "boston is so expensive"
  },
  {
    "nrmpProgramCode": "1257140C0",
    "positiveImpression": "M4 impressions: Residents feel positively about the ρrogram and feel νery ωell trained clinically and seem to get along. Good relationships ωith chiefs, admin, attendings overall. Solid match rates to in-house and external fellowships. 3+1 alloωs for golden ωeekends, no black ωeekends on the general medicine and sub-specialty teams, not sure about ICU (PGY3--> one ICU team has black ωeekend, but you get off a ωeekday instead). No midlevel inνolνement in teaching teams (PGY3-> there are NPs on one ICU team, but frankly, they are huge helρ and great at teaching ρrocedures). Food at noon conference ωhile at BMC and VA.    M4 impression: Clinical training is really strong. Major safety net hospital in Boston, one of the busiest EDs in the country, high νolume of international and underserved patients, specialty centers for things like amyloidosis and scleroderma. It’s not uncommon to see some rare and adνanced ρathology. Major focus on underserved ρoρulations ωith faculty ωho really belieνe in the mission and a lot of suρρort services for ρatients in this regard. Teaching from residents, fellows, and attendings has been great for basically of my time on medicine rotations here (haνe had consults take extra time on the ρhone to teach me/interns about the ρatient ωe’re consulting on so ωe can imρroνe on future consults). IM morning reρorts/noon conferences haνe been great for the most ρart and interns/residents actually ρarticiρate (some of the didactics on subsρeϲialty services though ωere… less stellar). Ι belieνe noon conferenced during intern year is ρrotected teaching time. In asking residents about their exρeriences ωhile aρρlying noω as an M4, νirtually all of them sρeak highly about the ρrogram, sρeϲifically that they feel ωell suρρorted and ωork/life balance is fairly reasonable. Strong match for comρetitiνe fellowshiρs and they take a lot of their oωn",
    "negativeImpression": "M4 impressions: BMC does not haνe eνery single sub-subspeciality, as eνerything in Boston is suρer regionalized. For examρle, BMC has Cards and IC but no ECMO, no heart transplant (mostly Tufts?). Also has GI fellowship and adνanϲed endosϲoρists but no liνer transplant (Harνard hospitals?) and no adνanϲed endosϲoρy fellowhsip. Has Pulm fellowship and interνentional attendings, but no interνentional fellowship. Residents (and fellows from ωhat Ι've seen) don't seem to haνe an issue matching to fellowshiρs though. A large ρroρortion of Sρanish/Haitian Creole sρeaking ρatients but this is less of an issue once you get used to using interρreters/interρreter ρhones. Location in South End is a bit difficult to reach by ρubliϲ transit. Housing in Boston as a ωhole is exρensiνe. BMC is not in the greatest area, though safety is rarely an issue and ρeoρle ωho aren't from the area (eνen those in other ρarts of Boston) sometimes haνe exaggerated imρressions of the area. Moonlighting is alloωed but does not seem to be common.    M4 imρression: From talking ωith residents, ρroϲedures are not really emρhasized in IM so you haνe to be νery intentional about it if you ωant them. There is a ρroϲedure team eleϲtiνe, but may still haνe loω νolume for some ρroϲedures (e.g., LPs). Seems to be a νery ϲonsult heaνy hosρital, but ρrobably attending deρendent. Parking isn't free. Rotates at BMC and the VA - Ι dont think there's a lot of exρosure to things like ρriνate ρraϲtiϲe.",
    "comments": "BMC has ECMO run by CT surgery. -->> PGY3 IM here. There is a strong push to involve pulm crit more heavily in ECMO mangement. Great area of growth if you are interested.     <- Interventional pulm attendings without interventional fellowship means pulm fellows get training in advanced procedures without having to fight with other fellows, so a good thing imo"
  },
  {
    "nrmpProgramCode": "1265140C0",
    "positiveImpression": "MS4 away rotation (MICU) - Amazing and supportive residents and fellows who genuinely care about supporting your learning and your passions. Residents seem to have relatively good work-life balance due to alternating long and short call schedule. Attendings are always there if you need them but really encourage the fellows and seniors to run the show. Support staff is absolutely incredible. Good volume of procedural opportunities (LPs, feeding tubes, central lines). Nursing, respiratory therapy, and pharmacy will even go out of their way to teach you. TONS of free food (catered lunch every weekday, attendings/fellows bringing snacks, etc).",
    "negativeImpression": "Noon conference isn't protected, even on General Medicine floors. Some residents have to do a \"corkscrew\" schedule that alternates days/nights which sounds absolutely horrible. Oh... and the whole Dana Farber thing :'((",
    "comments": "To clarify, the PD said the dana farber thing wont affect BWH residents until 5-7 years and they said they would be maintaining some type of partnership w them regardless +1    thoughts on BWH's general IM training? Since it is in a city with so many other hospitals"
  },
  {
    "nrmpProgramCode": "1268140M0",
    "positiveImpression": "Great for bread and butter medicine with 1:1 education and training from Harvard appointed faculty.   4+2 schedule with generous golden weekends (unless you are on back up, but historically low call-in rate).   Opportunities for procedures as there is a group chat among residents to notify of procedures to complete. Pilot POCUS program to expose residents to POCUS practice.   On wards, cap is 8 for interns and 16 for the team which is usually comprised of 1 attending, 1 senior resident and 2 interns with HMS student and SUB-I joining throughout the year.  Tuesday school is the afternoon conference runs from 1-5PM, lunch included and it is protected. Attendings carry pager and have suport from PA covering admissions.  Resident wellness is a high priority and leadership is always willing to work with residents.   Call schedule is 630-6 for wards, 730-8 for ICU, 6-6 for night wards, 730-8 for night ICU. Short call stops taking asmissions at 2PM, Long at 5PM and they alternate between teams.   Weekends off during elective (unless on back up) and Ambulatory.   4 week Cardiology rotation at BIDMC  Seamless process to consider electives at BIDMC, not as seamless but doable at other med centers in the area.   Uber account for work-related rides",
    "negativeImpression": "Only medicine ICU.   For higher level procedures ie Cath, pt get transferred to tertiary centers."
  },
  {
    "nrmpProgramCode": "1261140C0",
    "positiveImpression": "Anyone please? would love to hear more about this program! <<< I heard it's a decent hospital<<<i heard they see some interesting patients and sometimes do research. <<<<< Worked at MGH in Heme/onc research for 6 years. It's a solid hospital obviously. You'll meet some ridiculously smart people. And benefits were great, with an awesome gym right behind the hospital. Cafeteria food was great in my opinion. I can't speak to resident-specific experience or benefits though"
  },
  {
    "nrmpProgramCode": "1812140C0",
    "positiveImpression": "?"
  },
  {
    "nrmpProgramCode": "1269140C0",
    "negativeImpression": "Lot of scut work at this hospital << Please elaborate what you mean by scut work and when this was the case for clarities sake, I appreciate the information! <<< This hospital has far less ancillary support than at other hospitals. The residents/medical students often have to draw their own labs and transport patients etc"
  },
  {
    "nrmpProgramCode": "1266140C0",
    "comments": "Had multiple rotations here during M3. Was really toxic and very scary medicine. Had attendings literally yelling at each other in the middle of the floor, extremely rude to residents (particularly in the ICU), etc. Have classmates with similar experiences there during rotations. So if you're interviewing, defintely try to sus out how the environment and how residents are treated"
  },
  {
    "nrmpProgramCode": "1263140C0",
    "positiveImpression": "The new program director has made many changes for the better. Our residency program is expanding, more non-teaching teams are being built to alleviate teaching teams, dedicated back up systems, 3+2 schedule for interns, 9% salary increase, 5k stipend, etc. In addition, we just opened a new liver transplant center and continue to grow our heart transplant center. As residents we all get along and learn from each other. Our hospital is very busy and we serve a lot of patients from disadvantaged backgrounds."
  },
  {
    "nrmpProgramCode": "3050140C0",
    "positiveImpression": "M4 impression: Great program! All the residents get along very well and the PD is super invovled. He attends morning reports daily as well as some noon lectures and always available for anything you may need. Attendings were all amazing and really wanted to teach. All attendings were keen on giving med students and residents feedback on their last day of the rotation. The program truely gives you a family feel. Lots of medical students on in patient teams that integrate well into the structure. Intern cap is 8 w/ no 24 hour shifts.",
    "negativeImpression": "You can get up to 4 admission per team and can go until 5:00 pm so some days can be there super late"
  },
  {
    "nrmpProgramCode": "1930140C0",
    "positiveImpression": "pd is really cool",
    "negativeImpression": "not as much research opportunities"
  },
  {
    "nrmpProgramCode": "1303140C0",
    "positiveImpression": "diverse pathology",
    "negativeImpression": "not as much research opportunities"
  },
  {
    "nrmpProgramCode": "1915140C0",
    "positiveImpression": "I rotated here as a medical student. It's a nice hospital. Most of the attendings are incredible teachers and are very down to earth. However, will be some outliers to that as well. Pathology is pretty diverse as well, but a lot of the cases are also bread and butter medicine. Residents are very friendly and have a great comraderie amongst each other. Residents for the most part seemed happy. q6 short call until 8pm. Good ancillary services - labs and orders are typically done on time. With hospital's location being in both Gross Pointe and Detroit, will see mix of both an underserved population requiring extensive social care and also wealthier patients.",
    "negativeImpression": "It's not a block schedule, thus sometimes you can get unlucky and have 3 straight months of busy services such as Floors, ICU, Floors. When you're on floors, there's a day called \"Day-Hits\" where you can take up to 4 admissions from 11-3, and this day can get extremely busy. On short-call teams cap at 3 admissions from 3PM to 7PM. And then on post-call days, team can get up 7 new admissions from the night which leads to a hectic morning. The rest of the days are pretty chill."
  },
  {
    "nrmpProgramCode": "1978140C3",
    "positiveImpression": "Good supportive work environment. Everybody is friendly and down to earth. The PD looks scary but is in fact really nice and has great conversation. The training is solid, attendings are great teachers. It's nice to see a great DO program, and they take their own for fellowship as well. I believe they only interview people who did a sub-I"
  },
  {
    "nrmpProgramCode": "1978140C0",
    "positiveImpression": "Pgy-1: Extremely happy with my decision to come here. It's a tertiary center with plenty exposure to lots of pathologies (only 6 months in and I have three case reports and a research project in the works) Schedule is very manageable. Sure, there are tough months (micu) but co residents, fellows, and attendings are very supportive. No 24 hours call. Faculty is awesome and responsive to resident feedback. Access to many fellowships. Safe area and affordable living. Lots of cool little downtowns to explore and bunch of stuff in Detroit as well. Happy I get to spend time with my loved ones outside of work. Truly feels like I get a little bit of everything at this program."
  },
  {
    "nrmpProgramCode": "1361140C0",
    "positiveImpression": "Current resident here. I think it's a good program overall. Given the location and population we serve, you will see a ton of unique and advanced pathology and we have all the major subspecialties for fellowship except for maybe Allergy/Immunology. Our PD has been in her role for about a year now and has been pretty responsive to resident concerns and you can tell she cares about the program and seeing it grow/improve. The camaraderie between residents is also pretty good for such a large program, probably due to the cohort system we have--we interact between cohorts but it's almost like a \"program within a program\" so you get to know certain people well. As far as how academic different rotations are really depends on the attendings, but if you take the initiative you'll find mentors to help you with research and fellowship match, and most attendings do enjoy teaching. Schedule-wise, we are 4+1 and clinic weeks are usually pretty chill; we do a lot of floor months during intern year, and it is a combination of luck and time of the year that dictates how your list will look. There have been months where I capped and months where I saw maybe 2 patients per day. As an aside, the various DMC programs are currently actively in the process of unionizing and the NLRB case that was the hold-up just got ruled in our favor, so if everything goes through, a lot of us are hoping that some of the more negative aspects (ex. salary, staffing ratios, etc.) will be improved.",
    "negativeImpression": "anybbody have feedback?"
  },
  {
    "nrmpProgramCode": "2106140C0",
    "negativeImpression": "40% board pass rate, offered interviews to many applicants last year and then recinded them without notice and would not answer phone calls/emails regarding them"
  },
  {
    "nrmpProgramCode": "1300140C0",
    "positiveImpression": "Great clinical training with sub-specialists as your attendings on the specialist floors. Usually 2/3 interns + senior for 12-18 pts a team, and 2 teams per floor. Currently half day of clinic a week but rumor has it intern year schedule is being revamped to better separate IP and OP duties (hopefully X+Y?) and also a push to change 24hr shifts in the ICU to day/night shift work. Daily lunch for noon conference + food stipend is nice, especially with a schwarma stand in-house. Program admin do care about resident wellness and trial new ideas from resident feedback. Also, they are good at reviewing program policies they can change and work on advocating when they are not in control of an issue. My resident class gets along well and are always ready to help each other out. Switching admitting shifts to avoid admitting shift/clinic day combos is usually never a problem. Use of Jeopardy (backup) system is encouraged when needed so you aren't trying to power through a shift feeling sick. Using EPIC is *chef's kiss* and Detroit is having a really nice renewal in its downtown core and several core neighborhoods. A lot of the IM faculty trained at the program which is a good sign. In-house library/statistician services are top notch- they will perform lit reviews with summaries for you!, excellent match rates particularly in cards/gi/ID/pccm",
    "negativeImpression": "Definitely work hard, as that's where all the comments regarding great clinical training come from. Admitting shifts vary between chill to several admits hitting the floor at once. While interns always have a senior available, it can feel overwhelming at times. IM being the backbone of a tertiary referral hospital comes with great and rare learning opportunities, but can also come with the stress of complex and severe cases. Jeopardy (backup) coverage, by nature, can sometimes feel unfair with some people never getting pulled and others being pulled to cover weekend/admitting shifts (although this is probably true for lots of programs). It's up to the resident to establish boundaries on nursing calls and respond to messages, as the urgency/severity varies wildly. With how much work you do moonlighting opportunities are limited.",
    "comments": "During my interview it is confirmed that they are moving to an X+Y schedule"
  },
  {
    "nrmpProgramCode": "1951140C0",
    "positiveImpression": "M4 - Everyone is really friendly, overall good vibes. Ongoing construction that was supposed to be done like 2 years ago but the parts that are done are very nice. Decent exposure to procedures. Didactics seems fairly robust. Lots to do outdoors in the area but obviously it gets cold and snowy in the winter. Family friendly kind of town and affordable COL.  --M4: Affordable and very nice-housing is offered to the residents at a hospital-owned apartment building (pet-friendly); I was impressed with the gym in the clubhouse! It seems if you wanted to be a hospitalist and were not interested in fellowship, this is a VERY solid program for that.",
    "negativeImpression": "Definitely a hospital that kinda depends on residents for shit to get done. All IM residents in the hospital are expected to respond to all rapids/codes and while it's good experience, it's an unnecessary disruption to the day - I think that this is fixable though. Not the most happening town if you're looking for a lot of culture/nightlife. Requires residents to wear white coats. -Asked me tons of illegal questions during last year's interview. Promised I would have a hard time matching any fellowship if I attended their program, DNRed  --Just adding on to confirm, multiple attendings and residents have said if you are fellowship-driven, this is not the place to come"
  },
  {
    "nrmpProgramCode": "1951140C0",
    "comments": "***See Lakeland Health above, I believe this refers to the same program"
  },
  {
    "nrmpProgramCode": "1292140C0",
    "positiveImpression": "pd is super cool"
  },
  {
    "nrmpProgramCode": "1418140C0",
    "positiveImpression": "anyone????",
    "negativeImpression": "Does not rank/interview people with strong ties to the area. Suspicious amount of single race PGY-1 docs (Only Indian PGY-1s with Indian PD) https://www.trinityhealthmichigan.org/graduate-medical-education/livonia/internal-medicine /residents <<< seems like a diverse residency program to me PGY-1 has Pakistani, Sudanese, Carribean and UAE med school graduates too !!!!"
  },
  {
    "nrmpProgramCode": "1293140C0",
    "positiveImpression": "M4: Union is extremely effective and newly negotiated COL:salary is very competitive. Dope food stipend. (<<< disagree $100 is not enough for the whole year) On days you have continuity clinic, you don't have to come in before or after clinic. You do have to pay for parking, but it is subsidized for residents. At least on Gen med blocks, very good culture of signing out early on non-call days. Very minimal 24h call (I believe only in the VA MICU).",
    "negativeImpression": "Last year's thread had an exclellent list of the cons. Many of which are still present. I will add that as a current intern, many of the gripes I have about the program pale in comparison to the things i hear from friends at other IM programs.    From 21-22 CONS: 1) intern year is extremely busy - most places have a busy intern year, but the intern year here is something special. You are very well supported and always have help, but the program is very inpatient heavy. This will make you an excellent doctor by the time you reach the spring, but the beginning can be a large learning curve. 2) outpatient primary care training is abysmal. This is a program that excels for people interested in hospital medicine or fellowship. I would not come here if you want to do primary care. 3) traditional schedule system as opposed to X+Y -- can get tiring with not having pre-set weekends while on inpatient, but I actually enjoy the traditional model as we usually dont have clinics scheduled during heavy inpatient months. If you are in clinic on inpatient, the norm here is to give you the half day not in clinic completely off, which essentially gives you another day off to sleep in. X+Y and traditional both have their down-sides. 4) ann arbor isn't for everyone. I enjoy it, but it is a moderate sized college town and not everyone likes it. <<<The biggest con which idk how nobody has mentioned yet...Parking is horrible. YOU HAVE TO PAY FOR PARKING. There's technically free parking available but it's impossible to find a spot so everyone pays. To counter the pay for parking point, which is true, Due to having a union the pay to cost of living ratio is one of the best in the country, so you'll likely be net up. <<Maybe kind of a hot take but it feels like several things are missing from Michigan to the point where even though you're technically net up it's not as much as it feels like it should be. Pay for access to the wellness center (gym), pay for parking, the meal stipend is significantly less than other programs, COL is still above the national average<Anyone have updated comments on OP training at Michigan, they have a PC track that has a good number of residents."
  },
  {
    "nrmpProgramCode": "1314140C0",
    "positiveImpression": "M4 - The emphasis does seem to be on learning overall - residents, especially interns, don't seem terribly overworked, and didactics feels robust. The residents don't seem to be the tightest knit group I've ever seen but not like they hate each other or anything.",
    "negativeImpression": "Some of the faculty think they/the institution are a bigger deal than they actually are. The caliber of residents seems pretty variable. Kalamazoo is okay but not great."
  },
  {
    "nrmpProgramCode": "1329140C0",
    "positiveImpression": "Residents are well prepared and confident due to large degree of autonomy. Strong fellowship match for community program. People are approachable.",
    "negativeImpression": "Workhorse program"
  },
  {
    "nrmpProgramCode": "1328140C0",
    "positiveImpression": "< How much vacation time do you get? we get 20 days! 5 days at a time x3 and then the additional 5 days you can split up current intern here and I literally googled this spreadsheet to write how much I love Mayo. I considered places all over the country and now two months into intern year I cant imagine being anywhere else - these people do it RIGHT let me tell ya. When I was applying, a lot of people let Rochester deter them from applying (midwest, cold, less to do than a big city) but even if you end up absolutely hating Rochester I promise you it's worth the three years at this program. You can always go elsewhere for fellowship or to practice. residency is hard and very transformative and it's so important to be at a place where you will graduate with more excitement for medicine rather than burnout. always happy to answer questions! +",
    "negativeImpression": "intern here- impression I got is that seems like it is difficult for our residents to transition to fellowship at other institutions given our unique model and that some fellowship directors are less likely to rank Mayo applicants because of this<<<what is the unique model? <----- trained at Mayo for IM and disagree with the statement. Was ranked to match at multiple institutions outside of Mayo and the residents here are recruited by institutions all over the country. Lots of different factors go into fellowship decisions and moving is not an easy decision when people start having families etc. If you'd like to go somewhere outside of Mayo you should have plenty of connections and help getting interviews and people making phone calls for you. I know from my class residents get interviews all over including other great institutions in the Midwest as well as California and the NE, however many will either stay within the Mayo system because of how great the programs are of they may choose to go closer to home. Based on my experience (having recently gone through the fellowship match) you will be set up to do well and should have a lot of great connections leaving Rochester.",
    "comments": "Can any med students or residents comment on the residency program culture, where do most residents fall in terms of happiness/satisfaction once Rochester is factored in <---- PGY-3 here not from MN or the midwest: Culture is outstanding and I have loved my co-residents (all super talented, kind, and excellent which makes for a great working environment) and attendings. Tons of support in outpatient clinic with your own personal secretary, Doc of the Day, nurses who triage calls for you and pend orders, and in-house specialists to call and message if you have any questions. For Rochester itself: it has been pretty good living here. I am not used to the weather but have found a good amount to do. Locally there is Berry and Bloom where you can go get fresh flowers on a farm in the spring. There is also blueberry picking season where you can go pick fresh blueberries and eat them off the bush. It is a lot of fun! Also there is Quarry Hill Nature Center and Zollman Zoo at Oxbow Park which is this really cool little zoo with animals rescued within Minnesota. They have otters, bald eagles, and a cool black bear among others. The Rochester Athletic Club has indoor pools and a nice outdoor pool which is great for little kids if you have them but they have nice snacks you can get and lounge during the summer time. Breweries include Thesis Beer Project (really good beer even compared to placed with big brewery culture like Richmond, VA etc.) and Little Thistle. Some of these places have curling lessons. There is apparently something called boot hockey which I have not gotten into. The Minnesota Twins and Wild games are fun. Locally they have a summer league for the Northwoods Collegiate League (Rochester Honkers) which is pretty fun. Caribou Coffee has good drinks and if you are trendy you can go to Steam (the coffee is SUPER strong though lol but it is good). Favorite breakfast spot would have to bee Hollandberry which is delicious, they have greats eggs benedict. Fun days trips: Austin (SPAM museum was actually pretty cool haha and its free), Red Wing, Lake City, Stillwater (beautiful and basically a Hallmark movie in December), Minneapolis/St. Paul — cool Minnesota Children’s Museum if you have small kids and they have an awesome place called Como Zoo which I’ve taken my son to multiple times and he LOVES it. The National Eagle Museum is Wabasha and you can also go to multiple pizza farms and Nelson’s creamery accross the way in Wisconsin. They also have a few pizza farms close to Rochester which is really fun. Grandma’s Marathon is held in Duluth with is great. Duluth also has a ton to do for a weekend trip and you can visit the Great Lakes Aquarium. I’ve taken a couple trips to the North Shore and it is a blast. I’ve never done anything like it before coming up here but it is so much fun. Look up Gooseberry Falls, Split Rock Lighthouse, Betty’s Pies (real deal), Pallisade Head, Grand Marais (beautiful artists town, get Java Moose, Happy Hippie Tacos, Voyageur Brewery, Best Donuts in the World, also a very cool independent book story there Angry Trout, and hang out on the harbor watching the sail boast go by), Sugar Loaf Cove, Iona Beach (best place to skip rocks in the world). Ely and Boundary Waters have some of the best camping and canoeing in the world (features in National Geographic. I have also gone on trips to Dubuque, Iowa about 3 hours away on a regular weekend and that was probably the best farmer’s market I’ve ever been to. Rochester has a farmers market and it is okay. Flapdoodles in Rochester is honestly the best ice cream I’ve ever had. We also recently had a new playground built by Cascade Lake which is probably one of the coolest playgrounds I’ve seen in a while and my kid loves it. Lake Minnetonka is a fun day trip to spend some time outside and you can head down to Excelsior for some good food like Lago Tacos. Finally, you can go to Whitewater State Park for a day trip for some great hiking and spending time out side. Oh yea, also Bledow Bakery in Winona is the best bakery I’ve visited in all my travels in MN. I’ve tried to make the most of MN and there is a lot to do actually that is very different from what I am used to but I’ve had a good time. As for the program, I’ve loved it and could not imagine myself having gone anywhere else. It gets cold in January and February but the roads are kept clean and you don’t actually have to go outside because there is a subway system at the hospital. If you are really tired of the weather after three years but love Mayo (which many end up staying on since it’s such a great place to be long term) you can go to AZ or FL (beautiful, innovative campus with a ton of growth near the beach in an underrated location — Jax has a great quality of life and is awesome for young families). Let me know if there are any questions!\"\""
  },
  {
    "nrmpProgramCode": "1957140C0",
    "positiveImpression": "did a visiting sub-i here; all of the residents and faculty here were very nice and approachable! PGY3 on my team was the best upper-level IM resident I have ever worked with (I'm USMD who has done 2 away rotations + 2 programs within the LSU system aka my home program) <- any negatives? How was Jackson? <<- Do they still not have potable water? <<<- Nope <<<<<Also did a visiting sub-I here as a USDO. some of the residents were better than others which i'm sure is the case in any program and they probably treat their co-residents better than their med students. love the current cheif residents. there are a few seniors I wasn't a fan of, not very friendly but I loved the current interns I met. the city isn't great especially near the hospital. a nurse was mugged in the hospital parking lot the week prior to my sub-I but they did up the security. the suburbs are where most residents live and are nice enough. not a lot of night life there but there are plenty of food options. the hospital has it's own water system so thats nice to know lol. you will get great training there as the population is pretty unhealthy and there is a ton of diverse pathology. < thank you, lots of valuable info there!"
  },
  {
    "nrmpProgramCode": "1362140C0",
    "positiveImpression": "MS4 doing a rotation here. Resident culture seems great, they all seem to get along really well. Haven't had any bad attendings yet. $18 per day meal stipend."
  },
  {
    "nrmpProgramCode": "1994140C0",
    "positiveImpression": "Current intern. Overall I like it. Schedule is manageable, faculty are mostly nice. PC keeps track of things for you. Definitely not competitive/malignant culture, people are nice"
  },
  {
    "nrmpProgramCode": "1353140C0",
    "positiveImpression": "Current 2023 PGY1. Love it here, great 4+2+2 schedule and great learning environment. Faculty generally laid back and plenty of opportunity to pursue interest outside of medicine / direct patient care.",
    "comments": "The schedule here is awesome. 4+2+2 means roughly 26-27 golden weekends a year. Some residents have 10 weekends off in a row. They are a super happy bunch. < I interviewed here and it went...normal? pleasant conversations. I was wondering what kind of feeling you had after yours and any \"signs\" that they may rank you high."
  },
  {
    "nrmpProgramCode": "1372140C0",
    "positiveImpression": "Student impression: residents are happy and very non-malignant program. Attendings are wonderful and approachable. Comfortable environment and residents are generally very chill and nice to each other and med students. Night float system is great and residents speak highly of it.",
    "negativeImpression": "Traditional schedule not ideal, but speaking to residents they say they have very good work-life balance regardless."
  },
  {
    "nrmpProgramCode": "1376140C0",
    "positiveImpression": "MS4 here: this is a great program. Residents are happy, program leadership is brilliant and kind. Very family oriented, lots of married or married with kids residents. Low COL area and Omaha has gotten a lot more interesting in recent years, above average restaurants for a midwestern city. Bar scene is more meh and not a lot to do, though."
  },
  {
    "nrmpProgramCode": "2028140C0",
    "positiveImpression": "Love the inpatient schedule. Q4 call where you stay in the hospital 7a-7p. On non call days you get out earlier, some days the residents are out by 12 and just take pages from home. You don't feel exhausted from wards because of the schedule, although you only get 4 days off for the entire month. Q12 night float on the same team for interns (falls on a call day so the day call team admits until 7, then night intern takes over and admits overnight with morning rounds with team attending). They will be changing to 4+1 next year too. Residents are all nice, great to work with, friendly and get along well with each other. The attendings I have met so far are all nice as well. Patient population is very interesting and you see a lot of truly sick and underserved patients as UMC is a county hospital. You'll learn how to handle difficult patients and social issues, which is just part of every IM residency experience.",
    "negativeImpression": "Hospital badly needs to be renovated. It looks very, very old. Not the nicest facilities, main resident room is full of clutter and crowded by people so it can be hard to find workstations (you get remote access though). I think there are additional resident facilities in a separate building by the hospital but it is not attached to the hospital and you will need to walk a good distance to get there.     Support staff are hit and miss, some are super helpful others are too overworked to care about your request, some are just indifferent and unapproachable    Toxic subsepcialist environment who are known to give residents a hard time with consults. One resident said she would love if leadership was able to stand up more for residents. Residents dread rotating at a certain department because of the environment and how they are treated.     BAD food stipend. Like seriously they give you pennies for food here. Also don't think residents have physician's lounge access as I have never heard a resident mention a physician's lounge or seen one get food from there. If this is important to you then DNR."
  },
  {
    "nrmpProgramCode": "1377140C0",
    "positiveImpression": "PGY-1 here at Dartmouth! I am so happy here it honestly really lives up to the collegial rep it has. Everyone is like so insanely kind and the PD Dr Atkins (best known to us residents as Graham-hes quick to correct us if we call him Dr Atkins lol). All of my coresidents are all super close and everyone hangs out outside the hospital. Every attending is super nice and clearly enjoys teaching. One of my intern friends broke their ankle and one of the attendings was pushing him around in a chair the first day on rounds lmao goes to show there is zero ego here and everyone is super happy. The fellows are great too and all of the senior residents are happy and helpful and insanely approachable. The schedule is overall cush compared to other programs and we get 6 weeks of vacation if you include 5 flex days we get. Its also a traditional schedule so there can be stretches of 4+ weeks where you are on a chill elective. i would say the only down side is the location-theres really not a whole lot to do and if you are single and not currently already dating someone the dating scene is brutal. Overall though the upper valley is a very relaxing place the live and the culture here prides itself on being super collegial and laid back. Also wards are tough starting out because all interns start out carrying 9-10 patients and we are usually capped at 10 unlike some programs where interns start out managing 6 patients and work their way up. Also, the patients here are super complex so 10 patients is a lot to start out with. You eventually get better but the first few weeks of wards are really tough. Attendings and seniors are reallllly nice though and there is no toxicity so at least you dont have to worry about that <<another PGY-1 here, would like to echo the sentiment. It's been great here thus far. PD and coordinators are super nice and helpful. All three classess (PGY-1-3) get along well. Elective and outpatient blocks have weekends off. Happy residents and good vibes thus far. >> Another PGY-1 here. It's a gem of a program. Unique positives: our PD is incredible, true advocate for residents which is rare and can't be overstated how important it is. It's really beautiful here and if you like the outdoors you'll love it here. There's no traffic, everyone lives close to the hospital, which makes life a lot easier as a resident.",
    "negativeImpression": "PGY-1 (#2 from positives) - Downsides are that the area doesn't have as robust of resources as a big city, though the area has more infrastructure than I had expected prior to moving here. Would say that the Traditional longitudinal clinic schedule can sometimes be tough during busy inpatient services, though it has upsides like increased autonomy over patients and better continuity. >> MS4 here at Dartmouth- the downside about being traditional schedule is changing now, it will be X+Y next year for the new class!"
  },
  {
    "nrmpProgramCode": "1394140C0",
    "positiveImpression": "PD is incredible. Best PD i've come across the interview trail"
  },
  {
    "nrmpProgramCode": "1408140C0",
    "negativeImpression": "did a rotation where PD was the preceptor - she did not make eye contact with me or acknowledge me at all. made it a point to pretend i didn't exist, seems like this is the norm for her +2 I too did a rotation with the PD and she wouldn't respond to my questions and acted like no one was speaking. On interview day, she seemed great and engaging but her true colors were shown on rotation.",
    "comments": "<-- med student clerkship director also does the same, don't know why they think this would make students want to come there. PD and Clerkship director single handedly undoing all the good work the residents do"
  },
  {
    "nrmpProgramCode": "1390140C0",
    "positiveImpression": "anyone??"
  },
  {
    "nrmpProgramCode": "1392140C0",
    "positiveImpression": "anyone??"
  },
  {
    "nrmpProgramCode": "2391140C0",
    "positiveImpression": "Pay recently increased from among lowest in state <<lol why is this the only positive",
    "negativeImpression": "Current resident here. Was excited to match here in the beginning. Over 2 years I wish I was somewhere else. Program has taken my spirit from me.  - The program is losing faculty at an accelerated rate  - The faculty that remain including APDs dont care anymore. One APD became VP and now only cares to make hospital money and advance own career  - Lectures are geared towards billing and making hospital money instead of medicine  - No neurologist, rheumatologist, endocrinologist on staff  - Horrible fellowship match rate. PD/APDs did not care to submit LORs on time despite being told month in advance  - Hospitalist service is mostly LOCUMs who dont care or teach. If they do teach, often is incorrect information  - When on wards often work 13 days in a row. On weekends no patient cap (have had 20 plus patients on my own list)  - Are going to lose prelim help due to discontinued contract with outside program, will result in more work with less help  All programs have their pros and cons. This program has many more cons than worth it. Please avoid."
  },
  {
    "nrmpProgramCode": "3211140C0",
    "positiveImpression": "??"
  },
  {
    "nrmpProgramCode": "1962140C0",
    "positiveImpression": "Attendings/fellows/residents have all been very nice so far. Really like the leadership and environment."
  },
  {
    "nrmpProgramCode": "1414140C0",
    "positiveImpression": "Very family-oriented culture among the residents"
  },
  {
    "nrmpProgramCode": "2113140C0",
    "positiveImpression": "M4: residents are friendly, PD is intelligent and open to change, program is on the rise and work hours/resident life are chill"
  },
  {
    "nrmpProgramCode": "1420140C0",
    "negativeImpression": "Shit hospital that all the Caribs go to"
  },
  {
    "nrmpProgramCode": "1994140C0",
    "positiveImpression": "Extremely social program (weekly happy hour in different bars in the UWS/Harlem/Washington Heights with pretty good turnout + random other social events all the time, lots of opportunities to pursue hobbies with other residents (e.g. our soccer team “Goals of Care”)). The two attending system (one hospitalist and one specialist) is cool when it works well, and having sister teams mean that you hear double the new patient presentations (good learning), but split up to round on the old patients, so rounds don’t last that long. Days off are always on weekends on wards (huge for quality of life), and you have one golden weekend per month of wards. Quality of residents is overall very high (a lot of residents here could have gone to any program in the country they wanted, but chose to stay in NYC for personal reasons and Columbia was the best option). Lots of autonomy (e.g. residents run all the codes and ICU triage, PGY-2s lead rounds in the ICUs, interns get first dibs on procedures, attendings tend to be pretty hands off), so you graduate feeling very ready to practice autonomously. Good amount of procedures (paras, central lines, LPs... we had interns who were signed off on paras month 1). Not toxic at all. Also the benefits are really good- good salary + $2000 in Lyft credit annually (includes bikes) + $180/month for cafeteria/Starbucks + free breakfast and lunch daily + egg freezing. Very supportive culture overall.",
    "negativeImpression": "While it hasn’t been as bad as what I was expecting based on the rumors (e.g. I’ve never had to draw blood) and I’ve heard that it’s gotten a lot better in the last few years, things in this hospital will randomly just not get done. If you order an important scan, you have to escalate it in a dedicated chat; if you order a stat lab, you have to message the phlebotomist (who often won’t respond). For ICU or vented patients, by law, have to have MD accompaniment to scans which is annoying time suck. Very heavy on critical care (even when you’re on general wards, because you’ll often be managing very sick patients on the floor), less primary care-centered. Most of the patients in the outpatient setting speak Spanish and it can be hard to connect with them if you do not, though they'll love you if you do speak Spanish. There is a lot of autonomy but sometimes it feels like you are on your own for things and it can be very stressful and hard to manage. Also volume is so high that its easy to feel like you aren't learning anything and just trying to stay afloat.",
    "comments": "horrible cafeteria, if you can even call it that"
  },
  {
    "nrmpProgramCode": "1422140C0",
    "negativeImpression": "shit hospital <<<on god",
    "comments": "can you elaborate please?"
  },
  {
    "nrmpProgramCode": "1492140C0",
    "positiveImpression": "Cush intern year. Supportive co-residents and faculty. Felt the transition to PGY-1 to PGY-2 was relatively seamless and felt prepared. 1:1 intern to resident ratio is nice for everyone involved. // Agree very much on supportive faculty, environment. People here are the strength. Attendings emphasize teaching on rounds. Leadership (PD, APDs, Chiefs) is great, actively seek feedback on how to improve the program and make changes every year. Our program coordinator Margie is the best. Fairly easy to switch to Primary Care track if you decide so, otherwise categorical is inpatient heavy. Exposure to people all across socioeconomic spectrum (undomiciled -> oil tycoon), has been very helpful learning, though not so much language diversity. Likely the least scut out of all NYC programs, this is a significant pro. Safe and relatively quiet part of Manhattan. Cannot go wrong coming here // Would echo the supportive co-residents and faculty. In general NYC programs are known for being busy but we are pretty ubiquitously known as the \"cush\" program of NYC. Living in NYC is literally the best but if it's not something that is alluring to you would probably pick a non-NYC program as there are many quality programs where you won't work as hard. The con about little elective is true but the program is actively working to increase elective/outpatient time and in general is responsive to feedback.//Not sure how language diversity is being defined because I've had to use Pacific Interpreters on a daily basis. In contrast to a place like Columbia where almost everyone speaks Spanish it's been a pretty wide spattering of languages rather than a concentration of a specific one.The culuture is amazing among residents and faculty is so supportive, I decided to pursue a competiive subspeciality later in the year and was immediately connected with so many people and opportunities.",
    "negativeImpression": "Very little elective time, some of the lowest in the country compared to peer institutions. 2nd year is not X+Y and is brutal (1st year is much more cush and some may argue a front loaded residency is better, so can be viewed as a negative). Very inpatient heavy, not great if you are interested in outpatient medicine or want a better schedule. Extremely difficult to find a quality mentor (research or just in general). Most of the residency clinics are a disaster. // Intern year relatively cush, but if anything schedule gets harder as PGY-2 & 3, this an even-throughout to arguably back-loaded schedule. Personally would have preferred front-loaded, exhausting to be PGY-3 and doing all those inpatient and ICU weeks. It is a complete myth that Cornell is cush, that's just relative to other NYC programs since we have better (if not the best) ancillary support in NYC. Overall, it's just intern year that's a little lighter, over 3 years there's some of the least amount of total elective time and lots of floors & ICU. Lots of support when on service, downside is delayed autonomy, as PGY-2 there's usually a PGY-3 on same team discreetly looking over your shoulder. In the Cardiac ICU, as PGY-2 you are still fully in the intern role, writing the notes, being first call, running decisions by PGY-3 who is directly supervising you the PGY-2. As ICU Triage, there is almost no decision made without running by fellow and attending (probably better for patients, personally I like it as it's good learning). ICU attending shows up to nearly every code, even overnight, so can get to PGY-3 and only have run 1-2 codes independently (excellent code simulation & training here, and they're great about letting residents run the code, but if you mess up, either fellow or attending is taking over. I like it but if you're looking for early autonomy this is not the place. if you prefer very close supervision this program is perfect). NYC scut is real, orders don't get carried out, labs randomly don't get drawn, I/Os don't get tracked, daily standing weight is a joke (they're not daily, and they're not standing). Have heard this is leagues better than other NYC programs, here only need to push a patient bed when truly urgent, never done a lab draw, though a few residents have. It's not terrible, also definitely there, adds an unnecessary hour to my day if not more. if you have equivalent options elsewhere, and no strong need to be in NYC, it's not worth it. but if Manhattan is a priority, should be at the top or near top of your list",
    "comments": "Did a visiting rotation here, all the interns I met who were only a few months into residency said they were exhausted and burnt out and two, unprompted, said they just wanted to go home and cry sometimes // Yes, the crying happens, I actually think it's healthy that people talk about this, and I definitely give our PD credit for creaing an open culture where people can talk about the crying in an open manner. I also wonder if the crying is an inevitable part of intern year, it's an overwhelming time, and I'm not sure it would be necessarily better at other programs. In fact, I think our program does an outstanding job of making interns feel supported (Some may actually say too much, leads to delayed autonomy). My main negative is that I just got burned out, from not enough elective time, too much inpatient time, and too much paperwork on outpatient, sometimes spending 10-20h per week on paperwork. But they are improving the elective time part."
  },
  {
    "nrmpProgramCode": "1663140M0",
    "positiveImpression": "any info would be grately appreciated -thank u:)"
  },
  {
    "nrmpProgramCode": "1484140C0",
    "negativeImpression": "Need I say more? <Does it go much further than that?. Toxic pos program"
  },
  {
    "nrmpProgramCode": "3153140C0",
    "positiveImpression": "I think monte gets a bad rep online. It definitely has its issues, but TBH, I've never felt like it's much more than my friends at other programs. Intern year you do a lot of floors, but it's q4 long call (till 8 PM) but otherwise its 7a to 2-5p depending on how you're done. I don't think I worked more than like 70ish hours intern year. As a senior, q2 long call when you're on day floors, but that's only 4-6 weeks this year. Units schedule is a little rough where it's probably ~70 hrs a week as an intern and the senior schedule is short (7 to like 2-5, 24-27 hrs shift, post call, day off). I would say night floors does kind of suck because their way of adding education is to make us stay to present (so night shift is usually 8P to 9-10A) 5 days a week. Would also agree with units and weekend coverage on clinic there are a lot of sometimes exhausting switches. Weekend coverage is 2-3 clinic weekends your intern year and every clinic block your resident years (I would say though with the increased elective and non-floors/units rotations I've had more goldens as a senior than an intern). Re nursing staff, monte has a nightmare rep, but honestly usually pretty good. Georgraphic so you get to know them well. Some (like 3 known assholes) in the MICU cause problems, but generally I've had good experiences with them. Attendings vary in quality, but there are a lot of great ones that push reaaaally good EBM. Very sick patient population and the hospital itself is pretty dysfunctional, so you do end up having to get comfortable taking care of unstable patients. It generally feels like everyone is on the same team though (Usually attendings are understanding and will help if things aren't getting done). I love my coresidents and think they're an exceptionally compassionate, and smart group. Other cons is that it's deep in the bronx, so best option is to live UES and have a 45 minute commute. PD just moved to a different organization, and our interim PD is probably going to take over, so we'll see how it goes. Not a part of it, but would also say the PCSIM faculty are AMAZING. Also if you're interested in addiction med, monte is absolutedly a great place to learn. Re scutt work: rarely draw labs, usually ultrasound guided/A stick for patients that are hard sticks or in rapid responses. Transport only for unstable patients (not actually transporting them, just monitoring them). Definitely more time than most programs talking to imaging techs or ancillary staff to try to get things done.",
    "negativeImpression": "- Current resident: This place sucks. Do not waste your time applying here. It isn't worth going to NYC for Monte. I think it used to be good but many good teaching attendings left. Most rotations feel like I'm treated like a PA, with barely any teaching, both at Moses and Weiler. No morning report. Noon didactics suck and aren't protected. We are the only main NYC teaching hospital that got a D rating, and so a lot of residency is just doing scut work to cover the hospital. NYU (including Bellevue), Mt. Sinai, Cornell, and Columbia are not on this list. https://nypost.com/2022/11/20/11-nyc-hospitals-rated-poorly-for-patient-safety11-nyc-hospitals-including-two-run-by-city-get-poor-safety-grades/  - Leadership/interview day they won't tell you this, but they say we are a 6+2, but on your two-week clinic weeks, one of your two weekends, you have to cover inpatient floors/admitting for \"Weekend Coverage.\" So you work Saturday NIGHT and Sunday NIGHT every seven weeks. This kills your golden weekends on outpatient.  - We also had a residency wide \"Town Hall\" meeting this past year, and they showed us this annual resident ACGME survey. We were ranked way below the national average for \"resident wellness\" due to how much the current residents feel disappointed by this program. A lot of people are so burned out they gave up doing a competitive fellowship. The only ppl who match well for fellowship are the chiefs each year. The rest only get local mid-tier or low-tier programs for cards/GI/heme-onc. Pulm/Crit care we still do decently.  - A lot of hospitalists and even a lot of subspecialists are not that into teaching residents and get annoyed when you ask them about their decision making. This place sucks.",
    "comments": "Thank you all for the honesty. As someone from the Bronx such a bummer to hear :("
  },
  {
    "nrmpProgramCode": "1490140C0",
    "positiveImpression": "Current Intern (1): this place gives you a strong medical training background that prepares you for anything. Everyone is nice for the most part. Good salary (75,000 and 81 for pgy2), housing is guaranteed (I pay ~1800 for a new studio with a view, can get a 1Bedroom for similar price if you're willing to live slightly farther away (10 min walk)). get fed 5 days/week with boxed lunches(not great but not terrible), get meal stipend (1000 per year in cafeteria), on nights there is a pantry for food and snacks (unlimited), citibike discount, Free gym (YMCA free for sinai residents (has bbal court, boxing) shuttles to VA/Elmhurst (where you spend only 1 month per year at each place), when shuttles don't work they pay for your uber, ability to rotate on subspecialty floors (onc, cards, liver). Once you are here, you are rewarded with world class research and the ability to match any fellowship--> update, 5 months in and I havent had to do a single blood draw yet, there is literally no scut (even elmhurst has an NP on the floor that does blood draws). I also want to mention that every single senior resident has been super helpful to the point that they will make sure you leave on time or early on short call days (I have left at 1pm many times). Another thing to add is that elective time has been increasing 1st and 2nd year to allow for more exploration and to have you prepared for fellowship applications. Many 3rd years said that interviewers often mentioned how they loved sinai residents because of how hard we work, it sucks going through it but for fellowship this is literally all that matter",
    "negativeImpression": "my negative comments here keep getting deleted (current intern)...is there a way to lock it? Program does not care about resident's or wellness. Stay 2 hrs or more after every night shift signout to present to attendings for EdUcAtIoN",
    "comments": "Current intern (1): 1) Don't be fooled, just because the people are nice doesn't mean it's easy. The patients at the main hospital are disasterously sick. Because it's new york city, you will often find yourself managing ICU level patients on the floors (there is plenty of support but it doesn't make it easy) this can be a pro or con for some people--if you like critical care this is the place for you. 2) Hyperspecialized hospital: because you are managing such crazy stuff (and the easy admits go to the non-teaching team), you don't get to see bread and butter medicine often, when you do (like when you rotate at elmhurst or the VA) after Sinai, it's literally cake 3) I'll add more when I think of it, but the fact that I can't rn means that it really is a good place to train <- Current intern: Agree with above comments re level of patient sickness, but I've already learned so much and I really like acute hospital medicine - undecided re cardiology or pulm / crit care. Disagree with the comments about program not caring, my faculty advisor is so niice, chief residents have given me personal help after I started, there's feedback Fridays where you can give feedback about anything, they set me up with wellness visit with someone (I didnt go, as I felt fine), PD has open hours for residents - haven't done that yet, but seniors said he's super open to feedback"
  },
  {
    "nrmpProgramCode": "1491140C0",
    "positiveImpression": "Diverse patient population, lot of learning, approachable attendings and leadership. Great clinical training here. Given NYC but no blood draw, only critically ill patient. VERY supportive faculities, PD, APDs, free UW, free MKSAP, great clinical training, everyones supportive! improving research opporunities, improving fellowship! all-around supportive people, god bless",
    "negativeImpression": "It is... community program, fellowship match is tough but very supportive, improving now+1 can tap into the MSHS leadership for career mentorship <-- agree, using more MSH resources to improve matching <- I hear people do get better interviews and matching better than before",
    "comments": "I agree it is getting better, fellowship match speaks for itself. Leadership is great, PD is great, people are great, overall all round a jewel. More information on our website: elmhurstmedicine.com"
  },
  {
    "nrmpProgramCode": "2070140C0",
    "positiveImpression": "Everyone was super nice and the PD seems very receptive to feedback and change. They also offer subsidized housing right across one of their hospitals and have a shuttle system to get you between campuses. You can do electives at any of the other mount sinais and also get to do rotations at MSK, great if you are interesed in heme onc.",
    "negativeImpression": "absorption of the now-defunct sinai beth israel program is going to throw a wrench into a lot of the workings of the program, least of which is the massive size of the program, less individual attention, and scheduling problems"
  },
  {
    "nrmpProgramCode": "1448140C0",
    "negativeImpression": "Malignant. absolute shit"
  },
  {
    "nrmpProgramCode": "1429140C0",
    "negativeImpression": "M4: Did my ambulatory rotation here so can only really comment on the outpatient side. Clinic here is a dysfunctional mess and the residents absolutely dreaded it. Patients have long wait times and would take it out on the residents. At one point a patient literally came into the workroom (which is small, old, and crowded with attendings, residents, and med students all stuffed in) and yelled at everyone saying \"I hate this clinic, you stupid residents!\" Also because there's no neurology residency here the IM residents literally run the neurology clinic which is still wild to me. The outpatient subspecialty clinics that are run out of the new building (ID and heme/onc, maybe there are more) are super nice though. Residents seem to really enjoy their lifestyle in Park Slope. Cafeteria breakfast is solid and lunch is...fine. Really good restaurants in the area otherwise. I enjoyed my inpatient experience on a different rotation so I'd guess it's not a bad hospital to work at overall but again I can't really comment on that aspect. I really liked all the residents I worked with so at least culture among the residents seems good."
  },
  {
    "nrmpProgramCode": "1700140C0",
    "positiveImpression": "Current intern. Felt very supported by upper level residents and attendings. From day one everybody made sure to let me know that I was supported from all sides. Very few people have a stick up their ass and there are a lot of genuine human beings here. The didactics and curriculum is amazing and people know how to teach because they're passionate about it. I work with a good group of people. Our program and hospital network is also super supportive in terms of resources, namely that we get nice perks like daily free lunch in the hospital Mon-Fri, free parking, and a decent number of wellness events. Scut is much less than city programs and ancillary support is there. I have done IVs on zero people and done zero blood draws. I've also only transported patients on rapids. Exposure to a wide range of patients and pathology. PDs, APDs, and chiefs make it known they have our backs and are constantly seeking feedback and making changes. People here are laid-back but passionate about the job. Salary is decent. No 24hr call. The program also makes it known that they like to hire graduates for hospitalist and some primary care jobs. I feel good about coming here.",
    "negativeImpression": "EMR sucks and looks like it came from the 90s. Nurses are decent but a lack of an organized system to find out who is on service means I keep getting annoying calls when I'm at home (they're working on it). They have a weird system where private attendings come in and round on one of your patients, meaning you never know who you should consult until someone tells you. One of the clinics is super annoying to work at due to the inefficiency setup, but that's residency clinic for you. It's a bit hard to tell how well the program matches because everybody wants to match internally over leaving for anywhere else. Workspaces are annoying to find both inpatient and outpatient (they're working on that too). Housing search can be a mess. You get free MKSAP and a travel budget for conferences, but no stipend for anything else."
  },
  {
    "nrmpProgramCode": "1483140C0",
    "positiveImpression": "Any one remember what their hours were like?",
    "comments": "could someobody please share experiences in residency and pursuing fellowship"
  },
  {
    "nrmpProgramCode": "2183140C0",
    "negativeImpression": "The IM department here is toxic. The attendings are incompetent. The PD is a narcissistic weirdo. Everyone hates it here.",
    "comments": "<< Current APD here: It is actually the complete opposite."
  },
  {
    "nrmpProgramCode": "2978140C0",
    "positiveImpression": "Bellevue is an incredible place where you get a ton of autonomy and get to take care of very sick patients who would fall through the cracks of the healthcare system otherwise. Ancillary services can be frustrating but they have improved substantially over the past couple years. Most of the attendings are awesome, socially-minded people and very committed to teaching on rounds. Co-interns are all amazing!",
    "negativeImpression": "Tisch vs bellevue are very different. Tisch is cush as far as ancillary, but the patients can be hard to work with because they're demanding and overall less interesting/less sick, but you work really really hard especially on nights since you have to stay for rounds the next morning. Bellevue you see the sickest of the sick, more interesting patients but high patient loads and lots of people burn out quickly becasue it is a tough patient population to work with and ancillary is horrible. Lots of blood draws, especially on nights, nurses argue about a lot and will interupt you during didactics for small tasks, will take all day to put a foley in. PD is not super involved. Housing is ridiculously expensive around the hospital, 3.5-4.5k for 1bed, not much less for a studio. <<Because bellevue is a specialized \"community\" hospital autonomy is lacking during the day (you have every fellow service making decisions etc.). Only noon conference, no other teaching going on",
    "comments": "<<<***if anyone could please talk about the brooklyn / community track, it would be greatly appreciated. the program seemed a bit cagey on interview day and i left with more questions than answers. mainly: a lot of people suggested that even though it's away from the main NYU campus and more \"community\" based, the NYU name will carry residency grads to solid fellowships. But since NYU's fellowship match records don't distinguish among different tracks, it's impossible to know if this is true. somebody please share your non-manhattan experiences!! << this is true. look at this year's match list for BK-specific. It's a smaller-sized track and residency burns people out more than you think, so a good portion of residents don't pursue fellowship. But those that do match well."
  },
  {
    "nrmpProgramCode": "1509140C0",
    "positiveImpression": "anyone>>??"
  },
  {
    "nrmpProgramCode": "2919140C0",
    "positiveImpression": "M4: it's pretty chill. They just built a new hospital building that's nice, butIM floors still in the old original hospital building. From my SubI impression residents are very friendly and chatty. Nurses are on top of things. All the attendings I have worked with have been kind. It seems very consult heavy, fellows are always involved with complicated cases. Patient population isn't super diverse but some nice old white people and sizable spanish speaking population. Definitely some Long Island personalities among the staff, if you are not familiar with it might be a bit of a shock. It has good standing in the community, see cool cases, only have to worry about people in middle island being snagged by northwell.",
    "negativeImpression": "M4: worst part by far is you have to live in the suburbs of Long Island. Stony Brook is pretty and calm but it is quite boring if you are new to area. Don't fall for the trap that you are close to city you probably won't ever have time to visit unless it's golden weekend. In rush hour, which is like 2-7pm, it could take two hours driving to make it to manhattan. If you drive at 6am or 9pm it might only be an hour and five minutes. I have heard food stipend is meager you only get free lunch on weds noon didactics. Cost of living is surprisingly high, not that many apartment buildings. Probably looking at 1.2-1.8 K to live alone. Uses cerner, not EPIC"
  },
  {
    "nrmpProgramCode": "1516140C0",
    "positiveImpression": "Someone deleted my comment FYI. Meh program but it's chill work life balance and has enough for an academic hospital. Syracuse sucks pretty hard though. Current m4: supportive vibe and PD, reasonable hours, new continuity clinic. Very diverse patient population for a small city. Some great attendings, some relatively disinterested in teaching. co-residents aiming for variety of careers - reasonably strong place to train for fellowship if interested, lots of research opportunity. Super cheap and safe living but you have to get out of the city to get it, commuting is no problem with very little traffic. Weather is nice with very nice summer and fall but cloudier than most other places, if you love snow this is place for you. If you don't love snow, global warming is fixing that issue quickly. Some good breweries, not as many good restaurants as I would like. Great parks for local nature, but city itself is not a good environment for running/biking"
  },
  {
    "nrmpProgramCode": "3099140C0",
    "negativeImpression": "Multiple EMRs  Work rooms pretty garbage  Many different sites to rotate at and somehow i didnt see a single buffalo the whole sub-I. Residents are a little unhappy"
  },
  {
    "nrmpProgramCode": "3116140C1",
    "positiveImpression": "the only positive is that residency is temporary and will eventually be over"
  },
  {
    "nrmpProgramCode": "1529140C0",
    "positiveImpression": "Did a SubI here recently. All the residents were extremely friendly and open to teaching. Attended a residency social event and everyone was over the top friendly.. looking to speak to prospective residents and convincing us to come here. --> Current M4 and totally second all of this. PD is amazing and very dedicated to resident wellness. Duke family is a real thing: residents hang outside of work all the time with organized sports events, hikes, brewery hangs etc. Attendings treat residents (and students!) like valued and respected members of the team and I have yet to meet anyone with an ego among faculty or residents in the Duke medicine department. Everyone puts excellent patient care first and then having fun/bonding as a close second. Came from big NE city prior to this and Durham cost of living/quality of life is honestly so refreshing with plenty to do outside of the hospital and nicer weather year-round!",
    "comments": "Anyone at duke know if there is some consideration to change their signout policy (currently everyone stays until signout) or do long call/short call like other institutions? Really really loved my interview here besides this>> yes we try to do sign out early to each other when we can. Seniors will often take your sign out and send you him //// can anyone comment on how the schedule is JAR/SAR years? the schedule is my only hold up - I know intern year is tough, but does it get better?"
  },
  {
    "nrmpProgramCode": "3023140C0",
    "positiveImpression": "Med student here: Faculty are incredibly kind and supportive of residents and are excellent teachers. PD truly cares about resident wellness and puts her all into the program. Great ambulatory experience and an excellent amount of subspecialty experience to be outside of an academic center. 2 + 2 + 2 so never too long on any service and a fair amount of guaranteed golden weekends. Residents are not overworked and seem happy. They feed the residents well. Parking deck is a 3-4 min (uncovered) walk but is free. Asheville is gorgeous with a lot to do, so a great place to live."
  },
  {
    "nrmpProgramCode": "1900140C0",
    "positiveImpression": "Incredibly kind and collaborative residents, lots of subspecialty exposure, and impressive match list. No 24 hour call on any service I believe and good support coverage with sweepers. Nightcation!",
    "negativeImpression": "Chapel Hill COL is rising rapidly and pay isn't really scaled accordingly. Parking can be hit or miss depending on the site. You will rotate out as far as WakeMed in Raleigh which can be a bit of a drive. Fair amount of APPs in the system, though some services do a better job than others of utilizing them well. -------------------------- Would describe UNC as a very supportive program nestled within an un supportive hospital admin culture. Social work/case management is also very lack luster and a lot of their work falls to the medicine residents. No clinical moonlighting, didactics have a lot of room for improvement."
  },
  {
    "nrmpProgramCode": "1537140C0",
    "positiveImpression": "Solid mid tier program. 3+1 intern yr then 4+4 upper level years. Plenty of research available, decent fellowship matches. Free parking, EPIC, cheap COL",
    "negativeImpression": "Winston-Salem not ideal for singles, VA experience lacking"
  },
  {
    "nrmpProgramCode": "1553140C0",
    "positiveImpression": "Current intern here. This is definitely not a malignant program. All seniors and faculty that I've worked with are very helpful and supportive. Great inpatient and outpatient exposure. Lots of research opportunities and amazing fellowship mentorship as well. Overall, I feel like the program far exceeded my expections. Vast majority of residents here are reasonably happy and we are a kind bunch.     +1 to the above as current intern this year! Everyone is amazing here and supportive of each other. Some things to add is that the program is super receptive to feedback, we've changed our scheduling system and admitting system this year because of feedback from residents, also a lot of graduates stay on to work as hospitalists/attendings/fellows which says a lot about the culture here. also one advantage Metro has over CCF/UH is we get good generalist training with specialist help, from my impression places like CCF like to have specialists run the show whereas here we are encouraged to make the decisions",
    "negativeImpression": "Money money money: gotta pay for step 3/level 3 out of pocket, only $500 for educational stipend, paid garage parking (there is a free parking lot though) and food stipend isn't enough ($600 every 6 months, not enough if you're the type that needs coffee daily), food is expensive but pretty good. My only complaint is I just wish they gave us more money    Procedure exposure can be improved, fellows get first dibs on everything (but this is a problem at any academic program with in house fellowships), however they are working on improving this for us currently    Weekend and night options for food are limited, caf is closed at night and weekends, the lobby cafe is open on weekends but closed at night, only food source in the hospital for night shift is the market at the old hospital or order out"
  },
  {
    "nrmpProgramCode": "1552140C0",
    "positiveImpression": "M4: Had a real good time here during my rotations and AI. Faculty're teaching-oriented, didactics're protected time (and a hoot, with provided lunches), and complex and interestin' patients are ref'rred to UHCMC while you still'll see bread and butter (esp at VA). Residents were downright welcomin' to me and had a hoot with each other. Loved the call schedule (long-med-short-happy) 'cause while you might stay real late on them long call days, you know that in a couple of days, you got a short and happy to look forward to. PD's the funniest and friendliest guy, and residents love him. When I was thinkin' 'bout what med school to go to, the CCF name def did draw me to CWRU, but UH might be what makes me stay—love the environment, love the folks, love the breadth of pathology. +1 to the above. There's an incredible culture of teachin' at UH. Admin (especially PD) genuinely advocates for resident. Did rotations/AIs at both UH and CCF, and there's a stark contrast between the two in terms of teachin' and autonomy."
  },
  {
    "nrmpProgramCode": "1968140C0",
    "positiveImpression": "US IMG did 2 rotations here (med floor & ICU), amazin' place, gr8 exposure, vvv big. Learn the most on call per PGY1 I rotate with. Lots of autonomy on day-to-day, even for elective students. Cases r complexe, not simple, & u see patients from all over the world. PD's amazin', listen to residents' concerns, door always open for anyone (residents, IMG, med students). Good place for residency. Maybe u've heard bad stuff, but know u'll get huge opportunities for fellowships, maybe not at CCf but gr8 places outside. Procedure-wise, hospital v strict, but lots of opps for simulations in their edu campus. Nervous comin' in 'bout high egos, but every attending I've worked with has been excellent, encouragin', & focused on teachin'. Lectures from esteemed faculty from CCF & all over, but they still dumb things down for us interns lol.",
    "negativeImpression": "fellow-driven hospital, not much focus on gen med. Not a lot of autonomy. Big complaint ever yr is little opportunity to do procedures. Very difficult/competitive for residents to stay for CCF cards and pulm/crit fellowships."
  },
  {
    "nrmpProgramCode": "1551140C0",
    "positiveImpression": "Great PD. The culture is very supportive. No 24hrs call. They have a new schedule system where they get 2 day week ends every other week end. Big ICU, known for it.",
    "negativeImpression": "Smaller hospital, less patient pathology."
  },
  {
    "nrmpProgramCode": "1566140C0",
    "positiveImpression": "MS4 here. Love the enironment, everyone is incredibly friendly. Residents get along VERY well, and they're incredibly supportive of each other. They're constantly helping each other out all the time. No 24 hr call."
  },
  {
    "nrmpProgramCode": "1567140C0",
    "negativeImpression": "Heavy on the gossip    Residents seemed kind of toxic. Very clique-y."
  },
  {
    "nrmpProgramCode": "1548140C0",
    "positiveImpression": "Residents are chill, and PD is supportive. Good benefits: free parking for residents, lunch provided M-F, and IRA matching. <<those are very average benefits. Good learning environment. Good for medical education interests.<<< Supportive environment, friendly leadership",
    "negativeImpression": "Hours on the longer side, especially PGY1. Other fellowship research and match not particularly strong."
  },
  {
    "nrmpProgramCode": "1579140C0",
    "positiveImpression": "Hidden gem-chill program with extremely smart residents who seem to love the program,recently switched to EPIC outpatient as well."
  },
  {
    "nrmpProgramCode": "1588140C0",
    "positiveImpression": "Really enjoyed working with the residents. The department chair would bring donuts for everyone when I had him on wards. Food from local restaurants at noon conference",
    "negativeImpression": "Finding research opportunities can take some effort, but the University recently made some improvements."
  },
  {
    "nrmpProgramCode": "1594140C0",
    "positiveImpression": "MS4 here- 2 + 2 schedule. Everyone has been nice to me so far. +1"
  },
  {
    "nrmpProgramCode": "1631140C0",
    "positiveImpression": "Did a sub-I and really loved it! The residents were well trained and appreciative of any contributions I made to the team. The attendings loved to teach and gave good feedback that made me better. They also were very much interested in teaching about social barriers to health which is very prominent in this part of Philadelphia. Some of the attendings even took me down to the pathology lab and let me practice POCUS on them. Residents seemed happy, but did work hard while on inpatient teams. Cafeteria was pretty good and had a lot of options. Chief residents were really supportive and personable. PD was great as well. Overall had almost all positive things to say!",
    "negativeImpression": "Cockroach in middle of hallway lol. Also limited poop bathrooms. +1. how limited is the poop situation?"
  },
  {
    "nrmpProgramCode": "1608140C0",
    "positiveImpression": "Work hours? Balanced, so you're not always grinding 24/7. Culture? Super inclusive and supportive – no toxic vibes here. And the variety of cases? Wild! Everyday is a new learning experience. If you're looking to thrive and see a mix of everything, this is where it's at >> Everyone including attendings, nurses, residents were all SUPER NICE and welcoming.",
    "negativeImpression": "Nothing to do AT ALL!!! >>Student at GCSOM: have no idea where \"no toxic vibes here\" is coming from. Can't be farther from the truth for some students; maybe your time was different than others",
    "comments": "But can travel to nearby cities. Also a lot of outdoor activities // Not toxic at all, it must have been a one-off interaction if you felt it was toxic. Rotated through many department 99% are very nice and love to teach"
  },
  {
    "nrmpProgramCode": "2103140C0",
    "positiveImpression": "Very positive teaching environment",
    "negativeImpression": "Super small community based not prestigious at all. If you just want to be a hospitalist/PCP this residency will get the job done. >> I did a sub-i here and I didn't enjoy it. I had absolutely no responsibiltiy and was assigned 1-2 patients at most. However, more than half the time, i didnt even get to present my patients to the team or attending. Overall, it felt more like shadowing. We don't even write notes. It was soemwhat nice to have some relaxing rotation but at the same time I was really bored."
  },
  {
    "nrmpProgramCode": "1636140C0",
    "positiveImpression": "Very chill rotations.",
    "negativeImpression": "Some of the residents didn't know how to use epic... and it's their EMR. I feel like compared to other places, the level of training isn't great."
  },
  {
    "nrmpProgramCode": "1932140C0",
    "positiveImpression": "the name sounds cool. like some kind of spell"
  },
  {
    "nrmpProgramCode": "1617140C0",
    "negativeImpression": "hours are ruff 6-6 and we take admits pretty late"
  },
  {
    "nrmpProgramCode": "2158140C1",
    "positiveImpression": "suuuper chill +1"
  },
  {
    "nrmpProgramCode": "1630140C0",
    "positiveImpression": "Everyone is so nice and the residents actually love each other. They go out all the time and I always see them on campus playing pickleball or eating lunch together. They have a huge resident lounge with direct access to the outside. PD is the funniest and most supportive person. Never met an attending I didn't like",
    "negativeImpression": "Difficult to find work stations. Consultants can give push back"
  },
  {
    "nrmpProgramCode": "1605140C0",
    "positiveImpression": "chill",
    "negativeImpression": "chill"
  },
  {
    "nrmpProgramCode": "1646140C0",
    "negativeImpression": "Can be toxic to off service residents behind their backs. Program and hospital extremely disorganized which causes unnecessary hassle"
  },
  {
    "nrmpProgramCode": "1628140C0",
    "negativeImpression": "SubI: Overall negative vibes. Everyone seemed to want to prove that they are great while at other top places, they just know that they are great. I would write notes and they would be totally discounted or not read at all by residents/fellows/attendings. When rotating at subspecialty outpatient clinics, was made to SHADOW! I have not shadowed since pre-med. Even residents in the same clinic shadowed. Complete waste of a rotation IMO.",
    "comments": "The relationship between Penn and the West Philadelphia community is not good at all."
  },
  {
    "nrmpProgramCode": "1652140C0",
    "positiveImpression": "The residents are the best and all seem REALLY happy with the 4+4 schedule",
    "negativeImpression": "they seem to work a bit more than you would think considering the 4+4???"
  },
  {
    "nrmpProgramCode": "1674140C0",
    "positiveImpression": "Someone deleted the novel I wrote here before, but tl;dr I did M3 and my M4 Sub-I here. York has community vibes despite being a Lvl 1 trauma with >500 beds and is the largest in the WellSpan network. The hospital is expanding and they're starting a Cardiology fellowship next cycle, as well as a Neuro residency in the near future. New surgical tower is also being built. Coffee and fountain drinks are free when the hospital or ER is on black (which is like 50% of the time nowadays). 9/10 of the people I met here are great, and residents seem happy as can be expected in residency. Attendings are supportive.",
    "negativeImpression": "Not a good fit if you want a lot of research for a competitive subspecialty - someone matched Cards this past cycle but he had to work his butt off for it. Hospital recently closed the dorms on campus in order to build a surgical tower, so call rooms got moved to a less convenient part of the campus and as far as I know the gym equipment that was there has not been placed elsewhere.",
    "comments": "< hope this is the correct york, copied from earlier version"
  },
  {
    "nrmpProgramCode": "1677140C0",
    "positiveImpression": "Intern: Get along well with co-interns/residents. Program leadership and PD are generally down to earth and reasonable -> PD has instituted caps on admissions/intern caps on teams since starting. Fellowship matches are good. Free parking all sites, easy to get to hospitals from Providence. No 24/28hr shifts, even in ICUs. Noon conference food M-F.",
    "negativeImpression": "Intern: Traditional schedule - many in the program like it, others want X&Y and program is eventually moving in that direction. Limited formalized program for procedures, but there if you actively seek them out. Per upper levels, moonlighting opportunities are limited"
  },
  {
    "nrmpProgramCode": "1761140C0",
    "positiveImpression": "Resident are genuinely happy. They clearly get a great education, as the seniors are all super competent. About 50% do fellowship. Good work life balance. PD and APDs are awesome. Good COL. Doesn't hurt that's hospital is like half a mile from beach. This program is a hidden gem"
  },
  {
    "nrmpProgramCode": "1680140C0",
    "positiveImpression": "I love it here so much fr; intern here - couldn't say enough good things about this place"
  },
  {
    "nrmpProgramCode": "2066140C0",
    "negativeImpression": "has had three PDs in past two years, no support for research, residents seem generally dissatisfied, no procedures, not much assistance with fellowship applications, residents seem to feel internal fellowships do not tend to take internal candidates. low quality didactics. have to drive 45 minutes to one hospital"
  },
  {
    "nrmpProgramCode": "1839140C0",
    "positiveImpression": "(from the main chat): Really enjoyed my rotation there. Very welcoming culture with residents/attendings who are always willing to teach. Smaller program, 3 inpatient medicine teams (2 teaching teams and 1 hospitalist team) so q2 12-hour admitting days while on one of the two teaching teams and the hospitalist team admits every day to a cap of 15. Most attendings are awesome and residents are definitely supported in their pursuit of fellowship. Very successful matching to cards and PCCM (in-house fellowships), and have matched most other specialties in recent years, including GI and heme/onc (also new in-house heme/onc fellowship). Cerner for charting, perfectserve for paging/nursing questions/consults. Knoxville is okay, it's your typical southern college town. That's all I can think of for now, hope its somewhat helpful lol."
  },
  {
    "nrmpProgramCode": "1702140C0",
    "positiveImpression": "Anyone?? -> Have a friend there that's an intern, he absolutely loves it, says its very family centered community with caring PD, no huge concerns for him as of now"
  },
  {
    "nrmpProgramCode": "1716140C0",
    "positiveImpression": "Intern - so far really enjoying this program. They've made a lot of changes the last few years to make the schedule easier, specifically reducing the amount of inpatient wards as an intern, and now no longer any 24 hour calls as an upper level. 5 weeks off (2 post nights). Culture is excellent, tons of research and opportunites right away. Houston is a great city to be a resident in, affordable and has everything. Hot in the summer but tolerable with central air and a pool.",
    "negativeImpression": "Very large program, everyone is very nice but can feel strange not knowing everyone in your class. 4 different hospital sites makes onboarding a pain. Parking is expensive at MDA and St Lukes - a lot of people just liver near the TMC and walk, bike, scooter, and metrorail is better than expected.",
    "comments": "<How many weeks of vacation? Program website mentions 9 personal days<3 weeks<Also, we have biweekly \"night floats\" which is 1 week on 1 week off (5pm-7am 1 week, next week off with maybe 2 days of educational activities - NO LONGER HAVE TO DO 2 days of Eduucational activities on these weeks) <do you get the 9 personal days on top of the 3 weeks?<Yes, these are basically sick days. PGY 2-3 you also get a 4-day personal holiday which is essentially a long weekend (Thursday-Sunday)."
  },
  {
    "nrmpProgramCode": "2259140C0",
    "positiveImpression": "Intern - the new PD is a literal gem and she cares so much about us. Program schedule has alot of flexibility and work/life balance is definitely there. Culture is great and burnout is low. Residents hang out outside of work. Attendings and consultants love teaching. Lots of research opportunity and working with medical students. Well funded by TCU. I was expecting intern year to be rough but I've genuinely enjoyed working with my co-residents and faculty! <<<<hey thanks! also heard good things about your PD but could you maybe talk about your APD? <<also your accreditation status?",
    "negativeImpression": "Newer program so needs time to establish a name"
  },
  {
    "nrmpProgramCode": "1706140C0",
    "positiveImpression": "Intern here- i could not be happier!!! i love my co-interns and the leadership here. i was expecting to be miserable intern year, but i honestly have a great work life balance. ALSO, we've been working with leadership to try to get a 4th week of vacation time, and we got it!!! it really is such a great environment and they take great care of us",
    "comments": "chill. cush, some might even call it"
  },
  {
    "nrmpProgramCode": "2211140C0",
    "positiveImpression": "Honestly a great community program. Even though HCA has a reputation of overworking their residents I can honestly say that this program is one of those rare HCA programs that is an exception to that rule. Only program I've ever rotated with where residents get weekends off during elective rotations and the PD is genuinely the kindest person I've ever met and is genuinely tries to help residents out as much as possible despite the annoying HCA rules. Super hands on PD who is always looking for feedback and trying to improve the program as much as possible. The specialists and ICU attendings are passionate about teaching but a lot of the hospitalists aren't as much.",
    "negativeImpression": "Most residents aren't fellowship inclinced and teaching is not that great. It's really obvious that some of the hospitalists are private physicians and are only interested in making money and don't care for teaching students/residents. If you want to pursue a competitive fellowship, it might be more difficult than in other programs."
  },
  {
    "nrmpProgramCode": "1707140C0",
    "positiveImpression": "Great community program where the residents seem happy. It's well established so they know what they are doing when it comes to IM training. Benefits are amazing, 60k starting for interns, great insurance coverage, retirement options, etc. You get free catered lunch every day and like $500 on a meal card to use for the whole year on top of that. The faculty is mostly young and they like teaching. The hospital itself is pretty nice and newly renovated. You do some rotations at the VA where you rotate with UTSW and Baylor residents and attendings. Residents have great commaraderie and have not noticed any malignant vibes. Fellowship match is pretty decent and program admin is supportive of fellowship applicants. Generally you work about 60-65 hours per week.",
    "negativeImpression": "VA kinda sucks because they use CPRS but I guess that's the case with all programs that rotate at the VA. There's only a GI and nephrology fellowship at the moment. This year they started a cardio fellowship. Plans to start a pulm/crit and heme/onc fellowship as well. There are monthly tests based off of MKSAP (usually like 30 questions). You only need to get 50% on them to pass though. Not X+Y, uses traditional clinic schedule of 1 half day per week. Wards call days are q5 and can be pretty chaotic with a pretty reliable end of day bolus. Resident \"lounge\" was a dilapidated/abandoned neuro ICU when I rotated, though they had plans to renovate some things. Consult teams are contracted, so they don't always integrate well into the contact/paging system. <<<yeah resident lounge looks like a mix between a ww2 bunker, a prison, and the fucking distortion world from Pokemon Platinum but allegedly itll be renovated in a year or so",
    "comments": "<<no longer have monthly tests, replaced with self study. they get a little vacay to mayo instead 1 week or something"
  },
  {
    "nrmpProgramCode": "1725140C0",
    "positiveImpression": "Hidden gem of a program (although it has won awards for top teaching hospitals, so maybe not so hidden). Have Texas A&M med school campus and those students rotate here, but BUMC is opening a campus here as well. Large regional hospital with good path. Research opportunities with fellows and faculty. Positive culture and close camaraderie amongst residents. A lot of in house Fellowship programs that welcome their own residents. 4+1 work schedule and an overall very reasonable work life balance. Have not had an attending who wasn't enthusiastic about teaching either. You live an hour from Austin and 45 min from Waco. You get to work at the VA as well. Pay to COL ratio is excellent.",
    "negativeImpression": "You get to work at the VA. Temple itself is a small somewhat lackluster town but has its charm and is a short drive to Austin. It gets friggin HOT in summer. PD is more hands off/less present than other PDs I've heard of but super nice."
  },
  {
    "nrmpProgramCode": "3124140C0",
    "negativeImpression": "City is a shithole LOL"
  },
  {
    "nrmpProgramCode": "1710140C2",
    "negativeImpression": "PGY-3 are only residents to have spoken badly of the program."
  },
  {
    "nrmpProgramCode": "2923140C0",
    "positiveImpression": "Great residency program overall. Program culture is very open with attendings and seniors who are willing to help their residents. Having access to the VA and county hospital gives good training in bread and butter medicine cases with the Texas Medical Center training site providing a solid mix of classic medicine & zebra cases. Residents seem to be busy on wards blocks, but have a good work-life balance with the 4+2+2 system. Houston is a diverse city so there are a lot of great restaurants and town areas to explore.    To keep anonymous, OOS intern here: Overall, the people here actually make the program. Texans are super nice (at least the ones I've interacted with). This wasn't my top choice because I wanted to stay in my home state, but I'm really happy I ended up here. I feel like I can still match well into my desired subspecialty and can get research if I look for it. My co-interns are great and normal for the most part. The TMC is impressive in size and pathology. I don't think Houston as a city is where I'll be long term, but I feel like I'll graduate from this program as a well-rounded academic clinical. I was concerned this program is a work horse, but I'm happy to say that's not true most of the time. The workhorse nature isn't from the leadership program but is more from it being a large academic medical center. Our PD during a noon conference even said \"We set the rules for admissions guys, so if you want to take less or more just let me know and we can see what we will do.\" My overall ranking is 8/10. 1 point away due to Houston weather and another point away due to traffic    **Changed back to english from spanish"
  },
  {
    "nrmpProgramCode": "1714140C0",
    "positiveImpression": "As an MS4, the residents here definitely seem to have a chiller life than most IM residents (especially compared to the Houston area residents). In general, people are friendly and helpful. I think having the TDCJ hospital (serves all the prisoners of Texas) gives a first hand glance at really advanced pathologies but also the injustices of social determinants of health. Dr. Sonstein (PD) seems to be really receptive to resident feedback and even changed the scheduling this year based off of feedback <Hello! Intern here. Just wanted to add that I agree with the stuff above. This place has a good culture, my co-interns and upper level residents are wonderful, and the faculty I've worked with so far have been supportive and easy to work with (it also doesn't hurt that the upper floors of the hospital have great ocean views) <- They do have a 98% fellowship match over the past 3 years and seems like many have the opportunity of either staying in-house for fellowship or leaving to diversify training if they want",
    "negativeImpression": "Again, as an MS4, my impression is that we do well with fellowship but not as great as some other programs in the area as far as getting to a name brand instutition after residency (but match similarly by numbers). UTMB has all the major IM fellowships but this will be the first year with a heme/onc program after years of only an onc program <- This will be the second year with heme/onc I believe!> I found the program to be uncomfortable during my AI, the residents were toxic and they would gossip behind each other's backs. They also seemed super burnt out. < seems like an outlier experience seeing whats been written thus far in multiple tabs",
    "comments": "They offer an elective in Sapporo Japan that's paid for lol, thats so dope < this is new and the residents I was with on my Sub--I seemed super pumped for it"
  },
  {
    "nrmpProgramCode": "1825140C2",
    "positiveImpression": "M4 here - attendings are very nice, enthusiastic, and the noon conferences have been very solid this year. faculty is supportive of research and are really approachable."
  },
  {
    "nrmpProgramCode": "1722140C0",
    "positiveImpression": "Somone deleted: m4 - I think it's a pretty good program. I was surprised by the variety of pathology I saw here. Really rare stuff (both from my perspective and from what the attendings said), but also your bread and butter since this is a county hospital. The residents all seem happy but ill list the gripes ive heard in neg impressions. Pure night float, you never need to do a 24 at any point in residency. I saw an intern sleep through his alarm on wards and he felt horrible but they were pretty nice about it. The infectious disease program is really good imo. There's a dedicated HIV team (you're the primary but you only accept HIV patients and the occasional overflow) you can rotate on. There's a POCUS track you need to apply to separately and rank but there's also a POCUS elective once you get in. You can do your own procedures on your patients if you want but most of the time I see residents consulted procedure team. as an intern you're required to do one block of procedure team. I watched one LP and it was just the attending talking the intern through the LP in July. Kind residents would buy me food so they must give you a good cafeteria credit. Before COVID didactics would always have food and it's slowly coming back.",
    "negativeImpression": "Someone deleted: M4 - One intern IMG told me he did an away at Mayo rochester and I think that gave him unrealistic expectations on what a county hospital is like. He was always going off about the amount of social work he was doing. You do a good amount of social work and our sw/cm at UH are kinda bad. He also complained that he wasn't given enough time to research compared to other places and you needed to work hard to get those opportunities. The UH system and the UT system don't work well together. I did a week of direct care wards (only attendings, no residents) and heard the following complaints: our ICU:wards bed ratio is bad, ICU won't take things like DKA and there's no hospital protocol for DKA which everyone is always ticked about, med student notes don't count, there's only one diabetes educator for the entire hospital in the second most obese city in the nation, nursing turnover is high, teams aren't localized so rounds take an extra hour just to get to other towers (this is much better on resident teams) ->> initiative to geolocalize ward teams now at University Hospital! There do seem to be a lot of didactics but no one was aggressive about attendance. Scheduling and time off is not the easiest. Not as much support for time off for research/conferences etc.",
    "comments": "someone deleted: High amount of DO and IMG (40% USMG I think) whether that's a pos or neg for you. Lots of international grads. If you want to go here and you speak any amount of Spanish i would emphasize that. I tried to list all the downsides I could think of but i do want to emphasize that i still think this is a great place to train"
  },
  {
    "nrmpProgramCode": "2835140C0",
    "negativeImpression": "This program definitely works its residents. Residents still have significant amounts of 28hr call, but the program got rid of a good chunk of it and now only has it on PMH/CUH MICU and the CUH Cardiology service. This still probably accounts for a few months of q4 28hr call for senior residents, which is rough. On the bright side, residents get the post-post call day off. Primary care training is not the best. Most residents are awesome but definitely have came across of not super welcoming residents that give off malignant vibes. Have never heard of residents failing medical students on their clerkships. <- another M4 here and agree, UTSW overall is very intense and culture is more hierarchical/East Coast-y. Also a lot of ICU time. Parkland is a stellar public hospital, but it does have a shortage of social workers and financial counselors because the hospital serves a population with immense need. A lot of the care coordination work (scheduling follow-up, enrolling patients in the financial plan, etc.) ends up falling on residents. <- another M4 here who actually has heard of a single resident (they were applying cards fellowship this year and should hopefully be gone) who would absolutely trash students on their evals without warning or feedbak for them to improve prior. I wondered if mayve students were that bad and maybe not ownin gup, but yikes the resident definitely misrepresented things in a way that my evaluators did not on the same rotation. Just one person, but just saying the rumor didn't come from nowhere."
  },
  {
    "nrmpProgramCode": "1732140C0",
    "negativeImpression": "IMC intern year notoriously worse than University of Utah hospital. Had a resident at IMC get chewed out by attending for letting med students go home early"
  },
  {
    "nrmpProgramCode": "1734140C0",
    "positiveImpression": "Residents are very friendly to each other and to medical students. Everyone hangs out in the lounge, I felt like all the residents genuinely liked each other and overall seem very happy",
    "negativeImpression": "Consult culture is pretty bad across the board, especially cards, GI and specialty surgery services. Consultants sometimes straight up hang up on you while you're talking. Multiple of my residents told me their cards rotation was essentially a waste of time and all they did was write notes. One resident told me she felt like she had to drop cards because of this.",
    "comments": "Adding: difficult w/ cards is a well known problem. Not the easiest to match into from here"
  },
  {
    "nrmpProgramCode": "1748140C0",
    "positiveImpression": "You will get a good amount of autonomy with support, almost every subspeciality, very supportive faculty who love teaching, large catchment area so very interesting pathology. Hospital system is rapidly growing and becoming more academic. Overall, you will get very solid training with a good lifestyle.",
    "negativeImpression": "Every single IM faculty member is extremely nice, approachable, loves to teach. No 24h call. Decent lifestyle perks, good salary, meal stipend, solid insurance."
  },
  {
    "nrmpProgramCode": "2980140C0",
    "positiveImpression": "PD is super chill and funny. Residents are very knowledgeable and seem to enjoy the program. Sentara Norfolk General sees a wide variety of people, particularly the underserved. Good Academic/Community hybrid program.    M4: all residents are approachable and great to work with. Most attendings are kind and helpful in wanting to aid your learning >agreed from another M4, the attendings are very nice, i've never had a negative experience with them. Residents seem like they get along well and like their program",
    "negativeImpression": "Has a few fellowships in house but does not have Cards or GI (However does have some heavy hitters in those spaces that one is able to interact with). People historically have been able to match into those specialties provided they put in a bit more work."
  },
  {
    "nrmpProgramCode": "2129140C0",
    "positiveImpression": "Really great attendings, ancillary staff, and lots of autonomy for residents"
  },
  {
    "nrmpProgramCode": "3199140C0",
    "positiveImpression": "Current intern. Excellent program at a huge hospital. Class size is small. 11 per year, so everyone is really close with eachother and the attendings. Full academic capabilities. 1100 bed hospital. Phenomenal Pulm/Cards/ID/Nephro experiences although GI is more of a weak point. No 24 hr call. 8 pts per intern. Seperate admitting rotation. Overall loving the program and the area so far.",
    "negativeImpression": "Procedural experience is a weak point here, but there are initiatives in place to work on that. There are loads of procedures out there, it can just be hard to get them unless you advocate for yourself"
  },
  {
    "nrmpProgramCode": "1737140C0",
    "positiveImpression": "Current M4: Really great program. All the residents I've worked with are super kind and definitely friends outside of residency (play volleyball and flag football together, trivia teams, etc). Strong focus on teaching and learning; attendings have been really wonderful and enjoy working with residents (a number of them being former UVA residents). PD Dr Uthlaut is probably the gem of the program. Truly cares for residents, very approachable, responsive to feedback, and constantly focused on improving the program through resident suggestions (he also brings in Rice Krispy Treats made by him and his kids on Fridays)."
  },
  {
    "nrmpProgramCode": "1918140C0",
    "comments": "FYI - At Open House PD told us that he is leaving this year"
  },
  {
    "nrmpProgramCode": "1837140C0",
    "negativeImpression": "Poor Board Pass rate >its in the 90s??"
  },
  {
    "nrmpProgramCode": "1780140C0",
    "positiveImpression": "anyone ??"
  },
  {
    "nrmpProgramCode": "1784140C0",
    "positiveImpression": "Great academic program for anyone looking to do fellowships. Good scheduling, x+y iirc. Full day of clinic instead of having to leave from the hospital. Great resident lounge area. Attendings are very nice. They use EPIC for EMR",
    "negativeImpression": "No meals paid, not even during noon report. Midlevels have power over you (they have full practice) and they can be pretty catty. Parking is free. +1"
  },
  {
    "nrmpProgramCode": "1779140C0",
    "positiveImpression": "Current M4 and I absolutely love the program. All of the residents I have worked with have been super nice and supportive. Never felt like I couldn't ask questions. They also gave us a lot of autonomy on rotations. Most attendings are very kind and care about their learners. New X+Y schedule is great.",
    "negativeImpression": "Parking is expensive. However, the PD sent a survey on if we would rather have parking and lower pay or make it an individual choice since many residents live within walking distance. Residents obviously chose higher pay.    No food stipend, or free meals but the pay is great. I would say on average there is free food once every two weeks."
  }
]