[
  {
    "nrmpProgramCode": "2265140C0",
    "questions": "Conversational with PD, \"What would you in different situations ..........?\" in 2nd interview"
  },
  {
    "nrmpProgramCode": "2132140C0",
    "questions": "Tell me about yourself, Why IM?, One strength?, Should I take you for this program?, Why this program?"
  },
  {
    "nrmpProgramCode": "1009140C0",
    "questions": "Tell me about your typical workday, one weakness and one strength, Why montgomery, any questions? PD just asked what questions you have for me thats it"
  },
  {
    "nrmpProgramCode": "1929140C0",
    "questions": "why us, what questions do you have, career goals, describe a time you struggled in med school and what you did"
  },
  {
    "nrmpProgramCode": "3200140C0",
    "questions": "Tell me about yourself, why Mayo AZ, biggest weakness, tell me about a time you were disappointed with yourself, if we gave you an unlimited budget, what research project would you start (this one was the most out of left field), tell me about a formative experience that influenced you"
  },
  {
    "nrmpProgramCode": "1014140C0",
    "questions": "tell me about a time you had an angry or frustrated patient and how you handled it, why tucson/anything you're looking forward to if you come here location-wise, tell me about a time you struggled in medical school and how you handled it"
  },
  {
    "nrmpProgramCode": "2214140C0",
    "questions": "tell me about yourself ; how would your friends describe you ; what is one thing your family finds irritating about you ; talk to me about your research ; future goals ; what do you do in your free time ; one takeaway from your rotations ; a memorable patient case"
  },
  {
    "nrmpProgramCode": "1991140C0",
    "questions": "A lot of behavioural questions"
  },
  {
    "nrmpProgramCode": "1041140C0",
    "questions": "What are some important social determinants of health that affect our population (???), What do you think is an important barrier to health equity in this area."
  },
  {
    "nrmpProgramCode": "2018140C0",
    "questions": "Tll m abt yurself, tll m abt a tme yu rceived crticism / cstructive fedbck drng a rtation, what spcialty are yu nterested in, tech them smething, why IM, a tme when yur mdcial team showed yu cmpassion, smething yu bring t the program"
  },
  {
    "nrmpProgramCode": "1067140C0",
    "questions": "Tell me about yourself, tell me about a time you received criticism / constructive feedback during a rotation, what specialty are you interested in, tell me about a time you faced a conflict"
  },
  {
    "nrmpProgramCode": "2950140C0",
    "questions": "What's something unique about you that you bring to the program, talk about a significant mentor or teacher you've had."
  },
  {
    "nrmpProgramCode": "1850140C0",
    "questions": "anyone?"
  },
  {
    "nrmpProgramCode": "1063140C0",
    "questions": "tell me about yourself, how have you worked with underserved population and what did you learn from that (to add, I also had some application specific questions!)"
  },
  {
    "nrmpProgramCode": "2278140C0",
    "questions": "Can you speak Spanish? << this is America, speak English"
  },
  {
    "nrmpProgramCode": "1820140C0",
    "questions": "tell me about x project, how do we fit in with your goals/ideas of residency"
  },
  {
    "nrmpProgramCode": "1043140C0",
    "questions": "why IM, why UCI, challenge u foresee to have during residency"
  },
  {
    "nrmpProgramCode": "1956140C0",
    "questions": "Name a time you had a conflict with a team member, what's your proudest moment, where do you see yourself in 10 years"
  },
  {
    "nrmpProgramCode": "1049140C0",
    "questions": "conflict you had with a team member"
  },
  {
    "nrmpProgramCode": "1062140C0",
    "questions": "challenge u oversee to have during residency, how does our mision of diversity, equity, inclusion resonate with you, conflict with a team member"
  },
  {
    "nrmpProgramCode": "1022140C0",
    "questions": "1) Tell me about a time you had a conflict, and how it was resolved. 2) IF you were in my office for feedback in 3 weeks what feedback would I give you."
  },
  {
    "nrmpProgramCode": "1033140C0",
    "questions": "Tell me about yourself, where do you see yourself in 10 years, what do you consider as essential for your ideal residency program; any misperceptions of you"
  },
  {
    "nrmpProgramCode": "1997140C0",
    "questions": "Mostly asking them questions. Tell me about yourself, leadership experience, resume questions +1"
  },
  {
    "nrmpProgramCode": "1074140C0",
    "questions": "What would you bring to our program, What are your strengths, What qualities make a great IM doc, What do you do for wellness, What motivates you/gets you up in the morning"
  },
  {
    "nrmpProgramCode": "1079140C0",
    "questions": "Tell me about yourself, why this program, what do you think will be your greatest challenge starting residency, where you see yourself in 10 years, what is your proudest accomplishment, what do you value in a program?"
  },
  {
    "nrmpProgramCode": "1977140C0",
    "questions": "Hi anyone interviewed here? thank you"
  },
  {
    "nrmpProgramCode": "1093140C0",
    "questions": "Tell me about yourself, then specific questions about CV"
  },
  {
    "nrmpProgramCode": "1080140C0",
    "questions": "1. Tll m abt yurslf. 2. Why ntrnl mdcn? 3. Why r prgrm? 4. Tll m abt a mstke yu made. 5. Bggest strngth/wkness. 6. Why Nw Englnd? 7. Tll m abt a spcfc SBI exprnce. 8. Tll m abt a ppr yu wrte. 9. Tll m abt a chllnge yu ovrce. 10. IF yu wer in my offce fr fdbck in 3 wks what fdbck wld I gve yu. 11- What srrsed yu mst abt US halthcre vs othr cntry. 11. Whre do yu see yurslf in 10 yrs prfssnly and prsnlly. 12. Tll m abt a dffcult ptient exprnce. <<< who the fuck wrote this <lmfao"
  },
  {
    "nrmpProgramCode": "1096140C0",
    "questions": "Tell me about yourself, Why internal medicine ? why our program ? What do you see yourself in 10 years? How do you deal with stress? What do you think will be the most difficult part of intern year for you?"
  },
  {
    "nrmpProgramCode": "1095140C0",
    "questions": "Tell me about yourself, how did you know the hospital?, future goals, behavorial and ethic scenario questions"
  },
  {
    "nrmpProgramCode": "1089140C0",
    "questions": "Questions mostly about my experience, what I'm looking for in a residency program and what's my most challenging experience and what I learned from it, mostly conversational with 2 required behavioral questions (1 per interview), what disappointed you about medical school/do you wish you got to experience"
  },
  {
    "nrmpProgramCode": "1089140M0",
    "questions": "Meaningful experience and how it fits Yale mission statement, tell about a time you showed resilience/collegiality, time you had a conflict and what you learned, 3 words your patients would use to describe you"
  },
  {
    "nrmpProgramCode": "2260140C0",
    "questions": "Tell me about yourself, what was the last journal article you read, what do you anticipate will be strengths and weaknesses for you as an intern< didnt ask me journal artical, was very conversational for me, except group interviews were situational questions where we all answered after one another"
  },
  {
    "nrmpProgramCode": "1099140C0",
    "questions": "What's will be the most challenging part about starting intern year? Any hobbies?"
  },
  {
    "nrmpProgramCode": "1802140C0",
    "questions": "why GW, what qualities does a good leader need to have, how will you contibute to diversity at GW, tell me about a challenging time, what accomplishment are you most proud of, tell me about a time when something didn't go according to plan"
  },
  {
    "nrmpProgramCode": "2193140C0",
    "questions": "tell me about yourself/why Howard/research exp/leadership exp/what is a good team according to me/strenghths and weakness/future goals/hardest part about transitioning to reidency/any academic challenge during medical school/what kind of medical books or journals do I read"
  },
  {
    "nrmpProgramCode": "1801140C0",
    "questions": "anyone??"
  },
  {
    "nrmpProgramCode": "1800140C0",
    "questions": "(Why IM, Why this program, Whats your future goals, tell me how you deal with difficult team member, tell me when you disagreed with a team member) +1, what is the feedback you heard most often, what do you think will be that hadrest when you start residency"
  },
  {
    "nrmpProgramCode": "1102140C2",
    "questions": "PD will look at your personal statement and ask questions about this. What are your strengths and weaknesses? Where do you see yourself in 5-10 years. Tell me about yourself. Picked a random research experience off my CV and asked to describe it"
  },
  {
    "nrmpProgramCode": "1102140C0",
    "questions": "Tell me about you and your family, struggle that you had to overcome in life, what do you want to do after residency, specific questions about the CV."
  },
  {
    "nrmpProgramCode": "1892140C0",
    "questions": "Laid back and conversational. Talked about south FL fishing and sports majority of the IV. Tell me about yourself, stregnths and weakness, how would yopu go about solving a conflict with your senior resident while you are an intern, career goals."
  },
  {
    "nrmpProgramCode": "1892140C1",
    "questions": "Tell me about yourself? Strengths & Weaknesses? Memorable case? Tell me about a time you handled a conflict? Future goals in medicine? Why IM? Why this program? Have you done any research (I said no and she asked \"not even a case report?\"), Greatest accomplishment? Did you attend the resident meet & greet?"
  },
  {
    "nrmpProgramCode": "1586140C0",
    "questions": "Time you failed, time you made a mistake, greatest accomplishment, time you received a bad feedback and how you react, tell me about yourself, asked about things from CV (a lot of behavioral questions), asked if I attended the residents meeting.   do you want to go into fellowship, what would you like to improve during your residency, tell me about a time you had to advocate for a patient or colleague"
  },
  {
    "nrmpProgramCode": "2232140C2",
    "questions": "Tell me about your interests? One word that best describes you? Percentage between resident and program for resident success? Talk about your experiences teaching/tutoring"
  },
  {
    "nrmpProgramCode": "2137140C0",
    "questions": "If I could revive a famous person who would it be and why. If I could be any animal that wasn't a car or a dog what would it be and why. Talk about a moment of conflict. Tell us about hardships"
  },
  {
    "nrmpProgramCode": "1899140C0",
    "questions": "Why do you want to train at a for-profit hospital?"
  },
  {
    "nrmpProgramCode": "1981140C0",
    "questions": "Why HCA?"
  },
  {
    "nrmpProgramCode": "1662140C0",
    "questions": "tell me about yourself, why medicine and this program, interesting case, personal questions about experiences, tell me something about yourself that isnt on your application"
  },
  {
    "nrmpProgramCode": "2238140C0",
    "questions": "When are you taking your step 3? patient with ITP and platelets 9, what do you worry about? and what number of platelets you worry about? (my answer was worrying for internal bleeding especially brain, and number is 100K for ITP and 50K for normal people. Second question was hemoglobin 9 with another patient, what to do? kept going back and forth with differential diagnosis and literally stating all possibe answers and diagnostic measures, he was only looking for reticulocyte index and peripheral smear!!! not a very good approach of interview and they were just trying to finish as many interviews but felt like they weren't even putting me in rank, they are just finishing interviews <<cringe af wtf"
  },
  {
    "nrmpProgramCode": "1587140C2",
    "questions": "tell me about yourself, why IM, why that program, what do you know about Florida, future goals, proficiency in procedures, what kind of colleagues am I looking for, what professional charactertics I have that can help the program/colleagues, what do I do in my free time"
  },
  {
    "nrmpProgramCode": "1824140P0",
    "questions": "Tell me about yourself, why IM, questions about applicaiton, very conversational. What is a time in medicine where you were turned off / didn't like what you saw"
  },
  {
    "nrmpProgramCode": "1104140C0",
    "questions": "How would you shape the curriculum? How will you struggle at our program? Name times you had issues with personnel pref medical <- didnt get the same questions"
  },
  {
    "nrmpProgramCode": "1821140C0",
    "questions": "Tell me about yourself; Why IM; What are you most proud of from med school?; When you get constructive feedback from attendings what has it generally been"
  },
  {
    "nrmpProgramCode": "2166140C0",
    "questions": "Very casual and conversational. Just getting to know each other. questions about experiences, strengths, and weakness"
  },
  {
    "nrmpProgramCode": "3350140C0",
    "questions": "Anyone?"
  },
  {
    "nrmpProgramCode": "2117140C2",
    "questions": "core values, how do you reposnd to constructive critisim, what value would you add to our program, how did you deal with a conflict, and other CV questions. + handful of \"tell me about a time…..\""
  },
  {
    "nrmpProgramCode": "2117140P0",
    "questions": "conversational"
  },
  {
    "nrmpProgramCode": "1170140C0",
    "questions": "Why Loyola? Why IM?    Tell me about you as an educator/experiences educating  difficult patient experience, most rewarding experience, interrogated about how many weeks of Sub-I, ICU and sub-specialties I'm doing as an MS4... same i also got asked those questions, plus the person who i was interviewing it literally just yapped for 25 of the 30 minutes...yapped lol im laughing"
  },
  {
    "nrmpProgramCode": "1121140C0",
    "questions": "Do you have any questions for me?"
  },
  {
    "nrmpProgramCode": "1144140C0",
    "questions": "wtf. based entire interview around underserved communites and how you dealt with African and MExican populations"
  },
  {
    "nrmpProgramCode": "2247140C0",
    "questions": "Mostly just asked about things they found interesting on my app. One attending asked about a time I had a conflict. Also \"tell me about yourself\" and what are you most proud of whether it is on your application or not"
  },
  {
    "nrmpProgramCode": "1147140C0",
    "questions": "Mainly app-specific questions and conversational. Also \"why Rush\""
  },
  {
    "nrmpProgramCode": "1160140C0",
    "questions": "Clinical case that was an ethical dilemma, clinical case where SDoH impacted, challenge you've overcome, how do you envision your career 5 years out of residency"
  },
  {
    "nrmpProgramCode": "1150140C1",
    "questions": "Tell me about a challenge. How will you be culturally competent and contrubute to diversity? Tell me about a difficult patient OR team member interaction. What was a defining moment in your medical journey."
  },
  {
    "nrmpProgramCode": "1187140C0",
    "questions": "Tell me about yourself, time when you saw implicit bias in patient care, time when you had conflict/med team was not cohesive, time when you were overwhelmed with clinical duties, what do you think will be the biggest difficulty in transitioning to residency, questions about specific activities from app, Time when a patient had cultural or other barriers to shared decision making"
  },
  {
    "nrmpProgramCode": "1187140C2",
    "questions": "Casual talk, be prepared to ask a lot of questions from them."
  },
  {
    "nrmpProgramCode": "2306140C0",
    "questions": "Questions about your personality and core values (what gets you up in the morning, what makes you you, how friends describe you etc), why medicine and why IM, what can you bring to the program, what do you dislike about healthcare and what do you do about it, biggest problem with healthcare today and what 3 things would you do about it, most impactful EC, 2 clinical scenarios (1 ethics, 1 ddx)"
  },
  {
    "nrmpProgramCode": "1203140C0",
    "questions": "Why Iowa, where do you see yourself in five years, tell me about yourself/hobbies, tell me about a memorable patient that renewed your love/appreciation for IM, asked about application experiences, where are your family connections (I mentioned having family in the midwest and they asked what cities)"
  },
  {
    "nrmpProgramCode": "1217140C0",
    "questions": "Why louisville, they read your app well and ask most questions from that, chill and conversational,   what questions do you have for me, what are you looking for in a residency program"
  },
  {
    "nrmpProgramCode": "1139140C0",
    "questions": "Very chill, just mainly selling their program. Other than that, tell me about yourself, why do I want to join their program"
  },
  {
    "nrmpProgramCode": "1221140C0",
    "questions": "How did I hear about the program? General questions about my application (I got the sense my interviewers read it prior and had a genuine interest to learn more). Long term career goals? Chit chat conversation, super chill. Plenty of opportunities for me to ask questions about the program."
  },
  {
    "nrmpProgramCode": "2352140C0",
    "questions": "Chill, conversational +1"
  },
  {
    "nrmpProgramCode": "3073140C0",
    "questions": "it was incredibly chill. One interviewer asked about something that wasn't on my application (such as another hobby or experience) then we chatted about New Orleans. The other interviewer read positive things from my LORs to me and asked what I was looking for in an IM program. Also, the PD is awesome and did a 5-minute one-on-one session the day prior."
  },
  {
    "nrmpProgramCode": "1236140C0",
    "questions": "very conversational , why this program, activities outside of medicine , future goals"
  },
  {
    "nrmpProgramCode": "1241140C0",
    "questions": "greatest achievement outside medicine? why USA?"
  },
  {
    "nrmpProgramCode": "1237140C0",
    "questions": "Tell me about yourself. What are you most excited for and most nervous about for regarding residency? Tell me about something that frustrates you about the current state of medicine/healthcare system. Something along the lines of-how do you stay hopeful/positive during difficult times?"
  },
  {
    "nrmpProgramCode": "1249140C0",
    "questions": "Hobbies? Things you would do better as an attending? Explain your research? Future prospects? Why Sinai?"
  },
  {
    "nrmpProgramCode": "2316140C0",
    "questions": "Got asked a strange medical/scenario-type question about what I would do if I had a patient in the office with a really high blood pressure? And then several follow-ups to that scenario based on my answers"
  },
  {
    "nrmpProgramCode": "1252140C0",
    "questions": "Why IM? Why MD? Strengths, Weaknesses, How will you handle the stress of residency+2, what do you do for fun. Very conversational, relatively stress-free"
  },
  {
    "nrmpProgramCode": "1256140C0",
    "questions": "Tell me about yourself, challenge you've overcome, mistake you've made, example of conflict in workplace"
  },
  {
    "nrmpProgramCode": "1257140C0",
    "questions": "why Boston?"
  },
  {
    "nrmpProgramCode": "1265140C0",
    "questions": "Interview was pretty dry/seemed like they had a series of questions to go through but maybe it was just my interviewers; mostly asked questions about my future career plans, did seem like they read my app and had app-specific qs"
  },
  {
    "nrmpProgramCode": "1268140M0",
    "questions": "why CHA, questions from CV and PS, what challenges do you anticipate in residency, any questions for us"
  },
  {
    "nrmpProgramCode": "1812140C0",
    "questions": "story of a bad communication and how you handle it"
  },
  {
    "nrmpProgramCode": "1269140C0",
    "questions": "lots of questions relating to resilience"
  },
  {
    "nrmpProgramCode": "1284140C0",
    "questions": "Mostly about CV"
  },
  {
    "nrmpProgramCode": "1266140C0",
    "questions": "Why St.E's? Why do you want to be a doctor? Where do you see yourself in 5 years? Non-medical interests? Asked me about my poster and research."
  },
  {
    "nrmpProgramCode": "1290140C0",
    "questions": "Heard about medical questions, please anyone give insight? Thanks --> no medical qns, but asked to share my challenging situations"
  },
  {
    "nrmpProgramCode": "3050140C0",
    "questions": "Tell me about yourself, why IM, whats going to be the hardest part of transitioning to residency, tell me about a time where you worked with someone you didnt get along with"
  },
  {
    "nrmpProgramCode": "1286140C0",
    "questions": "Lots of questions surrouning how you will connect to the community/social determinents of health"
  },
  {
    "nrmpProgramCode": "1308140C0",
    "questions": "What guiding principles do you live by<<???"
  },
  {
    "nrmpProgramCode": "1915140C0",
    "questions": "future plans, what you look for in a program, 3 words to describe yourself, tell me abour your rotations"
  },
  {
    "nrmpProgramCode": "1978140C1",
    "questions": "why beaumont, future goals, why you, tell me about yourself"
  },
  {
    "nrmpProgramCode": "1978140C3",
    "questions": "What are you looking for in a program? If you were a medication, what would you be?<<are these questions real?"
  },
  {
    "nrmpProgramCode": "1361140C0",
    "questions": "ideal relationship between pts and doctor, memorable case with good pt-doctor relationship, how do your past experiences prepare you for your residency training, how do social determinants of health affect patients, define health equity, good educational experiences and bad educational experiences, how do you deal with mistakes, how do you take care of your wellness"
  },
  {
    "nrmpProgramCode": "1300140C0",
    "questions": "general questions about adversity and your application"
  },
  {
    "nrmpProgramCode": "1866140C1",
    "questions": "very conversational and relaxed, asked about strengths, why this program, how you approach working with a team."
  },
  {
    "nrmpProgramCode": "1951140C0",
    "questions": "Does your experiences equate to your abilities? If you totally failed an important exam, what would you do?"
  },
  {
    "nrmpProgramCode": "1292140C0",
    "questions": "What do you like to do for fun?"
  },
  {
    "nrmpProgramCode": "1293140C0",
    "questions": "What are you looking for in a residency program? Then application-specific questions"
  },
  {
    "nrmpProgramCode": "2170140C0",
    "questions": "why this program, 3 ways a friend would describe you, choose a themesong youd play while running from danger, what do you think peoples' misconceptions of you might be"
  },
  {
    "nrmpProgramCode": "1330140C0",
    "questions": "Something you would change about the program for your needs, something you want me to know about you that’s not on your application, something you're proud of. Mostly conversational, talked about resume, hobbies. Fave and least favorite med school rotations."
  },
  {
    "nrmpProgramCode": "1329140C0",
    "questions": "What are your connections to HCMC? Experiences working with the underserved, leadership style, strengths, basic stuff about your personal statement/resume, what looking for in a program"
  },
  {
    "nrmpProgramCode": "1328140C0",
    "questions": "What are you most proud of? Tell me about yourself. What makes you unique. How would friends/family describe you. Something outside of medicine you like to do and a regret in medical school that you learned from . What would you do if you couldn't be a physician and why"
  },
  {
    "nrmpProgramCode": "1334140C0",
    "questions": "Tell me about a time you had to work with someone who was culturally different from you | Talked about application and why this program | Tell me an example of a time you had to problem solve- process and outcome | Where do you see yourself career-wise in 15-20 years"
  },
  {
    "nrmpProgramCode": "2288140C0",
    "questions": "Conversation, ?s about CV"
  },
  {
    "nrmpProgramCode": "1218140C0",
    "questions": "Why IM? Why our program? A recent challenge?"
  },
  {
    "nrmpProgramCode": "1957140C0",
    "questions": "What is your opinion on DEI?"
  },
  {
    "nrmpProgramCode": "1994140C0",
    "questions": "Why medicine, meaningful patient experience, what does teamwork mean to you, why us, tell us about a conflict, what was your biggest challenge, where do you see yourself in 10 and 15 years, what is something that's not in your application that you'd like to share with us"
  },
  {
    "nrmpProgramCode": "1372140C0",
    "questions": "Why medicine, what do you want out of a residency program, why us, conversational"
  },
  {
    "nrmpProgramCode": "1408140C0",
    "questions": "One clinical scenario question, strengths, weaknesses, challenges"
  },
  {
    "nrmpProgramCode": "1380140C0",
    "questions": "What will make you a good resident? Where do you see yourself in 5 years? What's your biggest accomplishment? What are you looking for in a residency? What are your strengths and weaknesses."
  },
  {
    "nrmpProgramCode": "2375140C0",
    "questions": "Explain gaps, tell me about yourself, research, future plans, strengths/weaknesses, tell me something exciting. 10mins each. Very IV-like, not conversational. Interrogation!    (1) Why New Jersey (2) Why did you go to the place you did undergrad at (3) Any questions for me? - not conversational at all, interviewer had poor social skills"
  },
  {
    "nrmpProgramCode": "2108140C0",
    "questions": "What do you bring to the program, do you want to pursue a fellowship, what's your biggest weakness"
  },
  {
    "nrmpProgramCode": "1380140C0",
    "questions": "What do you want to do with your life/where do you see yourself in five years, what do you like and not like about the program"
  },
  {
    "nrmpProgramCode": "2298140C0",
    "questions": "why this program"
  },
  {
    "nrmpProgramCode": "1398140C0",
    "questions": "Very conversational, read your app be ready to explain your role in research , volunteer expereinnces and clinical experiecnes emntioned in PS"
  },
  {
    "nrmpProgramCode": "2391140C0",
    "questions": "Strengths and weaknesses, why train in the US, what are future goals"
  },
  {
    "nrmpProgramCode": "1962140C0",
    "questions": "4 standarized questions per interviewer"
  },
  {
    "nrmpProgramCode": "2182140C0",
    "questions": "what kind of fruit would you be and why"
  },
  {
    "nrmpProgramCode": "1414140C0",
    "questions": "Talk to me please < Very standard questions, not conversational. Just asked Q's about app"
  },
  {
    "nrmpProgramCode": "1442140C0",
    "questions": "Conversational friendly interviews. Make sure to haev crisp answers for all the commonly asked questions."
  },
  {
    "nrmpProgramCode": "1420140C0",
    "questions": "asked medical questions"
  },
  {
    "nrmpProgramCode": "2207140M0",
    "questions": "Behavioral questions! Loads of em"
  },
  {
    "nrmpProgramCode": "1492140C0",
    "questions": "Conversational. Questions about family, time in medical school, aspirations, etc."
  },
  {
    "nrmpProgramCode": "1445140C0",
    "questions": "Tell me about yourself, communication barriers, how do you deal with them, difficult patient, why IM, what do you do for fun"
  },
  {
    "nrmpProgramCode": "2230140C0",
    "questions": "tell me about yourself, what unethical thing you witness,"
  },
  {
    "nrmpProgramCode": "3172140C0",
    "questions": "Asked me questions from my CV/make sure u know it like the back of your hand+ a couple basic behavioural Q's (how to handle difficult co-workers, biggest fear coming into residency)"
  },
  {
    "nrmpProgramCode": "1484140C0",
    "questions": "Tell me about yourself, What makes you unique, strengths and weaknesses, Part of your CV you are proud of/ need to improve, conflict resolution, goals after residency"
  },
  {
    "nrmpProgramCode": "1428140C0",
    "questions": "tell me about yourself, questions about your experiences, how did you resolve a conflict with a professor or colleague, some behavioral questions, differences between home country and US healthcare system, where do you see yourself in 10 years > unpleasantly surprised with amount of behav questions. > what kind of behavioural questions please?"
  },
  {
    "nrmpProgramCode": "3153140C0",
    "questions": "How do you resolve a conflict? Behavioral question about dealing with failure or missed diagnosis and how you reflect on that. How do you work in a team/what do you do when not all members are working together? Mostly non-stop behavioral questions for 3 interviews"
  },
  {
    "nrmpProgramCode": "1459140C0",
    "questions": "How did you resolve a conflict? What are your hobbies? What are you weaknesses? + CV-specific"
  },
  {
    "nrmpProgramCode": "2309140C0",
    "questions": "Medical questions asked by PD and cardiology faculty. Was asked to roleplay a sign-out situation with the PD (weird interaction)>> same, medical questions, weird vibe"
  },
  {
    "nrmpProgramCode": "3153140C3",
    "questions": ".."
  },
  {
    "nrmpProgramCode": "1490140C0",
    "questions": "Tell me about yourself, why Sinai, obstacle(s) you've overcome, memorable patient, what questions for me + 2 << i read your personal statement, could you tell me more re why it is you +2 <<difficult patient experience and what you learned +3"
  },
  {
    "nrmpProgramCode": "1491140C0",
    "questions": "Tell me about yourself, CV, some behavioral"
  },
  {
    "nrmpProgramCode": "1448140C0",
    "questions": "Tell me how you handle adversity"
  },
  {
    "nrmpProgramCode": "1429140C0",
    "questions": "Why their program? Tell me about an interesting case you saw and what did you learn from it?"
  },
  {
    "nrmpProgramCode": "1822140C0",
    "questions": "anyone?"
  },
  {
    "nrmpProgramCode": "1483140C0",
    "questions": "Why Northwell Lenox Hill and not NYU? What was a stressful situation and how did you handle it?"
  },
  {
    "nrmpProgramCode": "1515140C0",
    "questions": "Why here, 3 words to describe you, name one time you said something you later regretted"
  },
  {
    "nrmpProgramCode": "2183140C0",
    "questions": "questions about experiences, tell me about the last presentation you gave and how do you know it was well understood by everyone..., tell me about a time you felt things could be improved or didn't like how things were being done and what did you do about it"
  },
  {
    "nrmpProgramCode": "1509140C0",
    "questions": "A lot of questions about CV + how you handle disagreement and conflict"
  },
  {
    "nrmpProgramCode": "1426140C0",
    "questions": "questions relating to diversity etc, Any one interviewd here? kindly mention IV qs thanks?"
  },
  {
    "nrmpProgramCode": "1516140C0",
    "questions": "Any one interviewd here? kindly mention IV qs thanks?"
  },
  {
    "nrmpProgramCode": "3099140C0",
    "questions": "Tell me about yourself, how do you approach complex patients, whats an example when you applied feedback given to you, tell me an example of a conflict you had with an attending or a resident and your appraoch after that, why IM, why buffalo, tell me about your IM rotations"
  },
  {
    "nrmpProgramCode": "1511140C0",
    "questions": "What you want out of residency and how Rochester supports that/why rochester, perceived difficulty with transition from med student to intern, how will you handle the stress of residency"
  },
  {
    "nrmpProgramCode": "2157140C0",
    "questions": "felt like i got pimped about an acronym stood for on my application associated with volunteer work and I was so caught off guard I mixed up the acronoym which i should have known cold. that's on me, but... it definitely felt like I was being quizzed on tiny details rather than asked about more important things (this was from a faculty member, not the PD who was super nice). +2 Also got pimped about details of application including research. +1 Felt like the goal was to find something I didn't know. // I was asked questions about my medical education (IM curriculum) +1"
  },
  {
    "nrmpProgramCode": "3116140C1",
    "questions": "tell me about yourself, why woodhull, what kind of animal would you be and why, how would you deal with a difficult patient or a patient arriving late a patient encounter where you had to approach the situation with empathy"
  },
  {
    "nrmpProgramCode": "1435140C0",
    "questions": "Tell me about yourself, strengths / why should we choose you?, what questions do you have for me? <<literally one person came to the IV and started off asking if i had questions and thats it"
  },
  {
    "nrmpProgramCode": "1527140C0",
    "questions": "Very conversational, no intense questioning. Most meaningful experience in medical school? Most challenging? Why IM/medicine. What are you looking for in residency program. Asked about application things. Future career plans/goals. What is the most important question you would ask if you were in my shoes interviewing you? Name something your med school could do to improve the education they provide. Name something med students do that decreases the quality of their education."
  },
  {
    "nrmpProgramCode": "1529140C0",
    "questions": "Tailored to application for most part, PD asks tell me about yourself that's not on your app and time you worked well with a team and what you contributed, time you judged someone and what changed your mind, proudest moment outside academia   Greatest strengths? Weakness?"
  },
  {
    "nrmpProgramCode": "3057140C0",
    "questions": "Why ECU, strengths/weakness, questions about experiences/app, plans for the future. Very conversational"
  },
  {
    "nrmpProgramCode": "3023140C0",
    "questions": "Why this program, behavioral style questions \"tell me about a time when...\""
  },
  {
    "nrmpProgramCode": "1534140C0",
    "questions": "On interview was very conversational. One interview was all behavioral. PD was a mix of pointed qs/behavioral and asking her questions."
  },
  {
    "nrmpProgramCode": "1900140C0",
    "questions": "where do you see yourself in 5-10 years, what are you most nervous for residency, what are you looking forward to, how do you cope with stress, what is a good show/movie/book that you've seen/read. Questions were overall very open ended."
  },
  {
    "nrmpProgramCode": "1537140C0",
    "questions": "Very conversational, some questions about app, maybe 1-2 behavioral"
  },
  {
    "nrmpProgramCode": "2275140C0",
    "questions": "Mostly conversational, why WakeMed/Raleigh, why IM, what are you most proud of, no behavioral questions"
  },
  {
    "nrmpProgramCode": "1542140C0",
    "questions": "What are your plans after residency? What are your passions outside of medicine?"
  },
  {
    "nrmpProgramCode": "1553140C0",
    "questions": "Why IM, What are you looking for in a residency, What are you weaknesses?"
  },
  {
    "nrmpProgramCode": "1552140C0",
    "questions": "Why CWRU, What are you looking for in a residency, further questions, please?"
  },
  {
    "nrmpProgramCode": "1547140C0",
    "questions": "Tell me about a great team that you were a part of. What made that situation a good team? What are the top qualities you think are needed in an effective team?"
  },
  {
    "nrmpProgramCode": "1968140C0",
    "questions": "CV-specific questions then behavioral. Tell me about a time that you led a team. Tell me about a time you received feedback."
  },
  {
    "nrmpProgramCode": "1968140C4",
    "questions": "Anyone ?"
  },
  {
    "nrmpProgramCode": "2122140C0",
    "questions": "conversational, why us"
  },
  {
    "nrmpProgramCode": "2203140C0",
    "questions": "why them? connection to ohio?"
  },
  {
    "nrmpProgramCode": "1566140C0",
    "questions": "Tell me about a conflict you had.+2 What makes a good leader. Tell me about a time you made a mistake and were corrected. Tell me about a time you recieved negative feedback and how did you address it"
  },
  {
    "nrmpProgramCode": "2308140C0",
    "questions": "PLEASE SHARE ANYONE"
  },
  {
    "nrmpProgramCode": "1579140C0",
    "questions": "PLEASE SHARE ANYONE"
  },
  {
    "nrmpProgramCode": "1594140C0",
    "questions": "mix of standardized/behavioral and conversational"
  },
  {
    "nrmpProgramCode": "1599140C0",
    "questions": "Behavioral questions/App-specific questions and conversational"
  },
  {
    "nrmpProgramCode": "1599140C1",
    "questions": "Behavioral questions, strong emphasis on social justice"
  },
  {
    "nrmpProgramCode": "1827140C0",
    "questions": "Conversational"
  },
  {
    "nrmpProgramCode": "1715140C0",
    "questions": "Conversational"
  },
  {
    "nrmpProgramCode": "1631140C0",
    "questions": "Conversational"
  },
  {
    "nrmpProgramCode": "1648140C0",
    "questions": "Tell me about an opinion you had that has changed over time. Tell me about constructive criticism you've received. Otherwise very conversational"
  },
  {
    "nrmpProgramCode": "3185140C0",
    "questions": "anyone ? I hear they ask medical questions <Explain the coagulation cascade< Workup cases, differential diagnosis, s/e of meds"
  },
  {
    "nrmpProgramCode": "1608140C0",
    "questions": "tell me about yourself? What rotation are you currently on? Very chill and conversational."
  },
  {
    "nrmpProgramCode": "1632140C0",
    "questions": "ANYONE?"
  },
  {
    "nrmpProgramCode": "1617140C0",
    "questions": "Very conversational. How have you grown/changed since you started med school? Most impactful volunteer experience and why? Time you received constructive criticism?"
  },
  {
    "nrmpProgramCode": "1630140C0",
    "questions": "tell me about yourself, most directed at my app +1.... real chill interviews, most questions directed at your app"
  },
  {
    "nrmpProgramCode": "1605140C0",
    "questions": "asked questions regarding my cv and to elaborate +1"
  },
  {
    "nrmpProgramCode": "1646140C0",
    "questions": "Question about item on resume, conflict with someone in the hospital/on your team and how you handeled it, where you see yourself in your career in 10 years, PD has you write a brief post-IV diversity essay, tell me about yourself, why temple, what are you looking for in a program, how do you deal with stress, tell me something you learned from a community outreach experience and what you will bring to temple, tell me about an emotionally difficult patient encounter, tell me about a time you failed and how you handled it"
  },
  {
    "nrmpProgramCode": "1661140C0",
    "questions": "MMI"
  },
  {
    "nrmpProgramCode": "1652140C0",
    "questions": "Why UPMC? Future plans and then mostly specific questions related to app"
  },
  {
    "nrmpProgramCode": "1615140C0",
    "questions": "Tell me about yourself, why IM, how would your friends describe you, future goals in medicine, hobbies"
  },
  {
    "nrmpProgramCode": "2173140C0",
    "questions": "Very nice interview overall, just the normal questions nothing off the wall"
  },
  {
    "nrmpProgramCode": "1649140C0",
    "questions": "General questions only"
  },
  {
    "nrmpProgramCode": "1674140C0",
    "questions": "please share more details other than casual IV and gaps in YOG"
  },
  {
    "nrmpProgramCode": "1677140C0",
    "questions": "tell me about a time you made an error, what are you most proud of, tell me about your journey, future plans, tell me about your research, tell me about a challenge in medical school. Mostly conversational with 1-2 standardized questions."
  },
  {
    "nrmpProgramCode": "2270140C0",
    "questions": "Why us, most challening thing you've done, something your're proud of, questions about app"
  },
  {
    "nrmpProgramCode": "1680140C0",
    "questions": "Very conversational, specifics about personal statement/background, what are you looking for in a program"
  },
  {
    "nrmpProgramCode": "1683140C0",
    "questions": "Tell me about constructive criticism you received. Tell me about a time you disagreed with a resident or attending. Tell me something you wish would have been different about your medical training and what you have done to change it"
  },
  {
    "nrmpProgramCode": "2805140C0",
    "questions": "very conversational , ask a few open ended questions about what diversity means to you , what are you looking for in a program"
  },
  {
    "nrmpProgramCode": "2066140C0",
    "questions": "Tell me about yourself, strengths and weakness, what is something on your app that is really impactful to you but may not have been expressed well, career goals, questions about experiences. Very conversational."
  },
  {
    "nrmpProgramCode": "2252140C0",
    "questions": "Why are you interested in HCA?"
  },
  {
    "nrmpProgramCode": "1844140C0",
    "questions": "- your most rewarding experience of medical school, what are you most proud of, memorable patient experience, how do you wish to practice medicine, why Memphis"
  },
  {
    "nrmpProgramCode": "1702140C0",
    "questions": "Very conversational, asked about background/illegal activities, future career plans, 2-3 behavioral questions (professionalism, ethics) // only questions in mine were about my application and what I wanted in residency, nothing behavioral"
  },
  {
    "nrmpProgramCode": "1716140C0",
    "questions": "Tell me acerca de a time you were selfless, Tell me about a tiempo where you say a physician, colega or other student doing unprofessional, tell me about a time where you got into a conflicto with a team y cómo you handled it, Tell me acerca de a time when you had to overcome bias ; tell me acerca de a time when a mentor/patient impacted you a lot ; what do you do to prevent stress y burnout ; what obstacle do you foresee in residency ; tell me acerca de a time when you had to make a difficult decisión"
  },
  {
    "nrmpProgramCode": "2259140C0",
    "questions": "Conversational, but related to my app and takeaways from my experiences. One \"what would you do in the situation\" question"
  },
  {
    "nrmpProgramCode": "1706140C0",
    "questions": "Why IM, why this program, hobbies, how do you de-stress, 5/10 year plan"
  },
  {
    "nrmpProgramCode": "2116140C0",
    "questions": "why do you want to train at a for-profit hospital?"
  },
  {
    "nrmpProgramCode": "2110140C0",
    "questions": "tell me about yourself, why IM, why this program, are you interested in fellowship, what are your plans after graduation,  A time you were in a team during medical rotations and how that went, a quote that you remember the most"
  },
  {
    "nrmpProgramCode": "2211140C1",
    "questions": "Tell me about yourself, why IM, why this program, a time you failed, hobbies"
  },
  {
    "nrmpProgramCode": "1707140C0",
    "questions": "Tell me about yourself. Any ties to dallas. What do you want to do in five years. Very conversational and no behavioral questions"
  },
  {
    "nrmpProgramCode": "1167140C0",
    "questions": "Application specific, future plans in medicine, why Houston"
  },
  {
    "nrmpProgramCode": "1167140C1",
    "questions": "Anyone please? +1"
  },
  {
    "nrmpProgramCode": "1725140C0",
    "questions": "Pretty conversational, some odd questions like what is something in healthcare that should be changed? but in general, very convo, PD is super chill and makes dad jokes in the end"
  },
  {
    "nrmpProgramCode": "2993140C0",
    "questions": "Very conversational interview, 30 min 2 interview, one of them was with PD. Genral questions about App/PS,"
  },
  {
    "nrmpProgramCode": "1710140C0",
    "questions": "3 15 min interviews with PD, APD, and chief resident; no PD presentation or Q&A during IV, there is an optional resident Q&A night before IV, finished in under an hour, time efficient which I appreciated. tell me about yourself, why this program, hobbies, weaknesses, challenges/obstacle overcome, research"
  },
  {
    "nrmpProgramCode": "1793140C0",
    "questions": "most questions based on application, any connections to Austin"
  },
  {
    "nrmpProgramCode": "2923140C0",
    "questions": "Tell me about a memorable patient experience; Who is one of your mentors and why"
  },
  {
    "nrmpProgramCode": "1722140C0",
    "questions": "Very chill, mostly questions based off application (hobbies, research experience, etc). Where do you want to be in 5 years?"
  },
  {
    "nrmpProgramCode": "2835140C0",
    "questions": "tell me about yourself, questions based on application, 5 year goal, why UTSW - very application specific, conversational"
  },
  {
    "nrmpProgramCode": "1732140C0",
    "questions": "What is your connection to Utah?"
  },
  {
    "nrmpProgramCode": "1734140C0",
    "questions": "Extremely conversational, what was the hardest part of medical school, what are you looking for in a program, why UVM? Was asked a lot about hobbies."
  },
  {
    "nrmpProgramCode": "1748140C0",
    "questions": "tell me about yourself, why VTC, tell me about a time u had to delegate, tell me about a time you witnessed a challenging conversation w/ a patient or amongst colleagues"
  },
  {
    "nrmpProgramCode": "2980140C0",
    "questions": "very conversational, no behavioral questions, ask about things on your app, why EVMS?"
  },
  {
    "nrmpProgramCode": "2129140C0",
    "questions": "Why LG, will address any red flags on your app, tell me what you're looing for in a program, etc."
  },
  {
    "nrmpProgramCode": "3199140C0",
    "questions": "Tell me about yourself, why IM, what are you looking for in a program, otherwise random stuff about hobbies"
  },
  {
    "nrmpProgramCode": "2347140C0",
    "questions": "Why MWHC? Challenges?"
  },
  {
    "nrmpProgramCode": "1739140C0",
    "questions": "All behavioral questions aside from PD which is a little more conversational, that said nothing out of left field, all the usual cliche questions"
  },
  {
    "nrmpProgramCode": "2145140C0",
    "questions": "Why Danville/community program? Where do you see yourself in 10 years? What book have you read recently?"
  },
  {
    "nrmpProgramCode": "1737140C0",
    "questions": "Super conversational, questions about your app, no behavioral ones"
  },
  {
    "nrmpProgramCode": "1743140C0",
    "questions": "All behavioral questions aside from PD which is a little more conversational, that said nothing out of left field, all the usual cliche questions"
  },
  {
    "nrmpProgramCode": "2216140C0",
    "questions": "Conversational, why IM, why Norton...very quick interview day. 3 x 20 min then done."
  },
  {
    "nrmpProgramCode": "2159140C0",
    "questions": "disorganized format, some clinical prompts, some behavioral, some conversational, much of it repetitive and impersonal, sounds like a terrible progrm overall   Mostly well structured-- why Skagit, tell me about yourself, mostly MMI's."
  },
  {
    "nrmpProgramCode": "2167140C0",
    "questions": "they read your app and discuss it with you live time lol, mostly conversational"
  },
  {
    "nrmpProgramCode": "1918140C0",
    "questions": "4 standardized questions. 2 during each 45 minute interview"
  },
  {
    "nrmpProgramCode": "1756140C1",
    "questions": "Time you demonstrated resiliency, overcame a challenge with your team and how apply those skills to residency, what does professionalism mean to you,"
  },
  {
    "nrmpProgramCode": "2276140C0",
    "questions": "Tell me a time when you were caught lying and how did you handle it!!?? -> that's fucking wack"
  },
  {
    "nrmpProgramCode": "1902140C0",
    "questions": "Why CAMC, normal behavioral quesitons"
  },
  {
    "nrmpProgramCode": "3066140C0",
    "questions": "PLEASE SHARE ANYONE"
  },
  {
    "nrmpProgramCode": "1837140C0",
    "questions": "what job would you have if you couldn't work in healthcare/science. Why WVU, strength/weaknesses ,Why IM, What are you looking for in a residency"
  },
  {
    "nrmpProgramCode": "1774140C0",
    "questions": "Why Gundersen, where see self in 10 years, time overcame significant challenge/setback, what do for wellness, how approach upset pt, resume Qs"
  },
  {
    "nrmpProgramCode": "1784140C0",
    "questions": "Strengths & weaknesses. Tell me about a meaningful patient experience."
  },
  {
    "nrmpProgramCode": "1779140C0",
    "questions": "2 standardized \"tell me about a time...\" questions, otherwise typical why medicine questions"
  }
]